import 'dart:collection';

import 'package:flutter_app_quiz_game/Game/Question/Model/category_difficulty.dart';
import 'package:flutter_app_quiz_game/Game/Question/Model/question.dart';
import 'package:flutter_app_quiz_game/Game/Question/all_questions_service.dart';
import 'package:flutter_app_quiz_game/Implementations/Anatomy/Constants/anatomy_game_question_config.dart';
import 'package:flutter_app_quiz_game/Lib/Constants/language.dart';

class AnatomyAllQuestions extends AllQuestionsService {
  static final AnatomyAllQuestions singleton = AnatomyAllQuestions.internal();

  factory AnatomyAllQuestions() {
    return singleton;
  }

  AnatomyAllQuestions.internal();

  @override
  Map<Language, Map<CategoryDifficulty, List<Question>>>
      getAllQuestionsWithLanguages() {
    var questionConfig = AnatomyGameQuestionConfig();
    Map<Language, Map<CategoryDifficulty, List<Question>>> result =
        HashMap<Language, Map<CategoryDifficulty, List<Question>>>();
    addAR(result, questionConfig);
    addBG(result, questionConfig);
    addCS(result, questionConfig);
    addDA(result, questionConfig);
    addDE(result, questionConfig);
    addEL(result, questionConfig);
    addEN(result, questionConfig);
    addES(result, questionConfig);
    addFI(result, questionConfig);
    addFR(result, questionConfig);
    addHE(result, questionConfig);
    addHI(result, questionConfig);
    addHR(result, questionConfig);
    addHU(result, questionConfig);
    addID(result, questionConfig);
    addIT(result, questionConfig);
    addJA(result, questionConfig);
    addKO(result, questionConfig);
    addMS(result, questionConfig);
    addNL(result, questionConfig);
    addNB(result, questionConfig);
    addPL(result, questionConfig);
    addPT(result, questionConfig);
    addRO(result, questionConfig);
    addRU(result, questionConfig);
    addSK(result, questionConfig);
    addSL(result, questionConfig);
    addSR(result, questionConfig);
    addSV(result, questionConfig);
    addTH(result, questionConfig);
    addTR(result, questionConfig);
    addUK(result, questionConfig);
    addVI(result, questionConfig);
    addZH(result, questionConfig);
    return result;
  }

  void addAR(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.ar;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎الكبد‎‎:‎‎1,2,3‎‎:‎‎29.2,45‎", "‎‎‎‎‎‎فم‎‎:‎‎4,2,9‎‎:‎‎28.1,81.6‎", "‎‎‎‎‎‎المريء‎‎:‎‎1,8,5‎‎:‎‎48.6,58.6‎", "‎‎‎‎‎‎الأمعاء الغليظة‎‎:‎‎4,2,6‎‎:‎‎20.5,21‎", "‎‎‎‎‎‎الأمعاء الدقيقة‎‎:‎‎8,7,1‎‎:‎‎52.4,19‎", "‎‎‎‎‎‎معدة‎‎:‎‎4,6,7‎‎:‎‎66,41‎", "‎‎‎‎‎‎البلعوم‎‎:‎‎5,2,9‎‎:‎‎48.6,81‎", "‎‎‎‎‎‎المرارة‎‎:‎‎6,9,4‎‎:‎‎31.3,39.6‎", "‎‎‎‎‎‎البنكرياس‎‎:‎‎2,1,0‎‎:‎‎50,35.1‎", "‎‎‎‎‎‎زائدة‎‎:‎‎2,8,3‎‎:‎‎35.1,9.6‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎جمجمة‎‎:‎‎11,8,6‎‎:‎‎48,97‎", "‎‎‎‎‎‎الكتف‎‎:‎‎5,4,3‎‎:‎‎61.1,80.2‎", "‎‎‎‎‎‎القفص الصدرى‎‎:‎‎11,7,0‎‎:‎‎56,74.1‎", "‎‎‎‎‎‎العمود الفقري‎‎:‎‎8,10,1‎‎:‎‎45.9,65.2‎", "‎‎‎‎‎‎قصبة الساق‎‎:‎‎5,9,3‎‎:‎‎51.4,23.6‎", "‎‎‎‎‎‎عظم الفخذ‎‎:‎‎4,10,7‎‎:‎‎54.9,35.5‎", "‎‎‎‎‎‎عظم العضد‎‎:‎‎2,7,9‎‎:‎‎69.1,66.2‎", "‎‎‎‎‎‎عظام المشط‎‎:‎‎6,0,1‎‎:‎‎81.3,44.8‎", "‎‎‎‎‎‎عظام الرسغ‎‎:‎‎5,4,2‎‎:‎‎77.1,48.7‎", "‎‎‎‎‎‎طرسوس‎‎:‎‎4,3,1‎‎:‎‎49.3,6.9‎", "‎‎‎‎‎‎عظام مشط القدم‎‎:‎‎0,3,5‎‎:‎‎54.2,2.8‎", "‎‎‎‎‎‎الحوض‎‎:‎‎0,6,9‎‎:‎‎59,58.3‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎العضلة الدالية‎‎:‎‎4,1,5‎‎:‎‎65.3,80.2‎", "‎‎‎‎‎‎العضلة ذات الرأسين‎‎:‎‎5,0,4‎‎:‎‎67.3,71.5‎", "‎‎‎‎‎‎عضلات صدرية‎‎:‎‎5,0,4‎‎:‎‎52.5,76.4‎", "‎‎‎‎‎‎عضلة شبه منحرفة‎‎:‎‎1,5,4‎‎:‎‎51.4,85.5‎", "‎‎‎‎‎‎البطن الخارجي المائل‎‎:‎‎1,5,0‎‎:‎‎54.2,65.9‎", "‎‎‎‎‎‎الظنبوب الأمامي‎‎:‎‎1,0,3‎‎:‎‎59.7,21.8‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎قلب‎‎:‎‎4,2,5‎‎:‎‎65.3,73‎", "‎‎‎‎‎‎الأبهر‎‎:‎‎4,2,5‎‎:‎‎62.9,77.6‎", "‎‎‎‎‎‎الأوردة الكلوية‎‎:‎‎0,4,5‎‎:‎‎57.3,59.1‎", "‎‎‎‎‎‎الشريان الكلوي‎‎:‎‎0,5,4‎‎:‎‎61.5,59.1‎", "‎‎‎‎‎‎عروق الوداجي‎‎:‎‎0,2,5‎‎:‎‎60.4,86.1‎", "‎‎‎‎‎‎الوريد الفخذي‎‎:‎‎0,2,4‎‎:‎‎67.4,37‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎مخ‎‎:‎‎5,4,3‎‎:‎‎50.4,96.8‎", "‎‎‎‎‎‎المخيخ‎‎:‎‎5,4,3‎‎:‎‎56,92.6‎", "‎‎‎‎‎‎الحبل الشوكي‎‎:‎‎0,4,3‎‎:‎‎50.7,86.8‎", "‎‎‎‎‎‎العصب الوركي‎‎:‎‎0,4,5‎‎:‎‎59.4,37.6‎", "‎‎‎‎‎‎العصب الظنبوبي‎‎:‎‎1,5,3‎‎:‎‎61.1,19.4‎", "‎‎‎‎‎‎عقدة‎‎:‎‎4,3,1‎‎:‎‎49,70‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎شفه‎‎:‎‎1,2,4‎‎:‎‎61.4,96.6‎", "‎‎‎‎‎‎اللهاة‎‎:‎‎6,2,0‎‎:‎‎48.6,51.8‎", "‎‎‎‎‎‎ضروس‎‎:‎‎0,6,1‎‎:‎‎76.1,33‎", "‎‎‎‎‎‎القاطعة‎‎:‎‎0,4,1‎‎:‎‎50.4,83‎", "‎‎‎‎‎‎لسان‎‎:‎‎7,2,0‎‎:‎‎48.2,27.6‎", "‎‎‎‎‎‎لوزة‎‎:‎‎4,0,6‎‎:‎‎69.5,46.8‎", "‎‎‎‎‎‎الحنك الصلب‎‎:‎‎1,2,0‎‎:‎‎48.6,73.8‎", "‎‎‎‎‎‎حنك رخو‎‎:‎‎4,2,0‎‎:‎‎56.3,61‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎الفص الجبهي‎‎:‎‎1,2,4‎‎:‎‎25,58.5‎", "‎‎‎‎‎‎الفص الصدغي‎‎:‎‎0,2,3‎‎:‎‎51.2,42.2‎", "‎‎‎‎‎‎الفص الجداري‎‎:‎‎0,1,3‎‎:‎‎66,69‎", "‎‎‎‎‎‎الفص القذالي‎‎:‎‎0,1,2‎‎:‎‎91,46‎", "‎‎‎‎‎‎المخيخ‎‎:‎‎1,2,0‎‎:‎‎72.8,26.1‎", "‎‎‎‎‎‎جذع الدماغ‎‎:‎‎1,2,0‎‎:‎‎63.3,17.6‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎أذن‎‎:‎‎1,2,4‎‎:‎‎8,31‎", "‎‎‎‎‎‎قناة الأذن‎‎:‎‎0,2,6‎‎:‎‎33.5,42.1‎", "‎‎‎‎‎‎طبلة الأذن‎‎:‎‎1,5,6‎‎:‎‎55.6,42‎", "‎‎‎‎‎‎عظيمات‎‎:‎‎1,0,6‎‎:‎‎54.3,52.9‎", "‎‎‎‎‎‎قوقعة‎‎:‎‎6,1,5‎‎:‎‎75.8,45.7‎", "‎‎‎‎‎‎العصب السمعي‎‎:‎‎6,2,1‎‎:‎‎91.8,48‎", "‎‎‎‎‎‎فناة اوستاكي‎‎:‎‎5,1,3‎‎:‎‎77.3,28.3‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎الأبهر‎‎:‎‎8,6,3‎‎:‎‎51.7,84.7‎", "‎‎‎‎‎‎الوريد الأجوف العلوي‎‎:‎‎6,7,4‎‎:‎‎27.3,92‎", "‎‎‎‎‎‎الوريد الأجوف السفلي‎‎:‎‎1,4,3‎‎:‎‎27.8,6.8‎", "‎‎‎‎‎‎الأذين الأيمن‎‎:‎‎4,7,0‎‎:‎‎31,54.4‎", "‎‎‎‎‎‎الأذين الأيسر‎‎:‎‎7,6,0‎‎:‎‎59.6,55.5‎", "‎‎‎‎‎‎الصمام المتري‎‎:‎‎8,2,0‎‎:‎‎69.5,43.7‎", "‎‎‎‎‎‎البطين الأيمن‎‎:‎‎0,1,3‎‎:‎‎47.8,38.9‎", "‎‎‎‎‎‎البطين الايسر‎‎:‎‎1,8,3‎‎:‎‎58.1,43‎", "‎‎‎‎‎‎صمام ثلاثي الشرفات‎‎:‎‎1,0,5‎‎:‎‎41,27‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎قزحية‎‎:‎‎6,3,4‎‎:‎‎11.3,57‎", "‎‎‎‎‎‎القرنية‎‎:‎‎2,6,4‎‎:‎‎1.7,50.5‎", "‎‎‎‎‎‎عدسة‎‎:‎‎1,4,6‎‎:‎‎19,51.3‎", "‎‎‎‎‎‎شبكية العين‎‎:‎‎1,6,4‎‎:‎‎64.6,76.8‎", "‎‎‎‎‎‎العصب البصري‎‎:‎‎0,6,3‎‎:‎‎87.9,36.2‎", "‎‎‎‎‎‎الحجرة الأمامية‎‎:‎‎6,4,3‎‎:‎‎7.2,51.4‎", "‎‎‎‎‎‎جسم زجاجي‎‎:‎‎1,4,3‎‎:‎‎49.3,65‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎نواة‎‎:‎‎5,3,2‎‎:‎‎57.3,75.5‎", "‎‎‎‎‎‎نوية‎‎:‎‎2,6,4‎‎:‎‎44.5,67.9,8‎", "‎‎‎‎‎‎السيتوبلازم‎‎:‎‎1,4,6‎‎:‎‎93.08,50.09,9‎", "‎‎‎‎‎‎غشاء الخلية‎‎:‎‎2,5,1‎‎:‎‎90,24,14‎", "‎‎‎‎‎‎الريبوسوم‎‎:‎‎2,1,3‎‎:‎‎80.929,75.844,14‎", "‎‎‎‎‎‎ميتوكوندريا‎‎:‎‎1,2,3‎‎:‎‎51.4,90.35,18‎", "‎‎‎‎‎‎الشبكة الأندوبلازمية‎‎:‎‎2,4,1‎‎:‎‎63.9,25‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎الأكسجين‎‎:‎‎1,2,4‎‎:‎‎74.5,29,25‎", "‎‎‎‎‎‎كربون‎‎:‎‎2,0,4‎‎:‎‎74.5,57,25‎", "‎‎‎‎‎‎هيدروجين‎‎:‎‎1,0,5‎‎:‎‎74.5,73.2,25‎", "‎‎‎‎‎‎نتروجين‎‎:‎‎1,0,2‎‎:‎‎74.5,83.5,25‎", "‎‎‎‎‎‎الكالسيوم‎‎:‎‎0,1,2‎‎:‎‎74.5,91.2,25‎", "‎‎‎‎‎‎الفوسفور‎‎:‎‎1,2,0‎‎:‎‎74.5,96.82,25‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هو العضو الذي ينتج الصفراء اللازمة لعملية الهضم؟‎‎:‎‎0,7,6,8‎‎‎", "‎‎‎‎‎ما هو الجزء الأول من القناة الهضمية الذي يستقبل الطعام وينتج اللعاب؟‎‎:‎‎1,2,6,5‎‎‎", "‎‎‎‎‎من خلال أي غذاء ينتقل من البلعوم إلى المعدة؟‎‎:‎‎2,6,9,7‎‎‎", "‎‎‎‎‎ما هو العضو الذي هو آخر جزء من الجهاز الهضمي؟‎‎:‎‎3,4,7,8‎‎‎", "‎‎‎‎‎أين يحدث أكبر قدر من امتصاص العناصر الغذائية والمعادن من الطعام؟‎‎:‎‎4,5,3,0‎‎‎", "‎‎‎‎‎ما هو العضو الذي يفرز الإنزيمات الهضمية وحمض المعدة للمساعدة في هضم الطعام؟‎‎:‎‎5,4,7,3‎‎‎", "‎‎‎‎‎ما هو اسم الجزء من الحلق خلف الفم وتجويف الأنف؟‎‎:‎‎6,2,9,8‎‎‎", "‎‎‎‎‎أين يتم تخزين الصفراء وتركيزها قبل إطلاقها في الأمعاء الدقيقة؟‎‎:‎‎7,6,9,8‎‎‎", "‎‎‎‎‎من أين يفرز الأنسولين؟‎‎:‎‎8,0,7,6‎‎‎", "‎‎‎‎‎ما هو العضو الموجود في أسفل البطن الأيمن؟‎‎:‎‎9,0,7,2‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هي بنية العظام التي تشكل الرأس؟‎‎:‎‎0,1,9,7‎‎‎", "‎‎‎‎‎ما هو المعروف أيضا باسم عظم الكتف؟‎‎:‎‎1,9,11,6‎‎‎", "‎‎‎‎‎ما هو الهيكل العظمي والغضروفي شبه الصلب الذي يحيط بالتجويف الصدري؟‎‎:‎‎2,7,8,11‎‎‎", "‎‎‎‎‎ما هي السمة المميزة للفقاريات؟‎‎:‎‎3,0,11,2‎‎‎", "‎‎‎‎‎ما هو أكبر عظمتين في الساق تحت الركبة؟‎‎:‎‎4,6,9,5‎‎‎", "‎‎‎‎‎ما هي أطول وأقوى عظمة في جسمك؟‎‎:‎‎5,6,9,1‎‎‎", "‎‎‎‎‎ما هو عظم طويل في الذراع يمتد من الكتف إلى الكوع؟‎‎:‎‎6,5,1,7‎‎‎", "‎‎‎‎‎ما هي مجموعة عظام اليد الخمسة بين الكتائب والمعصم؟‎‎:‎‎7,5,1,3‎‎‎", "‎‎‎‎‎ما هي العظام التي تتكون منها الرسغ؟‎‎:‎‎8,7,9,10‎‎‎", "‎‎‎‎‎ما هو تجمع من سبع عظام مفصلية في كل قدم؟‎‎:‎‎9,7,8,1‎‎‎", "‎‎‎‎‎ما هي مجموعة من خمسة عظام طويلة في القدم؟‎‎:‎‎10,8,7,4‎‎‎", "‎‎‎‎‎ما هو الجزء السفلي من الجذع؟‎‎:‎‎11,6,3,2‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هي العضلة التي تشكل المحيط المستدير للكتف البشري؟‎‎:‎‎0,1,3,5‎‎‎", "‎‎‎‎‎ما هي العضلة الكبيرة التي تقع في مقدمة العضد بين الكتف والكوع؟‎‎:‎‎1,0,2,3‎‎‎", "‎‎‎‎‎ما هي العضلة الموجودة في صدر جسم الإنسان؟‎‎:‎‎2,3,5,1‎‎‎", "‎‎‎‎‎ما هي العضلة المثلثة الموجودة في الجزء الخلفي من الرقبة؟‎‎:‎‎3,1,2,5‎‎‎", "‎‎‎‎‎ما هي أكبر عضلة جانبية من عضلات البطن؟‎‎:‎‎4,1,2,0‎‎‎", "‎‎‎‎‎ما هي أكبر أربع عضلات في الحيز الأمامي للساق؟‎‎:‎‎5,3,0,1‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هو العضو العضلي الذي يضخ الدم عبر الأوعية الدموية في الدورة الدموية؟‎‎:‎‎0,1,3,5‎‎‎", "‎‎‎‎‎ما هو الشريان الرئيسي والأكبر في جسم الإنسان؟‎‎:‎‎1,4,3,2‎‎‎", "‎‎‎‎‎ما هي الأوردة التي تستنزف الكلى؟‎‎:‎‎2,5,4,1‎‎‎", "‎‎‎‎‎ما هي الشرايين المقترنة التي تمد الكلى بالدم؟‎‎:‎‎3,2,1,5‎‎‎", "‎‎‎‎‎ما هي الأوردة التي تأخذ الدم غير المؤكسج من الرأس إلى القلب؟‎‎:‎‎4,2,5,1‎‎‎", "‎‎‎‎‎ما هو الوريد الكبير الموجود في عمق الفخذ؟‎‎:‎‎5,2,1,4‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هو العضو الذي يعمل كمركز للجهاز العصبي؟‎‎:‎‎0,1,2,5‎‎‎", "‎‎‎‎‎ما هي السمة الرئيسية للدماغ المؤخر لجميع الفقاريات؟‎‎:‎‎1,5,0,2‎‎‎", "‎‎‎‎‎ما هو الهيكل الأنبوبي الطويل الرقيق المكون من نسيج عصبي؟‎‎:‎‎2,1,3,4‎‎‎", "‎‎‎‎‎ما هو العصب الكبير الذي يمتد بجانب مفصل الورك؟‎‎:‎‎3,2,1,5‎‎‎", "‎‎‎‎‎ما هو فرع العصب الوركي؟‎‎:‎‎4,5,2,1‎‎‎", "‎‎‎‎‎ما هي مجموعة أجسام الخلايا العصبية في الجهاز العصبي المحيطي؟‎‎:‎‎5,1,0,2‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هي الطيات العضلية التي تحيط بالفم؟‎‎:‎‎0,1,4,7‎‎‎", "‎‎‎‎‎ما هو الامتداد اللحمي الذي يتدلى فوق الحلق؟‎‎:‎‎1,4,0,7‎‎‎", "‎‎‎‎‎ما هي الأسنان المسطحة في مؤخرة الفم؟‎‎:‎‎2,3,5,6‎‎‎", "‎‎‎‎‎ما هي الأسنان الأمامية؟‎‎:‎‎3,2,5,6‎‎‎", "‎‎‎‎‎ما هو العضو العضلي في الفم؟‎‎:‎‎4,5,6,1‎‎‎", "‎‎‎‎‎ما هي الأعضاء التي تلعب دورًا مهمًا في جهاز المناعة؟‎‎:‎‎5,1,4,0‎‎‎", "‎‎‎‎‎ما هي الصفيحة العظمية الأفقية الرقيقة المكونة من عظمتين من الهيكل العظمي للوجه؟‎‎:‎‎6,7,2,5‎‎‎", "‎‎‎‎‎ما هي الأنسجة الرخوة التي تشكل مؤخرة سقف الفم؟‎‎:‎‎7,5,1,0‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هو أكبر فصوص الدماغ الأربعة؟‎‎:‎‎0,3,1,4‎‎‎", "‎‎‎‎‎ما الذي يجلس خلف الأذنين وما هو ثاني أكبر فص؟‎‎:‎‎1,0,3,2‎‎‎", "‎‎‎‎‎ما الذي يدخل في إدراك الإحساس ، بما في ذلك اللمس ودرجة الحرارة والألم؟‎‎:‎‎2,0,3,5‎‎‎", "‎‎‎‎‎ما هو مركز المعالجة البصرية للدماغ؟‎‎:‎‎3,0,1,4‎‎‎", "‎‎‎‎‎ما الذي يلعب دورًا مهمًا في التحكم في التوازن؟‎‎:‎‎4,5,0,1‎‎‎", "‎‎‎‎‎ما الذي يساعد على التحكم في معدل ضربات القلب ومعدل التنفس؟‎‎:‎‎5,0,4,3‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هو الجزء المرئي من الأذن الذي هو خارج الرأس؟‎‎:‎‎0,3,6,2‎‎‎", "‎‎‎‎‎ما هو المسار الذي يمتد من الأذن الخارجية إلى الأذن الوسطى؟‎‎:‎‎1,2,3,0‎‎‎", "‎‎‎‎‎ما هي شريحة الجلد الرقيقة التي يتم شدها بإحكام مثل الأسطوانة وتهتز عندما يضربها الصوت؟‎‎:‎‎2,0,5,3‎‎‎", "‎‎‎‎‎ما هي ثلاث عظام في الأذن الوسطى من أصغر عظام جسم الإنسان؟‎‎:‎‎3,0,6,2‎‎‎", "‎‎‎‎‎ماذا يشبه قوقعة الحلزون؟‎‎:‎‎4,2,0,6‎‎‎", "‎‎‎‎‎ما الذي يحمل المعلومات الحسية السمعية من قوقعة الأذن الداخلية مباشرة إلى الدماغ؟‎‎:‎‎5,2,0,6‎‎‎", "‎‎‎‎‎ما هو المعروف أيضا باسم الأنبوب السمعي؟‎‎:‎‎6,1,4,0‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هو الشريان الرئيسي والأكبر في جسم الإنسان؟‎‎:‎‎0,3,8,6‎‎‎", "‎‎‎‎‎أي وريد ينقل الدم من رأسك وعنقك وذراعيك وصدرك إلى قلبك؟‎‎:‎‎1,3,0,2‎‎‎", "‎‎‎‎‎أي وريد ينقل الدم من الجزء السفلي من جسمك إلى قلبك؟‎‎:‎‎2,1,0,3‎‎‎", "‎‎‎‎‎ما هي الحجرة العلوية التي يدخل الدم من خلالها إلى بطينات القلب؟‎‎:‎‎3,5,6,2‎‎‎", "‎‎‎‎‎ما حجرة القلب التي تستقبل الدم المؤكسج من الرئتين؟‎‎:‎‎4,3,6,8‎‎‎", "‎‎‎‎‎ما الصمام الذي يفصل بين غرفتي الجانب الأيسر من القلب؟‎‎:‎‎5,8,7,3‎‎‎", "‎‎‎‎‎ما هي الحجرة العضلية التي تضخ الدم من القلب إلى الدورة الدموية؟‎‎:‎‎6,5,8,2‎‎‎", "‎‎‎‎‎أي واحدة من أربع غرف للقلب؟‎‎:‎‎7,0,1,2‎‎‎", "‎‎‎‎‎يتمثل دوره في منع التدفق العكسي للدم من البطين الأيمن إلى الأذين الأيمن.‎‎:‎‎8,2,5,4‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما هي البنية الرقيقة في العين المسؤولة عن التحكم في قطر وحجم بؤبؤ العين؟‎‎:‎‎0,1,3,2‎‎‎", "‎‎‎‎‎ما هو الجزء الأمامي الشفاف من العين الذي يغطي القزحية؟‎‎:‎‎1,2,3,0‎‎‎", "‎‎‎‎‎ما هي البنية الشفافة في العين التي تساعد على انكسار الضوء للتركيز على الشبكية؟‎‎:‎‎2,3,0,1‎‎‎", "‎‎‎‎‎ما هي الطبقة الأعمق والأكثر حساسية للضوء من أنسجة العين؟‎‎:‎‎3,1,0,2‎‎‎", "‎‎‎‎‎ما الذي ينقل المعلومات المرئية من شبكية العين إلى الدماغ؟‎‎:‎‎4,6,5,3‎‎‎", "‎‎‎‎‎ما هو الجزء الأمامي من العين بين القرنية والقزحية؟‎‎:‎‎5,6,2,3‎‎‎", "‎‎‎‎‎ما حجرة العين الواقعة خلف العدسة وأمام العصب البصري؟‎‎:‎‎6,5,3,0‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ماذا يوجد في منتصف الخلية وفيه DNA مرتب في كروموسومات؟‎‎:‎‎0,1,2,3‎‎‎", "‎‎‎‎‎ما المنطقة داخل الخلية المعنية بإنتاج ريبوسومات الخلية؟‎‎:‎‎1,2,3,4‎‎‎", "‎‎‎‎‎ما هو السائل الجيلاتيني الذي يملأ داخل الخلية؟‎‎:‎‎2,3,4,5‎‎‎", "‎‎‎‎‎ما الذي يحمي الخلية من بيئتها الخارجية؟‎‎:‎‎3,4,2,1‎‎‎", "‎‎‎‎‎ما هي بنية الخلية التي تنتج البروتين؟‎‎:‎‎4,3,2,1‎‎‎", "‎‎‎‎‎ما الذي يحول الطاقة الكيميائية إلى شكل طاقة يمكن للخلية استخدامه؟‎‎:‎‎5,4,3,2‎‎‎", "‎‎‎‎‎ما هو نظام النقل للخلية حقيقية النواة؟‎‎:‎‎6,5,0,1‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["‎‎‎‎‎ما الذي يستخدم لأكسدة طعامنا ، في عملية التنفس الخلوي ، وبالتالي إطلاق الطاقة؟‎‎:‎‎0,1,2,3‎‎‎", "‎‎‎‎‎ما هو ثاني أكثر عنصر وفرة في جسم الإنسان؟‎‎:‎‎1,2,3,4‎‎‎", "‎‎‎‎‎ما الذي يستخدم للحفاظ على ترطيب جسم الإنسان؟‎‎:‎‎2,3,4,5‎‎‎", "‎‎‎‎‎ما الذي يستخدم لصنع الأحماض الأمينية في أجسامنا والتي بدورها تصنع البروتينات؟‎‎:‎‎3,5,4‎‎‎", "‎‎‎‎‎ما الذي يستخدم لبناء عظام قوية والحفاظ عليها؟‎‎:‎‎4,0,1,2‎‎‎", "‎‎‎‎‎ما الذي يستخدم في تكوين العظام والأسنان؟‎‎:‎‎5,1,2,3‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما هو المرض الذي يلتهب فيه الكبد؟‎‎:‎‎التهاب الكبد‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو المرض الذي يصيب فيه الطفيلي الجهاز الهضمي للإنسان؟‎‎:‎‎الطفيليات المعوية‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو المرض الذي يصاب البنكرياس فيه بالتهاب؟‎‎:‎‎التهاب البنكرياس‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو المرض الذي يسبب تمزق البطانة الداخلية للمعدة؟‎‎:‎‎قرحة المعدة‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو المرض الذي تلتهب فيه الزائدة الدودية؟‎‎:‎‎التهاب الزائدة الدودية‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو المرض الذي تلتهب فيه البطانة الداخلية للمعدة؟‎‎:‎‎التهاب المعدة‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما المرض الذي يسبب تورم الأوردة في أسفل المستقيم؟‎‎:‎‎بواسير‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هي الرواسب الصلبة المصنوعة من المعادن والأملاح؟‎‎:‎‎حصى الكلى‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو تندب الكبد الناجم عن تلف الكبد طويل الأمد؟‎‎:‎‎التليف الكبدي‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو نوع من مرض التهاب الأمعاء؟‎‎:‎‎مرض كرون‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما المرض الذي يسبب الألم والالتهاب في المفصل؟‎‎:‎‎التهاب المفاصل‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو كسر في استمرارية العظم؟‎‎:‎‎كسر العظام‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو المرض الذي يضعف العظام ويجعلها هشة وأكثر عرضة للكسر؟‎‎:‎‎هشاشة العظام‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما المرض الذي يسبب انحناء جانبي للعمود الفقري؟‎‎:‎‎الجنف‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو نوع التهاب المفاصل الذي يسبب آلام المفاصل الشديدة والمفاجئة؟‎‎:‎‎النقرس‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما المرض الذي يسبب الضعف التدريجي وفقدان كتلة العضلات؟‎‎:‎‎ضمور العضلات‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما المرض الذي يسببه قلة النشاط البدني؟‎‎:‎‎ضمور عضلي‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما المرض الذي يسبب التهاب أو تهيج الوتر؟‎‎:‎‎التهاب الأوتار‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو الانقباض المفاجئ واللاإرادي لإحدى عضلاتك؟‎‎:‎‎تقلصات عضلية‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ماذا يحدث عند تمدد عضلاتك أو تمزقها؟‎‎:‎‎تمزق العضلات‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما هو نوع السرطان الذي يبدأ في الخلايا التي هي جزء من جهاز المناعة في الجسم؟‎‎:‎‎سرطان الغدد الليمفاوية‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو نوع السرطان الذي يبدأ عادة في نخاع العظام؟‎‎:‎‎سرطان الدم‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما الذي يسببه التعرض لفترات طويلة لدرجات حرارة شديدة البرودة؟‎‎:‎‎انخفاض حرارة الجسم‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو تصلب الشرايين الناتج عن تراكم الترسبات التدريجي؟‎‎:‎‎تصلب الشرايين‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما هو الالتهاب الحاد الذي يصيب الأغشية الواقية التي تغطي الدماغ والنخاع الشوكي؟‎‎:‎‎التهاب السحايا‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو المرض الذي يمكن أن يصيب الدماغ والحبل الشوكي ويمكن أن يسبب مشاكل في الرؤية والتوازن والتحكم في العضلات؟‎‎:‎‎تصلب متعدد‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو اضطراب الدماغ الذي يؤدي إلى الرعشة والتيبس وصعوبة المشي والتوازن والتنسيق؟‎‎:‎‎مرض الشلل الرعاش‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما الذي يتميز به التشنجات اللاإرادية المتعددة وتوت صوتي واحد على الأقل؟‎‎:‎‎متلازمة توريت‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو اضطراب الدماغ الوراثي العضال الذي يتلف خلايا الدماغ؟‎‎:‎‎مرض هنتنغتون‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما هي عدوى اللثة الخطيرة التي تضر بالأنسجة الرخوة ويمكن أن تدمر العظام التي تدعم أسنانك؟‎‎:‎‎التهاب دواعم السن‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو الشكل الخفيف من أمراض اللثة الذي يسبب تهيج واحمرار وتورم اللثة؟‎‎:‎‎التهاب اللثة‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هي المناطق المتضررة بشكل دائم في السطح الصلب لأسنانك؟‎‎:‎‎تسوس الأسنان‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هي عدوى اللوزتين في مؤخرة الحلق؟‎‎:‎‎التهاب اللوزتين‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ماذا يحدث إذا لم يلتصق النسيج الذي يتكون منه الشفة بشكل كامل قبل الولادة؟‎‎:‎‎مشقوق الشفة‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما اضطراب الدماغ الذي يدمر الذاكرة ومهارات التفكير ، وفي النهاية القدرة على تنفيذ أبسط المهام؟‎‎:‎‎مرض الزهايمر‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هي الحالة غير الشائعة والخطيرة التي يلتهب فيها الدماغ؟‎‎:‎‎التهاب الدماغ‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو اضطراب الصداع الذي يتميز بالصداع المتكرر الذي يتراوح ما بين المتوسطة والشديدة؟‎‎:‎‎صداع نصفي‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو المرض الذي يصيب الدماغ ويسبب نوبات متكررة؟‎‎:‎‎الصرع‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ماذا يحدث عندما يتسبب فيروس أو بكتيريا في التهاب المنطقة خلف طبلة الأذن؟‎‎:‎‎التهاب الأذن‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما الذي يشير إلى العجز الكلي أو الجزئي عن سماع الأصوات؟‎‎:‎‎الصمم‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هي الحالة التي تسمع فيها الأصوات عندما لا يكون هناك مصدر خارجي للأصوات؟‎‎:‎‎طنين الأذن‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو اضطراب الأذن الداخلية الذي يمكن أن يؤدي إلى نوبات الدوار (الدوار) وفقدان السمع؟‎‎:‎‎مرض منيير‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما هو ألم الصدر الناجم عن انخفاض تدفق الدم إلى عضلات القلب؟‎‎:‎‎ذبحة‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو ضغط الدم الاعلى من الطبيعي؟‎‎:‎‎ارتفاع ضغط الدم‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ماذا يحدث عندما ينخفض ​​تدفق الدم أو يتوقف عن الشريان التاجي للقلب؟‎‎:‎‎احتشاء عضلة القلب‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هي الحالة الخطيرة التي لا يضخ فيها القلب الدم بكفاءة كما ينبغي؟‎‎:‎‎فشل القلب الاحتقاني‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما معنى ارتفاع مستويات الكوليسترول في الدم؟‎‎:‎‎ارتفاع الكولسترول‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو شذوذ ضربات القلب؟‎‎:‎‎عدم انتظام ضربات القلب‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما هي المنطقة الملبدة بالغيوم في عدسة العين والتي تؤدي إلى ضعف في الرؤية؟‎‎:‎‎إعتمام عدسة العين‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هي حالة العين التي تسببها العدوى أو الحساسية؟‎‎:‎‎التهاب الملتحمة‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هي حالة العين حيث يتلف العصب البصري الذي يربط العين بالدماغ؟‎‎:‎‎الزرق‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو اضطراب البصر الذي يفشل فيه الدماغ في معالجة المدخلات من إحدى العينين بشكل كامل ويفضل العين الأخرى بمرور الوقت؟‎‎:‎‎الغمش‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما هو نوع السرطان الذي قد يشمل كتلة في الثدي أو تغير في شكل الثدي؟‎‎:‎‎سرطان الثدي‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو أكثر أنواع السرطانات شيوعًا التي تصيب الرجال فقط؟‎‎:‎‎سرطان البروستات‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو نوع السرطان الذي تخرج فيه خلايا القولون أو المستقيم عن السيطرة؟‎‎:‎‎سرطان قولوني مستقيمي‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما نوع السرطان الذي يسببه تدخين التبغ على المدى الطويل؟‎‎:‎‎سرطان الرئة‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما نوع السرطان الذي يسببه التعرض المفرط لأشعة الشمس فوق البنفسجية؟‎‎:‎‎سرطان الجلد‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎ما هو مستوى الأكسجين الأقل من الطبيعي في دمك ، وتحديداً في الشرايين؟‎‎:‎‎نقص الأكسجة في الدم‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو مستوى الكالسيوم في الدم الذي يقل عن المعدل الطبيعي؟‎‎:‎‎نقص كالسيوم الدم‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما يسمى مستوى الكالسيوم في الدم فوق المعدل الطبيعي؟‎‎:‎‎فرط كالسيوم الدم‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما هو مستوى الفوسفات الأقل من المعدل الطبيعي في دمك؟‎‎:‎‎نقص فوسفات الدم‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ما يسمى مستوى الفوسفات فوق الطبيعي في دمك؟‎‎:‎‎فرط فوسفات الدم‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎اصفرار الجلد وبياض عينيك‎‎:‎‎التهاب الكبد‎‎:‎‎3,4,5‎‎:‎‎‎", "‎‎‎‎‎‎‎‎طفح جلدي أو حكة حول المستقيم‎‎:‎‎الطفيليات المعوية‎‎:‎‎2,7,8‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ألم بطني متوسط ​​إلى شديد قد ينتشر إلى ظهرك‎‎:‎‎التهاب البنكرياس‎‎:‎‎1,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎آلام شديدة في المعدة‎‎:‎‎قرحة المعدة‎‎:‎‎6,7,8‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ألم مفاجئ يبدأ في الجانب الأيمن من أسفل البطن‎‎:‎‎التهاب الزائدة الدودية‎‎:‎‎0,3,7‎‎:‎‎‎", "‎‎‎‎‎‎‎‎الغثيان أو اضطراب المعدة المتكرر‎‎:‎‎التهاب المعدة‎‎:‎‎4,2,1‎‎:‎‎‎", "‎‎‎‎‎‎‎‎حكة شديدة حول فتحة الشرج‎‎:‎‎بواسير‎‎:‎‎0,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ألم أو حرقان أثناء التبول‎‎:‎‎حصى الكلى‎‎:‎‎3,9,1‎‎:‎‎‎", "‎‎‎‎‎‎‎‎اصفرار الجلد وبياض عينيك‎‎:‎‎التليف الكبدي‎‎:‎‎7,5,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎دم في البراز‎‎:‎‎مرض كرون‎‎:‎‎2,7,8‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎الم المفاصل‎‎:‎‎التهاب المفاصل‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ألم فوري وشديد‎‎:‎‎كسر العظام‎‎:‎‎2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎فقدان الطول بمرور الوقت‎‎:‎‎هشاشة العظام‎‎:‎‎1,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎العمود الفقري منحني بشكل واضح‎‎:‎‎الجنف‎‎:‎‎0,1,2‎‎:‎‎‎", "‎‎‎‎‎‎‎‎جلد أحمر ولامع فوق المفصل المصاب‎‎:‎‎النقرس‎‎:‎‎1,2,3‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎عضلات ربلة الساق الكبيرة‎‎:‎‎ضمور العضلات‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ذراع أو ساق واحدة أصغر من الأخرى‎‎:‎‎ضمور عضلي‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ألم في الوتر يزداد سوءًا عند الحركة‎‎:‎‎التهاب الأوتار‎‎:‎‎1,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ألم حاد ومفاجئ‎‎:‎‎تقلصات عضلية‎‎:‎‎1,2‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ألم مفاجئ يتفاقم أثناء تقلص العضلة‎‎:‎‎تمزق العضلات‎‎:‎‎1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎تورم غير مؤلم في الغدد الليمفاوية في رقبتك أو الإبط أو الفخذ‎‎:‎‎سرطان الغدد الليمفاوية‎‎:‎‎2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎تضخم الغدد الليمفاوية وتضخم الكبد أو الطحال‎‎:‎‎سرطان الدم‎‎:‎‎2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎يرتجف‎‎:‎‎انخفاض حرارة الجسم‎‎:‎‎0,1‎‎:‎‎‎", "‎‎‎‎‎‎‎‎خدر أو ضعف في ذراعيك أو ساقيك‎‎:‎‎تصلب الشرايين‎‎:‎‎0,1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎حمى شديدة مفاجئة ، صداع شديد يبدو مختلفًا عن الطبيعي‎‎:‎‎التهاب السحايا‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎العمى في عين واحدة‎‎:‎‎تصلب متعدد‎‎:‎‎0,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎رعاش في اليدين‎‎:‎‎مرض الشلل الرعاش‎‎:‎‎0,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎التشنجات اللاإرادية‎‎:‎‎متلازمة توريت‎‎:‎‎0,1,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎صعوبة في التركيز وهفوات في الذاكرة‎‎:‎‎مرض هنتنغتون‎‎:‎‎0,1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎لثة حمراء أو منتفخة‎‎:‎‎التهاب دواعم السن‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎لثة حمراء أو منتفخة‎‎:‎‎التهاب اللثة‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎وجع أسنان‎‎:‎‎تسوس الأسنان‎‎:‎‎0,4,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎مشاكل في البلع‎‎:‎‎التهاب اللوزتين‎‎:‎‎0,2,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎تشوهات الفك العلوي‎‎:‎‎مشقوق الشفة‎‎:‎‎0,2,3‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎السائل الذي يستنزف من الأذن‎‎:‎‎التهاب الأذن‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎فقدان السمع‎‎:‎‎الصمم‎‎:‎‎0,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ضجيج رنين في الأذنين‎‎:‎‎طنين الأذن‎‎:‎‎0,1,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎دوار‎‎:‎‎مرض منيير‎‎:‎‎0,1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎رؤية غائمة‎‎:‎‎إعتمام عدسة العين‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎لون وردي أو أحمر في بياض العين‎‎:‎‎التهاب الملتحمة‎‎:‎‎0,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ألم شديد في العين‎‎:‎‎الزرق‎‎:‎‎0,1,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ضعف إدراك العمق والرؤية المحيطية‎‎:‎‎الغمش‎‎:‎‎0,1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎كتلة جديدة في الثدي أو الإبط‎‎:‎‎سرطان الثدي‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎دم في البول‎‎:‎‎سرطان البروستات‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎تغيير في عادات الأمعاء‎‎:‎‎سرطان قولوني مستقيمي‎‎:‎‎1,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎سعال لا يزول بعد أسبوعين أو ثلاثة أسابيع‎‎:‎‎سرطان الرئة‎‎:‎‎1,2,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎شامة تتغير في اللون أو الحجم أو تنزف‎‎:‎‎سرطان الجلد‎‎:‎‎0,1,3‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎لون مزرق في الجلد والأظافر والشفتين‎‎:‎‎نقص الأكسجة في الدم‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ارتعاش في يديك ووجهك وقدميك‎‎:‎‎نقص كالسيوم الدم‎‎:‎‎0,2,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎كثرة التبول والعطش‎‎:‎‎فرط كالسيوم الدم‎‎:‎‎0,1‎‎:‎‎‎", "‎‎‎‎‎‎‎‎ضعف العظام‎‎:‎‎نقص فوسفات الدم‎‎:‎‎0,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎تقلصات العضلات أو التشنجات‎‎:‎‎فرط فوسفات الدم‎‎:‎‎0,1‎‎:‎‎‎"]);
  }

  void addBG(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.bg;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Черен дроб:1,2,3:29.2,45", "устата:4,2,9:28.1,81.6", "Хранопровод:1,8,5:48.6,58.6", "Дебело черво:4,2,6:20.5,21", "Тънко черво:8,7,1:52.4,19", "стомах:4,6,7:66,41", "Фаринкса:5,2,9:48.6,81", "Жлъчен мехур:6,9,4:31.3,39.6", "Панкреас:2,1,0:50,35.1", "Апендикс:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Череп:11,8,6:48,97", "Лопатка:5,4,3:61.1,80.2", "Гръден кош:11,7,0:56,74.1", "Гръбначен стълб:8,10,1:45.9,65.2", "Тибията:5,9,3:51.4,23.6", "Бедрената кост:4,10,7:54.9,35.5", "Раменна кост:2,7,9:69.1,66.2", "Метакарпални кости:6,0,1:81.3,44.8", "Карпални кости:5,4,2:77.1,48.7", "Тарсус:4,3,1:49.3,6.9", "Метатарзални кости:0,3,5:54.2,2.8", "таза:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Делтовидна:4,1,5:65.3,80.2", "Бицепс:5,0,4:67.3,71.5", "Пекторален:5,0,4:52.5,76.4", "трапец:1,5,4:51.4,85.5", "Коремна външна наклонена:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Сърцето:4,2,5:65.3,73", "аорта:4,2,5:62.9,77.6", "Бъбречни вени:0,4,5:57.3,59.1", "Бъбречна артерия:0,5,4:61.5,59.1", "Югуларни вени:0,2,5:60.4,86.1", "Бедрената вена:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Мозък:5,4,3:50.4,96.8", "Малък мозък:5,4,3:56,92.6", "Гръбначен мозък:0,4,3:50.7,86.8", "Седалищния нерв:0,4,5:59.4,37.6", "Тибиален нерв:1,5,3:61.1,19.4", "Ганглий:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["устни:1,2,4:61.4,96.6", "Увула:6,2,0:48.6,51.8", "Моларите:0,6,1:76.1,33", "Резец:0,4,1:50.4,83", "език:7,2,0:48.2,27.6", "сливица:4,0,6:69.5,46.8", "Твърдо небце:1,2,0:48.6,73.8", "Меко небце:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Челен лоб:1,2,4:25,58.5", "Темпорален лоб:0,2,3:51.2,42.2", "Париетален лоб:0,1,3:66,69", "Тилен лоб:0,1,2:91,46", "Малък мозък:1,2,0:72.8,26.1", "Мозъчен ствол:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Ушната мида:1,2,4:8,31", "Ушния канал:0,2,6:33.5,42.1", "тъпанчето:1,5,6:55.6,42", "Костици:1,0,6:54.3,52.9", "Кохлея:6,1,5:75.8,45.7", "Слухов нерв:6,2,1:91.8,48", "евстахиева тръба:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["аорта:8,6,3:51.7,84.7", "Горна празна вена:6,7,4:27.3,92", "Долна празна вена:1,4,3:27.8,6.8", "Дясно предсърдие:4,7,0:31,54.4", "Ляво предсърдие:7,6,0:59.6,55.5", "Митрална клапа:8,2,0:69.5,43.7", "Дясната камера:0,1,3:47.8,38.9", "Лява камера:1,8,3:58.1,43", "Трикуспидална клапа:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Ирис:6,3,4:11.3,57", "Роговица:2,6,4:1.7,50.5", "Лещи:1,4,6:19,51.3", "ретина:1,6,4:64.6,76.8", "Оптичен нерв:0,6,3:87.9,36.2", "Предна камера:6,4,3:7.2,51.4", "Камера на стъкловидното тяло:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Ядро:5,3,2:57.3,75.5", "Нуклеол:2,6,4:44.5,67.9,8", "Цитоплазма:1,4,6:93.08,50.09,9", "Клетъчната мембрана:2,5,1:90,24,14", "Рибозома:2,1,3:80.929,75.844,14", "митохондрия:1,2,3:51.4,90.35,18", "Ендоплазмения ретикулум:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Кислород:1,2,4:74.5,29,25", "въглерод:2,0,4:74.5,57,25", "водород:1,0,5:74.5,73.2,25", "Азот:1,0,2:74.5,83.5,25", "калций:0,1,2:74.5,91.2,25", "Фосфор:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Кой орган произвежда жлъчка, необходима за храносмилането?:0,7,6,8", "Коя е първата част от храносмилателния канал, която получава храна и произвежда слюнка?:1,2,6,5", "През кой орган храната преминава от фаринкса към стомаха?:2,6,9,7", "Кой орган е последната част на храносмилателната система?:3,4,7,8", "Къде се усвояват най-много хранителни вещества и минерали от храната?:4,5,3,0", "Кой орган отделя храносмилателни ензими и стомашна киселина, за да подпомогне храносмилането на храната?:5,4,7,3", "Как се нарича частта от гърлото зад устата и носната кухина?:6,2,9,8", "Къде се съхранява и концентрира жлъчката, преди да бъде освободена в тънките черва?:7,6,9,8", "Откъде се секретира инсулин?:8,0,7,6", "Какъв орган се намира в долната дясна част на корема?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Какво представлява костната структура, която образува главата?:0,1,9,7", "Какво е известно още като раменна кост?:1,9,11,6", "Какво представлява полутвърдата костна и хрущялна структура, която заобикаля гръдната кухина?:2,7,8,11", "Каква е определящата характеристика на гръбначните животни?:3,0,11,2", "Коя е по-голямата от двете кости на крака под коляното?:4,6,9,5", "Коя е най-дългата и силна кост в тялото ви?:5,6,9,1", "Какво е дълга кост на ръката, която минава от рамото до лакътя?:6,5,1,7", "Какво представлява група от пет кости на ръката между фалангите и китката?:7,5,1,3", "Какви кости изграждат китката?:8,7,9,10", "Какво представлява група от седем артикулиращи кости във всеки крак?:9,7,8,1", "Какво представлява група от пет дълги кости в стъпалото?:10,8,7,4", "Каква е долната част на торса?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Какъв е мускулът, образуващ заобления контур на човешкото рамо?:0,1,3,5", "Какъв е голям мускул, който лежи в предната част на горната част на ръката между рамото и лакътя?:1,0,2,3", "Какъв мускул е разположен в гръдния кош на човешкото тяло?:2,3,5,1", "Какво представлява триъгълният мускул, разположен в задната част на шията?:3,1,2,5", "Кой мускул е най-големият от страничните коремни мускули?:4,1,2,0", "Кой е най-големият от 4 мускула в предната част на крака?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Какво е мускулен орган, който изпомпва кръв през кръвоносните съдове на кръвоносната система?:0,1,3,5", "Коя е основната и най-голямата артерия в човешкото тяло?:1,4,3,2", "Какви са вените, които дренират бъбреците?:2,5,4,1", "Кои са сдвоените артерии, които снабдяват бъбреците с кръв?:3,2,1,5", "Кои са вените, които отвеждат деоксигенирана кръв от главата обратно към сърцето?:4,2,5,1", "Какво представлява голяма вена, разположена дълбоко в бедрото?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Какво е орган, който служи като център на нервната система?:0,1,2,5", "Каква е основната характеристика на задния мозък на всички гръбначни животни?:1,5,0,2", "Какво е дълга, тънка, тръбна структура, съставена от нервна тъкан?:2,1,3,4", "Какво представлява голям нерв, който минава покрай тазобедрената става?:3,2,1,5", "Какво е клон на седалищния нерв?:4,5,2,1", "Какво представлява групата от невронни клетъчни тела в периферната нервна система?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Какво представляват мускулните гънки, които обграждат устата?:0,1,4,7", "Какво е месесто разширение, което виси над гърлото?:1,4,0,7", "Какво представляват плоските зъби в задната част на устата?:2,3,5,6", "Какви са предните зъби?:3,2,5,6", "Какво е мускулен орган в устата?:4,5,6,1", "Кои органи играят важна роля в имунната система?:5,1,4,0", "Какво е тънка хоризонтална костна плоча, съставена от две кости на лицевия скелет?:6,7,2,5", "Каква е меката тъкан, която представлява задната част на покрива на устата?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Кой е най-големият от четирите основни лоба на мозъка?:0,3,1,4", "Какво седи зад ушите и е вторият по големина лоб?:1,0,3,2", "Какво участва във възприемането на усещанията, включително докосване, температура, болка?:2,0,3,5", "Какъв е визуалният център за обработка на мозъка?:3,0,1,4", "Какво играе важна роля в контрола на баланса?:4,5,0,1", "Какво помага да се контролира сърдечната честота и дишането?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Коя е видимата част на ухото, която е извън главата?:0,3,6,2", "Какво представлява пътят, минаващ от външното ухо до средното ухо?:1,2,3,0", "Какво е тънък клап на кожата, който е опънат като барабан и вибрира, когато звукът го удари?:2,0,5,3", "Кои са трите кости в средното ухо, които са сред най-малките кости в човешкото тяло?:3,0,6,2", "Какво прилича на черупката на охлюв?:4,2,0,6", "Какво носи слухова сензорна информация от кохлеята на вътрешното ухо директно към мозъка?:5,2,0,6", "Какво е известно още като слухова тръба?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Коя е основната и най-голямата артерия в човешкото тяло?:0,3,8,6", "Коя вена носи кръв от главата, шията, ръцете и гърдите обратно към сърцето?:1,3,0,2", "Коя вена носи кръв от долната част на тялото обратно към сърцето?:2,1,0,3", "Каква е горната камера, през която кръвта навлиза в вентрикулите на сърцето?:3,5,6,2", "коя сърдечна камера получава кислородна кръв от белите дробове?:4,3,6,8", "Каква клапа разделя двете камери на лявата страна на сърцето?:5,8,7,3", "Какво представлява мускулната камера, която изпомпва кръвта от сърцето и в кръвоносната система?:6,5,8,2", "Коя е една от четирите камери на сърцето?:7,0,1,2", "Неговата роля е да предотврати обратния поток на кръв от дясната камера в дясното предсърдие.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Какво представлява тънката структура в окото, отговорна за контрола на диаметъра и размера на зеницата?:0,1,3,2", "Каква е прозрачната предна част на окото, която покрива ириса?:1,2,3,0", "Какво представлява прозрачната структура в окото, която помага да пречупи светлината, за да бъде фокусирана върху ретината?:2,3,0,1", "Кой е най-вътрешният, светлочувствителен слой тъкан на окото?:3,1,0,2", "Какво предава визуална информация от ретината към мозъка?:4,6,5,3", "Каква е предната част на окото между роговицата и ириса?:5,6,2,3", "Каква очна камера се намира зад лещата и пред зрителния нерв?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Какво се намира в средата на клетката и съдържа ДНК, подредена в хромозоми?:0,1,2,3", "Кой регион в клетката се занимава с производството на клетъчни рибозоми?:1,2,3,4", "Какво е желатинова течност, която изпълва вътрешността на клетката?:2,3,4,5", "Какво предпазва клетката от външната среда?:3,4,2,1", "Каква е клетъчната структура, която произвежда протеин?:4,3,2,1", "Какво превръща химическата енергия в енергийна форма, която клетката може да използва?:5,4,3,2", "Каква е транспортната система на еукариотната клетка?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Какво се използва за окисляване на храната ни в процеса на клетъчното дишане, като по този начин се освобождава енергия?:0,1,2,3", "Кой е вторият най-разпространен елемент в човешкото тяло?:1,2,3,4", "Какво се използва за поддържане на хидратация на човешкото тяло?:2,3,4,5", "Какво се използва за производството на аминокиселини в нашето тяло, които от своя страна произвеждат протеини?:3,5,4", "Какво се използва за изграждане и поддържане на здрави кости?:4,0,1,2", "Какво се използва при формирането на кости и зъби?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Какво е заболяване, при което черният ви дроб се възпалява?:Хепатит::", "Какво е заболяване, при което паразитът заразява стомашно-чревния тракт на човека?:Чревни паразити::", "Какво е заболяване, при което панкреасът ви се възпалява?:Панкреатит::", "Какво е заболяване, което причинява счупване на вътрешната лигавица на стомаха?:Язва на стомаха::", "Какво е заболяване, при което се възпалява апендикса?:апендицит::", "Какво е заболяване, при което вътрешната лигавица на стомаха ви се възпалява?:гастрит::", "Какво заболяване причинява подути вени в долната част на ректума?:хемороиди::", "Какви са твърдите отлагания от минерали и соли?:Камъни в бъбреците::", "Какви са белези на черния дроб, причинени от дългосрочно увреждане на черния дроб?:цироза::", "Какъв вид възпалително заболяване на червата?:болест на Крон::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Какво заболяване причинява болка и възпаление в ставата?:Артрит::", "Какво представлява прекъсването на непрекъснатостта на костта?:Фрактура на костите::", "Кое заболяване отслабва костите, което ги прави крехки и по-вероятно да се счупят?:Остеопороза::", "Какво заболяване причинява странично изкривяване на гръбначния стълб?:сколиоза::", "Какъв вид артрит причинява внезапна, силна болка в ставите?:подагра::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Кое заболяване причинява прогресираща слабост и загуба на мускулна маса?:мускулна дистрофия::", "Какво заболяване е причинено от липса на физическа активност?:мускулна атрофия::", "Какво заболяване причинява възпаление или дразнене на сухожилие?:тендинит::", "Какво е внезапно и неволно свиване на един от мускулите ви?:мускулни крампи::", "Какво се случва, когато мускулът ви е пренапрегнат или разкъсан?:разкъсване на мускула::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Какъв вид рак, който започва в клетки, които са част от имунната система на тялото?:Лимфом::", "Какъв вид рак обикновено започва в костния мозък?:левкемия::", "Какво се причинява от продължително излагане на много ниски температури?:Хипотермия::", "Какво представлява втвърдяването на вашите артерии, причинено от постепенното натрупване на плака?:Атеросклероза::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Какво представлява острото възпаление на защитните мембрани, покриващи главния и гръбначния мозък?:Менингит::", "Какво е заболяване, което може да засегне мозъка и гръбначния ви мозък и може да причини проблеми със зрението, баланса, мускулния контрол?:Множествена склероза::", "Какво е мозъчно разстройство, което води до треперене, скованост и затруднения при ходене, баланс и координация?:болестта на Паркинсон::", "Какво се характеризира с множество тикове при движение и поне един гласов тик?:Синдром на Турет::", "Какво е нелечимо, наследствено мозъчно заболяване, което уврежда мозъчните клетки?:Болест на Хънтингтън::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Коя е сериозна инфекция на венците, която уврежда меките тъкани и която може да унищожи костта, която поддържа зъбите ви?:Пародонтит::", "Коя е лека форма на заболяване на венците, което причинява дразнене, зачервяване и подуване на венците?:гингивит::", "Кои са трайно увредените зони в твърдата повърхност на зъбите ви?:Кариес::", "Какво представлява инфекцията на сливиците в задната част на гърлото?:тонзилит::", "Какво се случва, ако тъканта, която изгражда устната, не се съедини напълно преди раждането?:Разцепена устна::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Кое мозъчно разстройство унищожава паметта и уменията за мислене и в крайна сметка способността да се изпълняват най-простите задачи?:болестта на Алцхаймер::", "Какво е необичайно, но сериозно състояние, при което мозъкът се възпалява?:Енцефалит::", "Какво е главоболие, характеризиращо се с повтарящи се главоболия, които са умерени до тежки?:мигрена::", "Какво е заболяване, което засяга мозъка и причинява чести припадъци?:епилепсия::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Какво се случва, когато вирус или бактерия предизвика възпаление на областта зад тъпанчето?:отит::", "Какво се отнася до пълната или частична невъзможност за чуване на звуци?:глухота::", "Какво е състояние, при което чувате звуци, когато няма външен източник на звуците?:Шум в ушите::", "Какво е нарушение на вътрешното ухо, което може да доведе до замайване (световъртеж) и загуба на слуха?:Болест на Мениер::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Какво представлява болката в гърдите, причинена от намален приток на кръв към сърдечните мускули?:Ангина пекторис::", "Какво е кръвното налягане, което е по-високо от нормалното?:Хипертония::", "Какво се случва, когато кръвният поток намалее или спре към коронарната артерия на сърцето?:Инфаркт на миокарда::", "Какво е сериозно състояние, при което сърцето не изпомпва кръв толкова ефективно, колкото би трябвало?:Застойна сърдечна недостатъчност::", "Каква е думата за високи нива на холестерол в кръвта?:Хиперхолестеролемия::", "Какво представлява аномалията на сърдечния ритъм?:аритмия::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Какво представлява мътна зона в лещата на окото, която води до намаляване на зрението?:катаракта::", "Какво е заболяване на очите, причинено от инфекция или алергия?:Конюнктивит::", "Какво е очно състояние, при което зрителният нерв, който свързва окото с мозъка, се уврежда?:глаукома::", "Какво е нарушение на зрението, при което мозъкът не успява да обработи напълно входовете от едното око и с течение на времето предпочита другото око?:амблиопия::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Какъв вид рак може да включва бучка в гърдата или промяна във формата на гърдата?:Рак на гърдата::", "Кой е най-често срещаният вид рак, който засяга само мъжете?:Рак на простатата::", "Какъв е вид рак, при който клетките в дебелото черво или ректума растат извън контрол?:Колоректален рак::", "Какъв вид рак се причинява от продължително пушене на тютюн?:Рак на белия дроб::", "Какъв вид рак се причинява от прекомерно излагане на ултравиолетови лъчи от слънцето?:Рак на кожата::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Как се нарича под нормалното ниво на кислород в кръвта ви, по-специално в артериите?:Хипоксемия::", "Как се нарича нивото на калций в кръвта под нормалното?:Хипокалцемия::", "Как се нарича наднормално ниво на калций в кръвта ви?:Хиперкалциемия::", "Как се нарича под нормалното ниво на фосфат в кръвта ви?:хипофосфатемия::", "Как се нарича наднормално ниво на фосфат в кръвта ви?:Хиперфосфатемия::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Пожълтяване на кожата и бялото на очите ви:Хепатит:3,4,5:", "Обрив или сърбеж около ректума:Чревни паразити:2,7,8:", "Умерена до силна коремна болка, която може да се разпространи в гърба:Панкреатит:1,3,4:", "Силна болка в стомаха:Язва на стомаха:6,7,8:", "Внезапна болка, която започва от дясната страна на долната част на корема:апендицит:0,3,7:", "Гадене или повтарящо се стомашно разстройство:гастрит:4,2,1:", "Силен сърбеж около ануса:хемороиди:0,2,3:", "Болка или усещане за парене по време на уриниране:Камъни в бъбреците:3,9,1:", "Пожълтяване на кожата и бялото на очите ви:цироза:7,5,4:", "Кръв в изпражненията:болест на Крон:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["болки в ставите:Артрит:1,2,3:", "незабавна, силна болка:Фрактура на костите:2,3:", "Загуба на височина с течение на времето:Остеопороза:1,3,4:", "видимо извит гръбнак:сколиоза:0,1,2:", "червена, лъскава кожа над засегнатата става:подагра:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Големи мускули на прасеца:мускулна дистрофия:2,3,4:", "Едната ръка или единият крак е по-малък от другия:мускулна атрофия:2,3,4:", "болка в сухожилие, която се влошава, когато се движите:тендинит:1,3,4:", "Внезапна, остра болка:мускулни крампи:1,2:", "внезапна болка, която се влошава при свиване на мускула:разкъсване на мускула:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Безболезнено подуване на лимфните възли във врата, подмишниците или слабините:Лимфом:2,3:", "Подути лимфни възли, увеличен черен дроб или далак:левкемия:2,3:", "Треперене:Хипотермия:0,1:", "Изтръпване или слабост в ръцете или краката:Атеросклероза:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Внезапна висока температура, силно главоболие, което изглежда различно от нормалното:Менингит:1,2,3:", "слепота на едното око:Множествена склероза:0,3,4:", "Тремор в ръцете:болестта на Паркинсон:0,3,4:", "тикове при движение:Синдром на Турет:0,1,4:", "затруднена концентрация и пропуски в паметта:Болест на Хънтингтън:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Зачервени или подути венци:Пародонтит:2,3,4:", "Зачервени или подути венци:гингивит:2,3,4:", "зъбобол:Кариес:0,4,3:", "проблеми с преглъщането:тонзилит:0,2,4:", "Деформации на горната челюст:Разцепена устна:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["течност, която се оттича от ухото:отит:1,2,3:", "Загуба на слуха:глухота:0,2,3:", "звънене в ушите:Шум в ушите:0,1,3:", "световъртеж:Болест на Мениер:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Замъглено зрение:катаракта:1,2,3:", "Розов или червен цвят в бялото на окото:Конюнктивит:0,2,3:", "силна болка в очите:глаукома:0,1,3:", "Лошо възприемане на дълбочината и периферно зрение:амблиопия:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Нова бучка в гърдата или под мишницата:Рак на гърдата:1,2,3:", "Кръв в урината:Рак на простатата:2,3,4:", "Промяна в навиците на червата:Колоректален рак:1,3,4:", "кашлица, която не изчезва след 2 или 3 седмици:Рак на белия дроб:1,2,4:", "Бенка, която променя цвета си, размера или кърви:Рак на кожата:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Синкав цвят на кожата, ноктите и устните:Хипоксемия:1,2,3:", "Потрепване в ръцете, лицето и краката:Хипокалцемия:0,2,4:", "По-често уриниране и жажда:Хиперкалциемия:0,1:", "отслабване на костите:хипофосфатемия:0,4:", "мускулни крампи или спазми:Хиперфосфатемия:0,1:"]);
  }

  void addCS(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.cs;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Játra:1,2,3:29.2,45", "Ústa:4,2,9:28.1,81.6", "Jícen:1,8,5:48.6,58.6", "tlusté střevo:4,2,6:20.5,21", "Tenké střevo:8,7,1:52.4,19", "Žaludek:4,6,7:66,41", "Hltan:5,2,9:48.6,81", "Žlučník:6,9,4:31.3,39.6", "Slinivka:2,1,0:50,35.1", "Apendix:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Lebka:11,8,6:48,97", "Lopatka:5,4,3:61.1,80.2", "Žebra:11,7,0:56,74.1", "Páteř:8,10,1:45.9,65.2", "Holenní kost:5,9,3:51.4,23.6", "Stehenní kost:4,10,7:54.9,35.5", "Pažní kost:2,7,9:69.1,66.2", "Záprstí:6,0,1:81.3,44.8", "Karpální kosti:5,4,2:77.1,48.7", "Zánártí:4,3,1:49.3,6.9", "Nárt:0,3,5:54.2,2.8", "Pánev:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltový sval:4,1,5:65.3,80.2", "Biceps:5,0,4:67.3,71.5", "Prsní sval:5,0,4:52.5,76.4", "Sval trapézový:1,5,4:51.4,85.5", "Břišní vnější šikmý sval:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Srdce:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Renální žíly:0,4,5:57.3,59.1", "Renální tepna:0,5,4:61.5,59.1", "Hrdelní žíla:0,2,5:60.4,86.1", "Femorální žíla:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Mozek:5,4,3:50.4,96.8", "Mozeček:5,4,3:56,92.6", "Mícha:0,4,3:50.7,86.8", "sedací nerv:0,4,5:59.4,37.6", "Tibiální nerv:1,5,3:61.1,19.4", "Ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Rty:1,2,4:61.4,96.6", "Uvula:6,2,0:48.6,51.8", "Moláry:0,6,1:76.1,33", "Řezák:0,4,1:50.4,83", "Jazyk:7,2,0:48.2,27.6", "Mandle:4,0,6:69.5,46.8", "Tvrdý patro:1,2,0:48.6,73.8", "Měkký patro:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Čelní lalok:1,2,4:25,58.5", "Časový lalok:0,2,3:51.2,42.2", "Parietální lalok:0,1,3:66,69", "týlní lalok:0,1,2:91,46", "Mozeček:1,2,0:72.8,26.1", "Mozkový kmen:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Ušní boltec:1,2,4:8,31", "Ušní kanál:0,2,6:33.5,42.1", "Ušní buben:1,5,6:55.6,42", "Sluchové kůstky:1,0,6:54.3,52.9", "Hlemýžď:6,1,5:75.8,45.7", "Sluchový nerv:6,2,1:91.8,48", "Eustachova trubice:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "horní dutá žíla:6,7,4:27.3,92", "dolní dutá žíla:1,4,3:27.8,6.8", "Pravá síň:4,7,0:31,54.4", "Levé síň:7,6,0:59.6,55.5", "Mitrální ventil:8,2,0:69.5,43.7", "Pravá komora:0,1,3:47.8,38.9", "Levá komora:1,8,3:58.1,43", "Trikuspidální ventil:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Duhovka:6,3,4:11.3,57", "rohovka:2,6,4:1.7,50.5", "čočka:1,4,6:19,51.3", "Sítnice:1,6,4:64.6,76.8", "Oční nerv:0,6,3:87.9,36.2", "Přední komora:6,4,3:7.2,51.4", "Sklivec:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Buněčné jádro:5,3,2:57.3,75.5", "Jadérko:2,6,4:44.5,67.9,8", "Cytoplazma:1,4,6:93.08,50.09,9", "Buněčná membrána:2,5,1:90,24,14", "Ribozom:2,1,3:80.929,75.844,14", "Mitochondrie:1,2,3:51.4,90.35,18", "Endoplazmatické retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Kyslík:1,2,4:74.5,29,25", "Uhlík:2,0,4:74.5,57,25", "Vodík:1,0,5:74.5,73.2,25", "Dusík:1,0,2:74.5,83.5,25", "Vápník:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Jaký orgán produkuje žluč nezbytnou pro trávení?:0,7,6,8", "Jaká je první část trávicího traktu, která přijímá potravu a produkuje sliny?:1,2,6,5", "Jakým orgánem prochází potrava z hltanu do žaludku?:2,6,9,7", "Jaký orgán je poslední částí trávicího systému?:3,4,7,8", "Kde se nejvíce vstřebává živiny a minerály z potravy?:4,5,3,0", "Jaký orgán vylučuje trávicí enzymy a žaludeční kyselinu, aby napomáhal trávení potravy?:5,4,7,3", "Jak se nazývá část hrdla za dutinou ústní a nosní?:6,2,9,8", "Kde se žluč skladuje a koncentruje, než se uvolní do tenkého střeva?:7,6,9,8", "Odkud se inzulín vylučuje?:8,0,7,6", "Jaký orgán se nachází v pravé dolní části břicha?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Co je to kostní struktura, která tvoří hlavu?:0,1,9,7", "Co je také známé jako ramenní kost?:1,9,11,6", "Co je to polotuhá kostěná a chrupavčitá struktura, která obklopuje hrudní dutinu?:2,7,8,11", "Jaká je definující charakteristika obratlovce?:3,0,11,2", "Jaká je větší ze dvou kostí na noze pod kolenem?:4,6,9,5", "Jaká je nejdelší a nejsilnější kost ve vašem těle?:5,6,9,1", "Co je to dlouhá kost v paži, která se táhne od ramene k lokti?:6,5,1,7", "Jaká je skupina pěti kostí ruky mezi falangami a zápěstím?:7,5,1,3", "Jaké kosti tvoří zápěstí?:8,7,9,10", "Co je shluk sedmi kloubových kostí na každém chodidle?:9,7,8,1", "Co je to skupina pěti dlouhých kostí na chodidle?:10,8,7,4", "Jaká je spodní část trupu?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Jaký je sval tvořící zaoblený obrys lidského ramene?:0,1,3,5", "Co je to velký sval, který leží na přední straně nadloktí mezi ramenem a loktem?:1,0,2,3", "Jaký sval se nachází na hrudi lidského těla?:2,3,5,1", "Co je trojúhelníkový sval umístěný na zadní straně krku?:3,1,2,5", "Jaký sval je největší z bočních břišních svalů?:4,1,2,0", "Jaký je největší ze 4 svalů v přední části nohy?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Co je to svalový orgán, který pumpuje krev krevními cévami oběhového systému?:0,1,3,5", "Jaká je hlavní a největší tepna v lidském těle?:1,4,3,2", "Co jsou žíly, které odvádějí ledviny?:2,5,4,1", "Co jsou to párové tepny, které zásobují ledviny krví?:3,2,1,5", "Co jsou to žíly, které odvádějí odkysličenou krev z hlavy zpět do srdce?:4,2,5,1", "Co je to velká žíla umístěná hluboko ve stehně?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Co je orgán, který slouží jako centrum nervového systému?:0,1,2,5", "Jaký je hlavní rys zadního mozku všech obratlovců?:1,5,0,2", "Co je to dlouhá, tenká, tubulární struktura tvořená nervovou tkání?:2,1,3,4", "Co je velký nerv, který probíhá podél kyčelního kloubu?:3,2,1,5", "Co je to větev sedacího nervu?:4,5,2,1", "Co je to skupina těl neuronů v periferním nervovém systému?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Co jsou to svalové záhyby, které obepínají ústa?:0,1,4,7", "Co je to masitý nástavec, který visí nad hrdlem?:1,4,0,7", "Co jsou ploché zuby v zadní části úst?:2,3,5,6", "Jaké jsou přední zuby?:3,2,5,6", "Co je to svalový orgán v ústech?:4,5,6,1", "Které orgány hrají důležitou roli v imunitním systému?:5,1,4,0", "Co je tenká horizontální kostěná deska tvořená dvěma kostmi obličejového skeletu?:6,7,2,5", "Co je měkká tkáň tvořící zadní část střechy úst?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Jaký je největší ze čtyř hlavních laloků mozku?:0,3,1,4", "Co sedí za ušima a je druhý největší lalok?:1,0,3,2", "Co se podílí na vnímání pocitů, včetně dotyku, teploty, bolesti?:2,0,3,5", "Co je centrum vizuálního zpracování mozku?:3,0,1,4", "Co hraje důležitou roli při kontrole rovnováhy?:4,5,0,1", "Co pomáhá kontrolovat srdeční frekvenci a frekvenci dýchání?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Jaká je viditelná část ucha, která je mimo hlavu?:0,3,6,2", "Jaká je cesta vedoucí od vnějšího ucha ke střednímu uchu?:1,2,3,0", "Co je to tenká chlopeň kůže, která je napnutá jako buben a vibruje, když do ní zasáhne zvuk?:2,0,5,3", "Jaké tři kosti ve středním uchu patří mezi nejmenší kosti v lidském těle?:3,0,6,2", "Co se podobá ulitě šneka?:4,2,0,6", "Co přenáší sluchové senzorické informace z hlemýždě vnitřního ucha přímo do mozku?:5,2,0,6", "Co je také známé jako sluchová trubice?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Jaká je hlavní a největší tepna v lidském těle?:0,3,8,6", "Která žíla vede krev z vaší hlavy, krku, paží a hrudníku zpět do vašeho srdce?:1,3,0,2", "Která žíla vede krev z dolní části těla zpět do srdce?:2,1,0,3", "Jaká je horní komora, kterou krev vstupuje do srdečních komor?:3,5,6,2", "která srdeční komora přijímá okysličenou krev z plic?:4,3,6,8", "Jaká chlopeň odděluje dvě komory na levé straně srdce?:5,8,7,3", "Co je svalová komora, která pumpuje krev ze srdce do oběhového systému?:6,5,8,2", "Která je jedna ze čtyř komor srdce?:7,0,1,2", "Jeho úlohou je zabránit zpětnému toku krve z pravé komory do pravé síně.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Co je tenká struktura v oku, zodpovědná za kontrolu průměru a velikosti zornice?:0,1,3,2", "Jaká je průhledná přední část oka, která zakrývá duhovku?:1,2,3,0", "Co je to průhledná struktura v oku, která pomáhá lámat světlo, aby bylo zaostřeno na sítnici?:2,3,0,1", "Jaká je nejvnitřnější, na světlo citlivá vrstva tkáně oka?:3,1,0,2", "Co přenáší vizuální informace ze sítnice do mozku?:4,6,5,3", "Jaká je přední část oka mezi rohovkou a duhovkou?:5,6,2,3", "Jaká oční komora se nachází za čočkou a před zrakovým nervem?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Co se nachází uprostřed buňky a obsahuje DNA uspořádanou do chromozomů?:0,1,2,3", "Která oblast v buňce se zabývá produkcí buněčných ribozomů?:1,2,3,4", "Co je to želatinová kapalina, která vyplňuje vnitřek buňky?:2,3,4,5", "Co chrání buňku před jejím vnějším prostředím?:3,4,2,1", "Jaká je buněčná struktura, která produkuje bílkoviny?:4,3,2,1", "Co přeměňuje chemickou energii na energetickou formu, kterou může buňka využít?:5,4,3,2", "Jaký je transportní systém eukaryotické buňky?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Co se používá k oxidaci našeho jídla v procesu buněčného dýchání, čímž se uvolňuje energie?:0,1,2,3", "Jaký je druhý nejrozšířenější prvek v lidském těle?:1,2,3,4", "Co se používá k udržení hydratace lidského těla?:2,3,4,5", "Co se používá k výrobě aminokyselin v našem těle, které zase tvoří bílkoviny?:3,5,4", "Co se používá pro stavbu a udržení silných kostí?:4,0,1,2", "Co se používá při tvorbě kostí a zubů?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Co je onemocnění, při kterém se vám zanítí játra?:Hepatitida::", "Co je to onemocnění, při kterém parazit infikuje gastrointestinální trakt člověka?:Střevní paraziti::", "Co je to onemocnění, při kterém se vám zanítí slinivka?:Pankreatitida::", "Co je onemocnění, které způsobuje porušení vnitřní výstelky žaludku?:Žaludeční vřed::", "Co je to onemocnění, při kterém se vám zanítí slepé střevo?:Apendicitida::", "Co je to onemocnění, při kterém se zanítí vnitřní výstelka žaludku?:Zánět žaludku::", "Jaké onemocnění způsobuje oteklé žíly v dolní části konečníku?:Hemoroidy::", "Co jsou tvrdá ložiska minerálů a solí?:Ledvinové kameny::", "Co je zjizvení jater způsobené dlouhodobým poškozením jater?:Cirhóza::", "Jaký je typ zánětlivého onemocnění střev?:Crohnova nemoc::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Jaké onemocnění způsobuje bolest a zánět v kloubu?:Artritida::", "Co je to přerušení kontinuity kosti?:Zlomenina kosti::", "Jaká nemoc oslabuje kosti, činí je křehkými a častěji se lámou?:Osteoporóza::", "Jaké onemocnění způsobuje boční zakřivení páteře?:Skolióza::", "Jaký typ artritidy způsobuje náhlou, silnou bolest kloubů?:Dna::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Jaké onemocnění způsobuje progresivní slabost a ztrátu svalové hmoty?:svalová dystrofie::", "Jaké onemocnění je způsobeno nedostatkem fyzické aktivity?:svalová atrofie::", "Jaké onemocnění způsobuje zánět nebo podráždění šlachy?:tendinitida::", "Co je náhlá a mimovolní kontrakce jednoho z vašich svalů?:svalové křeče::", "Co se stane, když je váš sval přetažený nebo natržený?:ruptura svalu::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Jaký typ rakoviny začíná v buňkách, které jsou součástí imunitního systému těla?:Lymfom::", "Jaký typ rakoviny obvykle začíná v kostní dřeni?:Leukémie::", "Co je způsobeno dlouhodobým vystavením velmi nízkým teplotám?:Podchlazení::", "Co je kornatění vašich tepen způsobené postupným hromaděním plaku?:Ateroskleróza::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Co je akutní zánět ochranných membrán pokrývajících mozek a míchu?:Meningitida::", "Co je to nemoc, která může ovlivnit váš mozek a míchu a může způsobit problémy s viděním, rovnováhou a ovládáním svalů?:Roztroušená skleróza::", "Co je to porucha mozku, která vede k třesu, ztuhlosti a potížím s chůzí, rovnováhou a koordinací?:Parkinsonova choroba::", "Co se vyznačuje více pohybovými tiky a alespoň jedním hlasovým tikem?:Tourettův syndrom::", "Co je to nevyléčitelná dědičná porucha mozku, která poškozuje mozkové buňky?:Huntingtonova nemoc::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Co je závažná infekce dásní, která poškozuje měkkou tkáň a která může zničit kost, která podpírá vaše zuby?:Paradentóza::", "Jaká je mírná forma onemocnění dásní, která způsobuje podráždění, zarudnutí a otok vaší dásně?:zánět dásní::", "Jaké jsou trvale poškozené oblasti na tvrdém povrchu vašich zubů?:Zubní kaz::", "Co je to infekce mandlí v zadní části krku?:Zánět mandlí::", "Co se stane, když se tkáň, která tvoří ret, před narozením úplně nespojí?:Rozštěp rtu::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Jaká mozková porucha ničí paměť a myšlení a nakonec i schopnost provádět ty nejjednodušší úkoly?:Alzheimerova choroba::", "Co je neobvyklý, ale vážný stav, při kterém se zanítí mozek?:encefalitida::", "Co je porucha hlavy charakterizovaná opakujícími se bolestmi hlavy, které jsou středně těžké až těžké?:Migréna::", "Co je onemocnění, které postihuje mozek a způsobuje časté záchvaty?:Epilepsie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Co se stane, když virus nebo bakterie způsobí zánět v oblasti za ušním bubínkem?:Otitis::", "Co znamená úplnou nebo částečnou neschopnost slyšet zvuky?:Hluchota::", "Jaký je stav, kdy slyšíte zvuky, když neexistuje žádný vnější zdroj zvuků?:Tinnitus::", "Jaká je porucha vnitřního ucha, která může vést k závratím (vertigo) a ztrátě sluchu?:meniérová nemoc::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Co je bolest na hrudi způsobená sníženým průtokem krve do srdečních svalů?:Angina::", "Co je krevní tlak, který je vyšší než normální?:Hypertenze::", "Co se stane, když se průtok krve do koronární tepny srdce sníží nebo zastaví?:Infarkt myokardu::", "Co je vážný stav, kdy srdce nepumpuje krev tak efektivně, jak by mělo?:Městnavé srdeční selhání::", "Co znamená slovo pro vysokou hladinu cholesterolu v krvi?:Hypercholesterolémie::", "Co je to abnormalita srdečního rytmu?:Arytmie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Co je to zakalená oblast v čočce oka, která vede ke snížení vidění?:Šedý zákal::", "Co je oční stav způsobený infekcí nebo alergií?:Zánět spojivek::", "Co je to oční stav, kdy dojde k poškození zrakového nervu, který spojuje oko s mozkem?:Glaukom::", "Co je to porucha zraku, při které mozek nedokáže plně zpracovat vstupy z jednoho oka a časem upřednostňuje druhé oko?:Amblyopie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Jaký typ rakoviny může zahrnovat bulku v prsu nebo změnu tvaru prsu?:Rakovina prsu::", "Jaký je nejčastější typ rakoviny, který postihuje pouze muže?:Rakovina prostaty::", "Co je to za typ rakoviny, při kterém buňky v tlustém střevě nebo konečníku rostou nekontrolovaně?:Kolorektální rakovina::", "Jaký typ rakoviny je způsoben dlouhodobým kouřením tabáku?:Rakovina plic::", "Jaký typ rakoviny je způsoben nadměrným vystavením ultrafialovým paprskům ze slunce?:Rakovina kůže::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Jak se nazývá podnormální hladina kyslíku ve vaší krvi, konkrétně v tepnách?:Hypoxémie::", "Jak se nazývá podnormální hladina vápníku ve vaší krvi?:Hypokalcémie::", "Jak se nazývá nadnormální hladina vápníku ve vaší krvi?:Hyperkalcémie::", "Jak se nazývá podnormální hladina fosfátu ve vaší krvi?:hypofosfatémie::", "Jak se nazývá nadnormální hladina fosfátu ve vaší krvi?:Hyperfosfatemie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Zežloutnutí kůže a očního bělma:Hepatitida:3,4,5:", "Vyrážka nebo svědění kolem konečníku:Střevní paraziti:2,7,8:", "Středně silná až silná bolest břicha, která se může rozšířit do zad:Pankreatitida:1,3,4:", "Silná bolest žaludku:Žaludeční vřed:6,7,8:", "Náhlá bolest, která začíná na pravé straně podbřišku:Apendicitida:0,3,7:", "Nevolnost nebo opakující se žaludeční nevolnost:Zánět žaludku:4,2,1:", "Extrémní svědění kolem řitního otvoru:Hemoroidy:0,2,3:", "Bolest nebo pocit pálení při močení:Ledvinové kameny:3,9,1:", "Zežloutnutí kůže a očního bělma:Cirhóza:7,5,4:", "Krev ve stolici:Crohnova nemoc:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["bolest kloubů:Artritida:1,2,3:", "okamžitá, silná bolest:Zlomenina kosti:2,3:", "Ztráta výšky v průběhu času:Osteoporóza:1,3,4:", "viditelně prohnutá páteř:Skolióza:0,1,2:", "červená, lesklá kůže nad postiženým kloubem:Dna:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Velké lýtkové svaly:svalová dystrofie:2,3,4:", "Jedna paže nebo jedna noha je menší než druhá:svalová atrofie:2,3,4:", "bolest šlachy, která se při pohybu zhoršuje:tendinitida:1,3,4:", "Náhlá, ostrá bolest:svalové křeče:1,2:", "náhlá bolest, která se zhoršuje při stahování svalu:ruptura svalu:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Bezbolestné zduření lymfatických uzlin na krku, v podpaží nebo v tříslech:Lymfom:2,3:", "Zduřené lymfatické uzliny, zvětšená játra nebo slezina:Leukémie:2,3:", "Třesoucí se:Podchlazení:0,1:", "Necitlivost nebo slabost v pažích nebo nohou:Ateroskleróza:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Náhlá vysoká horečka, silná bolest hlavy, která se zdá být odlišná od normálu:Meningitida:1,2,3:", "slepota na jedno oko:Roztroušená skleróza:0,3,4:", "Třes v rukou:Parkinsonova choroba:0,3,4:", "pohybové tiky:Tourettův syndrom:0,1,4:", "potíže se soustředěním a výpadky paměti:Huntingtonova nemoc:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Červené nebo oteklé dásně:Paradentóza:2,3,4:", "Červené nebo oteklé dásně:zánět dásní:2,3,4:", "Bolest zubů:Zubní kaz:0,4,3:", "problémy s polykáním:Zánět mandlí:0,2,4:", "Deformace horní čelisti:Rozštěp rtu:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["tekutina, která odtéká z ucha:Otitis:1,2,3:", "Ztráta sluchu:Hluchota:0,2,3:", "zvonění v uších:Tinnitus:0,1,3:", "závrať:meniérová nemoc:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Zakalené vidění:Šedý zákal:1,2,3:", "Růžová nebo červená barva v očním bělmu:Zánět spojivek:0,2,3:", "intenzivní bolest očí:Glaukom:0,1,3:", "Špatné vnímání hloubky a periferní vidění:Amblyopie:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Nová bulka v prsu nebo v podpaží:Rakovina prsu:1,2,3:", "Krev v moči:Rakovina prostaty:2,3,4:", "Změna ve vyprazdňování:Kolorektální rakovina:1,3,4:", "kašel, který po 2 nebo 3 týdnech neustupuje:Rakovina plic:1,2,4:", "znaménko, který mění barvu, velikost nebo krvácí:Rakovina kůže:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Modravá barva kůže, nehtů a rtů:Hypoxémie:1,2,3:", "Škubání v rukou, obličeji a nohou:Hypokalcémie:0,2,4:", "Častější močení a žízeň:Hyperkalcémie:0,1:", "oslabení kostí:hypofosfatémie:0,4:", "svalové křeče nebo křeče:Hyperfosfatemie:0,1:"]);
  }

  void addDA(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.da;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["lever:1,2,3:29.2,45", "Mund:4,2,9:28.1,81.6", "Spiserøret:1,8,5:48.6,58.6", "Stor tarme:4,2,6:20.5,21", "Tyndtarmen:8,7,1:52.4,19", "Mave:4,6,7:66,41", "svælg:5,2,9:48.6,81", "Galdeblæren:6,9,4:31.3,39.6", "Bugspytkirtel:2,1,0:50,35.1", "blindtarm:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Skalle:11,8,6:48,97", "skulderbladet:5,4,3:61.1,80.2", "Ribben:11,7,0:56,74.1", "Rygsøjle:8,10,1:45.9,65.2", "Skinneben:5,9,3:51.4,23.6", "Lårben:4,10,7:54.9,35.5", "Humerus:2,7,9:69.1,66.2", "Metacarpale knogler:6,0,1:81.3,44.8", "Karpale knogler:5,4,2:77.1,48.7", "Fodrod:4,3,1:49.3,6.9", "Metatarsale knogler:0,3,5:54.2,2.8", "Bækken:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltoideus:4,1,5:65.3,80.2", "Biceps:5,0,4:67.3,71.5", "Pectoral muskler:5,0,4:52.5,76.4", "Trapezius:1,5,4:51.4,85.5", "Skrå ydre bugmuskel:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Hjerte:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Nyre-vener:0,4,5:57.3,59.1", "Nyre arterie:0,5,4:61.5,59.1", "Halspulsåre:0,2,5:60.4,86.1", "Femoral vene:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Hjerne:5,4,3:50.4,96.8", "lillehjernen:5,4,3:56,92.6", "Rygmarv:0,4,3:50.7,86.8", "Iskiasnerven:0,4,5:59.4,37.6", "Tibial nerve:1,5,3:61.1,19.4", "ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Læber:1,2,4:61.4,96.6", "drøbel:6,2,0:48.6,51.8", "kindtænder:0,6,1:76.1,33", "fortand:0,4,1:50.4,83", "Tunge:7,2,0:48.2,27.6", "Mandel:4,0,6:69.5,46.8", "hård gane:1,2,0:48.6,73.8", "Blød gane:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["frontallappen:1,2,4:25,58.5", "Temporallap:0,2,3:51.2,42.2", "parietallappen lob:0,1,3:66,69", "Occipitallap:0,1,2:91,46", "lillehjernen:1,2,0:72.8,26.1", "hjernestammen:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["ydre øre:1,2,4:8,31", "Øregang:0,2,6:33.5,42.1", "Ørtromme:1,5,6:55.6,42", "ossicles:1,0,6:54.3,52.9", "Cochlea:6,1,5:75.8,45.7", "Auditiv nerv:6,2,1:91.8,48", "Eustachian-rør:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "vena cava superior:6,7,4:27.3,92", "vena cava inferior:1,4,3:27.8,6.8", "Højre atrium:4,7,0:31,54.4", "Venstre atrium:7,6,0:59.6,55.5", "Mitralventil:8,2,0:69.5,43.7", "Højre ventrikel:0,1,3:47.8,38.9", "Venstre ventrikel:1,8,3:58.1,43", "Tricuspid ventil:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "hornhinde:2,6,4:1.7,50.5", "Linse:1,4,6:19,51.3", "nethinde:1,6,4:64.6,76.8", "Optisk nerv:0,6,3:87.9,36.2", "forreste kammer:6,4,3:7.2,51.4", "Glaslegemet:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Cellekerne:5,3,2:57.3,75.5", "Kernelegeme:2,6,4:44.5,67.9,8", "Cytoplasma:1,4,6:93.08,50.09,9", "Cellemembran:2,5,1:90,24,14", "Ribosom:2,1,3:80.929,75.844,14", "Mitokondrie:1,2,3:51.4,90.35,18", "Endoplasmatisk reticulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oxygen:1,2,4:74.5,29,25", "Kulstof:2,0,4:74.5,57,25", "Brint:1,0,5:74.5,73.2,25", "Kvælstof:1,0,2:74.5,83.5,25", "Calcium:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Hvilket organ producerer galde, der er nødvendigt for fordøjelsen?:0,7,6,8", "Hvad er den første del af fordøjelseskanalen, der modtager mad og producerer spyt?:1,2,6,5", "Gennem hvilket organføde passerer fra svælget til maven?:2,6,9,7", "Hvilket organ er den sidste del af fordøjelsessystemet?:3,4,7,8", "Hvor sker den største optagelse af næringsstoffer og mineraler fra maden?:4,5,3,0", "Hvilket organ udskiller fordøjelsesenzymer og mavesyre for at hjælpe med madfordøjelsen?:5,4,7,3", "Hvad hedder den del af halsen bag munden og næsehulen?:6,2,9,8", "Hvor opbevares og koncentreres galden, før den frigives til tyndtarmen?:7,6,9,8", "Hvor udskilles insulin fra?:8,0,7,6", "Hvilket organ er placeret nederst til højre i maven?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Hvad er en knoglestruktur, der danner hovedet?:0,1,9,7", "Hvad er også kendt som skulderbenet?:1,9,11,6", "Hvad er en halvstiv knogle- og bruskstruktur, som omgiver brysthulen?:2,7,8,11", "Hvad er det definerende kendetegn ved et hvirveldyr?:3,0,11,2", "Hvad er den største af de to knogler i benet under knæet?:4,6,9,5", "Hvad er den længste og stærkeste knogle i din krop?:5,6,9,1", "Hvad er en lang knogle i armen, der løber fra skulderen til albuen?:6,5,1,7", "Hvad er en gruppe på fem håndknogler mellem phalanges og håndleddet?:7,5,1,3", "Hvilke knogler udgør håndleddet?:8,7,9,10", "Hvad er en klynge af syv artikulerende knogler i hver fod?:9,7,8,1", "Hvad er en gruppe på fem lange knogler i foden?:10,8,7,4", "Hvad er den nederste del af torsoen?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Hvad er den muskel, der danner den afrundede kontur af den menneskelige skulder?:0,1,3,5", "Hvad er en stor muskel, der ligger på forsiden af ​​overarmen mellem skulderen og albuen?:1,0,2,3", "Hvilken muskel er placeret ved brystet af den menneskelige krop?:2,3,5,1", "Hvad er en trekantet muskel placeret på den bagerste del af nakken?:3,1,2,5", "Hvilken muskel er den største af de laterale mavemuskler?:4,1,2,0", "Hvad er den største af 4 muskler i benets forreste del?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Hvad er et muskelorgan, der pumper blod gennem blodkarrene i kredsløbet?:0,1,3,5", "Hvad er den vigtigste og største arterie i menneskekroppen?:1,4,3,2", "Hvad er vener, der dræner nyren?:2,5,4,1", "Hvad er parrede arterier, der forsyner nyrerne med blod?:3,2,1,5", "Hvad er vener, der fører iltfattigt blod fra hovedet tilbage til hjertet?:4,2,5,1", "Hvad er en stor vene placeret dybt inde i låret?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Hvad er et organ, der tjener som centrum af nervesystemet?:0,1,2,5", "Hvad er et væsentligt træk ved baghjernen hos alle hvirveldyr?:1,5,0,2", "Hvad er en lang, tynd, rørformet struktur, der består af nervevæv?:2,1,3,4", "Hvad er en stor nerve, der løber langs hofteleddet?:3,2,1,5", "Hvad er en gren af ​​ischiasnerven?:4,5,2,1", "Hvad er en gruppe af neuroncellelegemer i det perifere nervesystem?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Hvad er muskelfolder, der omkranser munden?:0,1,4,7", "Hvad er en kødfuld forlængelse, der hænger over halsen?:1,4,0,7", "Hvad er flade tænder bagerst i munden?:2,3,5,6", "Hvad er fortænderne?:3,2,5,6", "Hvad er et muskelorgan i munden?:4,5,6,1", "Hvilke organer spiller en vigtig rolle i immunsystemet?:5,1,4,0", "Hvad er en tynd vandret knogleplade, der består af to knogler i ansigtsskelettet?:6,7,2,5", "Hvad er det bløde væv, der udgør bagsiden af ​​mundtaget?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Hvad er den største af hjernens fire store lapper?:0,3,1,4", "Hvad sidder bag ørerne og er den næststørste lap?:1,0,3,2", "Hvad er involveret i opfattelsen af ​​sansning, herunder berøring, temperatur, smerte?:2,0,3,5", "Hvad er hjernens visuelle behandlingscenter?:3,0,1,4", "Hvad spiller en vigtig rolle i balancekontrol?:4,5,0,1", "Hvad hjælper med at kontrollere puls og vejrtrækning?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Hvad er den synlige del af øret, der er uden for hovedet?:0,3,6,2", "Hvad er en vej, der løber fra det ydre øre til mellemøret?:1,2,3,0", "Hvad er en tynd hudflig, der strækkes stramt som en tromme og vibrerer, når lyden rammer den?:2,0,5,3", "Hvad er tre knogler i mellemøret, der er blandt de mindste knogler i menneskekroppen?:3,0,6,2", "Hvad minder om skallen på en snegl?:4,2,0,6", "Hvad bærer auditiv sensorisk information fra cochlea i det indre øre direkte til hjernen?:5,2,0,6", "Hvad er også kendt som det auditive rør?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Hvad er den vigtigste og største arterie i menneskekroppen?:0,3,8,6", "Hvilken vene fører blod fra dit hoved, nakke, arme og bryst tilbage til dit hjerte?:1,3,0,2", "Hvilken vene fører blod fra din underkrop tilbage til dit hjerte?:2,1,0,3", "Hvad er det øvre kammer, gennem hvilket blod kommer ind i hjertets ventrikler?:3,5,6,2", "hvilket hjertekammer modtager iltet blod fra lungerne?:4,3,6,8", "Hvilken ventil adskiller de to kamre i venstre side af hjertet?:5,8,7,3", "Hvad er muskelkammer, der pumper blod ud af hjertet og ind i kredsløbet?:6,5,8,2", "Hvilket er et af hjertets fire kamre?:7,0,1,2", "Dets rolle er at forhindre tilbagestrømning af blod fra højre ventrikel ind i højre atrium.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Hvad er en tynd struktur i øjet, ansvarlig for at kontrollere pupillens diameter og størrelse?:0,1,3,2", "Hvad er den gennemsigtige forreste del af øjet, der dækker iris?:1,2,3,0", "Hvad er en gennemsigtig struktur i øjet, der hjælper med at bryde lys for at blive fokuseret på nethinden?:2,3,0,1", "Hvad er øjets inderste, lysfølsomme lag af væv?:3,1,0,2", "Hvad overfører visuel information fra nethinden til hjernen?:4,6,5,3", "Hvad er den forreste del af øjet mellem hornhinden og iris?:5,6,2,3", "Hvilket øjenkammer er placeret bag linsen og foran synsnerven?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Hvad findes i midten af ​​cellen, og det indeholder DNA arrangeret i kromosomer?:0,1,2,3", "Hvilken region i cellen er optaget af at producere celle ribosomer?:1,2,3,4", "Hvad er en gelatinøs væske, der fylder indersiden af ​​en celle?:2,3,4,5", "Hvad beskytter cellen mod dens ydre miljø?:3,4,2,1", "Hvad er en cellestruktur, der producerer protein?:4,3,2,1", "Hvad omdanner kemisk energi til en energiform, som cellen kan bruge?:5,4,3,2", "Hvad er transportsystemet for den eukaryote celle?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Hvad bruges til at oxidere vores mad, i processen med cellulær respiration, og dermed frigive energi?:0,1,2,3", "Hvad er det næstmest rigelige element i menneskekroppen?:1,2,3,4", "Hvad bruges til at holde menneskekroppen hydreret?:2,3,4,5", "Hvad bruges til at lave aminosyrer i vores krop, som igen laver proteiner?:3,5,4", "Hvad bruges til at bygge og vedligeholde stærke knogler?:4,0,1,2", "Hvad bruges i dannelsen af ​​knogler og tænder?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Hvad er en sygdom, hvor din lever bliver betændt?:Hepatitis::", "Hvad er en sygdom, hvor en parasit inficerer mave-tarmkanalen hos mennesker?:Tarmparasitter::", "Hvad er en sygdom, hvor din bugspytkirtel bliver betændt?:Pancreatitis::", "Hvad er en sygdom, der forårsager et brud i mavens indre slimhinde?:Mavesår::", "Hvad er en sygdom, hvor din blindtarm bliver betændt?:Blindtarmsbetændelse::", "Hvad er en sygdom, hvor din indre slimhinde i maven bliver betændt?:Gastritis::", "Hvilken sygdom forårsager hævede vener i din nedre endetarm?:Hæmorider::", "Hvad er hårde aflejringer lavet af mineraler og salte?:Nyresten::", "Hvad er ardannelse i leveren forårsaget af langvarig leverskade?:Cirrhose::", "Hvad er en type inflammatorisk tarmsygdom?:Crohns sygdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Hvilken sygdom forårsager smerter og betændelse i et led?:arthritis::", "Hvad er et brud i kontinuiteten af ​​en knogle?:Knoglebrud::", "Hvilken sygdom svækker knoglerne, hvilket gør dem skrøbelige og mere tilbøjelige til at brække?:Osteoporose::", "Hvilken sygdom forårsager en sidelæns krumning af rygsøjlen?:Skoliose::", "Hvad er en type gigt, der forårsager pludselige, alvorlige ledsmerter?:Gigt::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Hvilken sygdom forårsager progressiv svaghed og tab af muskelmasse?:muskeldystrofi::", "Hvilken sygdom skyldes manglende fysisk aktivitet?:muskelatrofi::", "Hvilken sygdom forårsager betændelse eller irritation af en sene?:senebetændelse::", "Hvad er en pludselig og ufrivillig sammentrækning af en af ​​dine muskler?:muskelkramper::", "Hvad sker der, når din muskel er overstrakt eller revet i stykker?:muskelsprængning::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Hvad er en type kræft, der starter i celler, der er en del af kroppens immunsystem?:Lymfom::", "Hvad er en type kræft, der normalt begynder i knoglemarven?:Leukæmi::", "Hvad skyldes langvarig udsættelse for meget kolde temperaturer?:Hypotermi::", "Hvad er en hærdning af dine arterier forårsaget af gradvis plakopbygning?:Åreforkalkning::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Hvad er en akut betændelse i de beskyttende membraner, der dækker hjernen og rygmarven?:Meningitis::", "Hvad er en sygdom, der kan påvirke din hjerne og rygmarv, og som kan give problemer med syn, balance, muskelkontrol?:Multipel sclerose::", "Hvad er en hjernesygdom, der fører til rysten, stivhed og gangbesvær, balance og koordination?:Parkinsons sygdom::", "Hvad er kendetegnet ved tics med flere bevægelser og mindst én vokal tics?:Tourettes syndrom::", "Hvad er en uhelbredelig, arvelig hjernesygdom, der beskadiger hjerneceller?:Huntingtons sygdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Hvad er en alvorlig tandkødsinfektion, der beskadiger det bløde væv, og som kan ødelægge den knogle, der understøtter dine tænder?:Paradentose::", "Hvad er en mild form for tandkødssygdom, der forårsager irritation, rødme og hævelse af din tandkød?:tandkødsbetændelse::", "Hvad er permanent beskadigede områder i den hårde overflade af dine tænder?:Huller i tænderne::", "Hvad er en infektion i mandlerne bagerst i din hals?:Halsbetændelse::", "Hvad sker der, hvis vævet, der udgør læben, ikke går helt sammen før fødslen?:Læbespalte::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Hvilken hjernesygdom ødelægger hukommelsen og tænkeevnen og i sidste ende evnen til at udføre de enkleste opgaver?:Alzheimers sygdom::", "Hvad er en ualmindelig, men alvorlig tilstand, hvor hjernen bliver betændt?:Encephalitis::", "Hvad er en hovedpinelidelse karakteriseret ved tilbagevendende hovedpine, der er moderat til svær?:Migræne::", "Hvad er en sygdom, der påvirker hjernen og forårsager hyppige anfald?:Epilepsi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Hvad sker der, når en virus eller en bakterie får området bag trommehinden til at blive betændt?:Otitis::", "Hvad refererer til den fuldstændige eller delvise manglende evne til at høre lyde?:Døvhed::", "Hvad er en tilstand, hvor du hører lyde, når der ikke er nogen ekstern kilde til lydene?:Tinnitus::", "Hvad er en lidelse i det indre øre, der kan føre til svimmelhed (vertigo) og høretab?:Menières sygdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Hvad er brystsmerter forårsaget af nedsat blodgennemstrømning til hjertemusklerne?:Angina::", "Hvad er blodtryk, der er højere end normalt?:Forhøjet blodtryk::", "Hvad sker der, når blodgennemstrømningen falder eller stopper til hjertets kranspulsåre?:Myokardieinfarkt::", "Hvad er en alvorlig tilstand, hvor hjertet ikke pumper blod så effektivt, som det burde?:Kongestiv hjertesvigt::", "Hvad er et ord for høje niveauer af kolesterol i blodet?:Hyperkolesterolæmi::", "Hvad er en abnormitet i hjertets rytme?:Arytmi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Hvad er et uklart område i øjets linse, der fører til nedsat syn?:Grå stær::", "Hvad er en øjenlidelse forårsaget af infektion eller allergi?:Konjunktivitis::", "Hvad er en øjensygdom, hvor synsnerven, som forbinder øjet med hjernen, bliver beskadiget?:Grøn stær::", "Hvad er en synsforstyrrelse, hvor hjernen ikke fuldt ud kan behandle input fra det ene øje og over tid favoriserer det andet øje?:Amblyopi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Hvad er en type kræft, der kan omfatte en klump i brystet eller en ændring i brystformen?:Brystkræft::", "Hvad er den mest almindelige form for kræft, der kun rammer mænd?:Prostatakræft::", "Hvad er en type kræft, hvor celler i tyktarmen eller endetarmen vokser ude af kontrol?:Kolorektalkræft::", "Hvilken type kræft forårsages af langvarig tobaksrygning?:Lungekræft::", "Hvilken type kræft er forårsaget af overeksponering for ultraviolette stråler fra solen?:Hudkræft::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Hvad kaldes et undernormalt niveau af ilt i dit blod, specifikt i arterierne?:Hypoxæmi::", "Hvad kaldes et undernormalt niveau af calcium i dit blod?:Hypokalcæmi::", "Hvad kaldes et overnormalt niveau af calcium i dit blod?:Hypercalcæmi::", "Hvad kaldes et undernormalt niveau af fosfat i dit blod?:hypofosfatæmi::", "Hvad kaldes et overnormalt niveau af fosfat i dit blod?:Hyperfosfatæmi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Gulfarvning af huden og det hvide i dine øjne:Hepatitis:3,4,5:", "Udslæt eller kløe omkring endetarmen:Tarmparasitter:2,7,8:", "Moderate til svære mavesmerter, der kan sprede sig til din ryg:Pancreatitis:1,3,4:", "Kraftige mavesmerter:Mavesår:6,7,8:", "Pludselig smerte, der begynder på højre side af underlivet:Blindtarmsbetændelse:0,3,7:", "Kvalme eller tilbagevendende dårlig mave:Gastritis:4,2,1:", "Ekstrem kløe omkring anus:Hæmorider:0,2,3:", "Smerte eller brændende fornemmelse under vandladning:Nyresten:3,9,1:", "Gulfarvning af huden og det hvide i dine øjne:Cirrhose:7,5,4:", "Blod i afføringen:Crohns sygdom:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["ledsmerter:arthritis:1,2,3:", "øjeblikkelige, stærke smerter:Knoglebrud:2,3:", "Tab af højde over tid:Osteoporose:1,3,4:", "en synligt buet rygsøjle:Skoliose:0,1,2:", "rød, skinnende hud over det angrebne led:Gigt:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Store lægmuskler:muskeldystrofi:2,3,4:", "Den ene arm eller et ben er mindre end den anden:muskelatrofi:2,3,4:", "smerter i en sene, der bliver værre, når du bevæger dig:senebetændelse:1,3,4:", "En pludselig, skarp smerte:muskelkramper:1,2:", "pludselige smerter, der forværres, mens musklen trækkes sammen:muskelsprængning:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Smertefri hævelse af lymfeknuder i din nakke, armhuler eller lyske:Lymfom:2,3:", "Hævede lymfeknuder, forstørret lever eller milt:Leukæmi:2,3:", "Rystende:Hypotermi:0,1:", "Følelsesløshed eller svaghed i dine arme eller ben:Åreforkalkning:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Pludselig høj feber, svær hovedpine, der virker anderledes end normalt:Meningitis:1,2,3:", "blindhed på det ene øje:Multipel sclerose:0,3,4:", "Rysten i hænderne:Parkinsons sygdom:0,3,4:", "bevægelses-tics:Tourettes syndrom:0,1,4:", "koncentrationsbesvær og hukommelsessvigt:Huntingtons sygdom:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Rødt eller hævet tandkød:Paradentose:2,3,4:", "Rødt eller hævet tandkød:tandkødsbetændelse:2,3,4:", "Tandpine:Huller i tænderne:0,4,3:", "problemer med at synke:Halsbetændelse:0,2,4:", "Deformiteter af overkæben:Læbespalte:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["væske, der dræner fra øret:Otitis:1,2,3:", "Tab af hørelse:Døvhed:0,2,3:", "en ringen for ørerne:Tinnitus:0,1,3:", "svimmelhed:Menières sygdom:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Skyet syn:Grå stær:1,2,3:", "Pink eller rød farve i det hvide i øjet:Konjunktivitis:0,2,3:", "intense øjensmerter:Grøn stær:0,1,3:", "Dårlig dybdeopfattelse og perifert syn:Amblyopi:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["En ny klump i brystet eller armhulen:Brystkræft:1,2,3:", "Blod i urinen:Prostatakræft:2,3,4:", "En ændring i afføringsvaner:Kolorektalkræft:1,3,4:", "en hoste, der ikke går over efter 2 eller 3 uger:Lungekræft:1,2,4:", "En modermærke, der ændrer sig i farve, størrelse eller som bløder:Hudkræft:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Blålig farve i hud, negle og læber:Hypoxæmi:1,2,3:", "Rykninger i dine hænder, ansigt og fødder:Hypokalcæmi:0,2,4:", "Hyppigere vandladning og tørst:Hypercalcæmi:0,1:", "svækkelse af knogler:hypofosfatæmi:0,4:", "muskelkramper eller spasmer:Hyperfosfatæmi:0,1:"]);
  }

  void addDE(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.de;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Leber:1,2,3:29.2,45", "Mund:4,2,9:28.1,81.6", "Ösophagus:1,8,5:48.6,58.6", "Dickdarm:4,2,6:20.5,21", "Dünndarm:8,7,1:52.4,19", "Magen:4,6,7:66,41", "Rachen:5,2,9:48.6,81", "Gallenblase:6,9,4:31.3,39.6", "Bauchspeicheldrüse:2,1,0:50,35.1", "Appendix:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Schädel:11,8,6:48,97", "Schulterblatt:5,4,3:61.1,80.2", "Rippen:11,7,0:56,74.1", "Wirbelsäule:8,10,1:45.9,65.2", "Schienbein:5,9,3:51.4,23.6", "Oberschenkelknochen:4,10,7:54.9,35.5", "Oberarmknochen:2,7,9:69.1,66.2", "Mittelhandknochen:6,0,1:81.3,44.8", "Handwurzelknochen:5,4,2:77.1,48.7", "Fußwurzelknochen:4,3,1:49.3,6.9", "Mittelfußknochen:0,3,5:54.2,2.8", "Becken:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltoideus:4,1,5:65.3,80.2", "Bizeps:5,0,4:67.3,71.5", "Brustmuskel:5,0,4:52.5,76.4", "Trapezmuskel:1,5,4:51.4,85.5", "Äußerer schräger Bauchmuskel:1,5,0:54.2,65.9", "Musculus tibialis:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Herz:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Nierenvenen:0,4,5:57.3,59.1", "Nierenarterie:0,5,4:61.5,59.1", "Halsvenen:0,2,5:60.4,86.1", "Vena femoralis:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Gehirn:5,4,3:50.4,96.8", "Kleinhirn:5,4,3:56,92.6", "Rückenmark:0,4,3:50.7,86.8", "Ischiasnerv:0,4,5:59.4,37.6", "Tibialnerv:1,5,3:61.1,19.4", "Ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Lippen:1,2,4:61.4,96.6", "Uvula:6,2,0:48.6,51.8", "Molaren:0,6,1:76.1,33", "Schneidezahn:0,4,1:50.4,83", "Zunge:7,2,0:48.2,27.6", "Mandel:4,0,6:69.5,46.8", "Harter Gaumen:1,2,0:48.6,73.8", "Weicher Gaumen:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Frontallappen:1,2,4:25,58.5", "Temporallappen:0,2,3:51.2,42.2", "Parietallappen:0,1,3:66,69", "Hinterhauptlappen:0,1,2:91,46", "Kleinhirn:1,2,0:72.8,26.1", "Hirnstamm:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Ohrmuschel:1,2,4:8,31", "Gehörgang:0,2,6:33.5,42.1", "Trommelfell:1,5,6:55.6,42", "Gehörknöchelchen:1,0,6:54.3,52.9", "Hörschnecke:6,1,5:75.8,45.7", "Hörnerv:6,2,1:91.8,48", "Eustachische Röhre:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Höhere Hohlvene:6,7,4:27.3,92", "Untere Hohlvene:1,4,3:27.8,6.8", "Rechter Vorhof:4,7,0:31,54.4", "Linker Vorhof:7,6,0:59.6,55.5", "Mitralklappe:8,2,0:69.5,43.7", "Rechter Ventrikel:0,1,3:47.8,38.9", "Linker Ventrikel:1,8,3:58.1,43", "Trikuspidalklappe:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "Hornhaut:2,6,4:1.7,50.5", "Linse:1,4,6:19,51.3", "Netzhaut:1,6,4:64.6,76.8", "Sehnerv:0,6,3:87.9,36.2", "Vorderkammer:6,4,3:7.2,51.4", "Glaskörper:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Kern:5,3,2:57.3,75.5", "Nukleolus:2,6,4:44.5,67.9,8", "Zytoplasma:1,4,6:93.08,50.09,9", "Zellmembran:2,5,1:90,24,14", "Ribosom:2,1,3:80.929,75.844,14", "Mitochondrium:1,2,3:51.4,90.35,18", "Endoplasmatisches Retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Sauerstoff:1,2,4:74.5,29,25", "Kohlenstoff:2,0,4:74.5,57,25", "Wasserstoff:1,0,5:74.5,73.2,25", "Stickstoff:1,0,2:74.5,83.5,25", "Kalzium:0,1,2:74.5,91.2,25", "Phosphor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Welches Organ produziert die für die Verdauung notwendige Galle?:0,7,6,8", "Was ist der erste Teil des Verdauungskanals, der Nahrung aufnimmt und Speichel produziert?:1,2,6,5", "Durch welches Organ gelangt die Nahrung vom Rachen in den Magen?:2,6,9,7", "Welches Organ ist der letzte Teil des Verdauungssystems?:3,4,7,8", "Wo findet die meiste Aufnahme von Nähr- und Mineralstoffen aus der Nahrung statt?:4,5,3,0", "Welches Organ sondert Verdauungsenzyme und Magensäure ab, um die Nahrungsverdauung zu unterstützen?:5,4,7,3", "Wie heißt der Teil des Rachens hinter der Mund- und Nasenhöhle?:6,2,9,8", "Wo wird die Galle gespeichert und konzentriert, bevor sie in den Dünndarm abgegeben wird?:7,6,9,8", "Wo wird Insulin ausgeschüttet?:8,0,7,6", "Welches Organ befindet sich im rechten Unterbauch?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Was ist eine Knochenstruktur, die den Kopf bildet?:0,1,9,7", "Was wird auch als Schulterknochen bezeichnet?:1,9,11,6", "Was ist eine halbstarre knöcherne und knorpelige Struktur, die die Brusthöhle umgibt?:2,7,8,11", "Was ist das charakteristische Merkmal eines Wirbeltiers?:3,0,11,2", "Was ist der größere der beiden Knochen im Bein unterhalb des Knies?:4,6,9,5", "Was ist der längste und stärkste Knochen in Ihrem Körper?:5,6,9,1", "Was ist ein langer Knochen im Arm, der von der Schulter bis zum Ellbogen verläuft?:6,5,1,7", "Was ist eine Gruppe von fünf Handknochen zwischen den Phalangen und dem Handgelenk?:7,5,1,3", "Aus welchen Knochen besteht das Handgelenk?:8,7,9,10", "Was ist eine Gruppe aus sieben artikulierenden Knochen in jedem Fuß?:9,7,8,1", "Was ist eine Gruppe von fünf langen Knochen im Fuß?:10,8,7,4", "Was ist der untere Teil des Torsos?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Was ist der Muskel, der die abgerundete Kontur der menschlichen Schulter bildet?:0,1,3,5", "Was ist ein großer Muskel, der auf der Vorderseite des Oberarms zwischen Schulter und Ellbogen liegt?:1,0,2,3", "Welcher Muskel befindet sich an der Brust des menschlichen Körpers?:2,3,5,1", "Was ist ein dreieckiger Muskel, der sich auf der Rückseite des Halses befindet?:3,1,2,5", "Welcher Muskel ist der größte der seitlichen Bauchmuskeln?:4,1,2,0", "Welcher ist der größte der 4 Muskeln im vorderen Bereich des Beins?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Was ist ein Muskelorgan, das Blut durch die Blutgefäße des Kreislaufsystems pumpt?:0,1,3,5", "Was ist die wichtigste und größte Arterie im menschlichen Körper?:1,4,3,2", "Was sind Venen, die die Niere entwässern?:2,5,4,1", "Was sind paarige Arterien, die die Nieren mit Blut versorgen?:3,2,1,5", "Was sind Venen, die sauerstoffarmes Blut vom Kopf zurück zum Herzen transportieren?:4,2,5,1", "Was ist eine große Vene tief im Oberschenkel?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Was ist ein Organ, das als Zentrum des Nervensystems dient?:0,1,2,5", "Was ist ein Hauptmerkmal des Hinterhirns aller Wirbeltiere?:1,5,0,2", "Was ist eine lange, dünne, röhrenförmige Struktur aus Nervengewebe?:2,1,3,4", "Was ist ein großer Nerv, der neben dem Hüftgelenk verläuft?:3,2,1,5", "Was ist ein Ast des Ischiasnervs?:4,5,2,1", "Was ist eine Gruppe von Neuronenzellkörpern im peripheren Nervensystem?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Was sind Muskelfalten, die den Mund umgeben?:0,1,4,7", "Was ist eine fleischige Verlängerung, die über der Kehle hängt?:1,4,0,7", "Was sind flache Zähne im hinteren Teil des Mundes?:2,3,5,6", "Was sind die Frontzähne?:3,2,5,6", "Was ist ein Muskelorgan im Mund?:4,5,6,1", "Welche Organe spielen eine wichtige Rolle im Immunsystem?:5,1,4,0", "Was ist eine dünne horizontale Knochenplatte, die aus zwei Knochen des Gesichtsskeletts besteht?:6,7,2,5", "Was ist das Weichgewebe, das die Rückseite des Gaumens bildet?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Was ist der größte der vier Hauptlappen des Gehirns?:0,3,1,4", "Was sitzt hinter den Ohren und ist das zweitgrößte Ohrläppchen?:1,0,3,2", "Was ist an der Wahrnehmung von Empfindungen beteiligt, einschließlich Berührung, Temperatur, Schmerz?:2,0,3,5", "Was ist das visuelle Verarbeitungszentrum des Gehirns?:3,0,1,4", "Was spielt eine wichtige Rolle bei der Gleichgewichtskontrolle?:4,5,0,1", "Was hilft, Herzfrequenz und Atemfrequenz zu kontrollieren?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Was ist der sichtbare Teil des Ohrs, der sich außerhalb des Kopfes befindet?:0,3,6,2", "Was ist ein Weg, der vom Außenohr zum Mittelohr verläuft?:1,2,3,0", "Was ist ein dünner Hautlappen, der wie eine Trommel gespannt ist und vibriert, wenn Schall darauf trifft?:2,0,5,3", "Welche drei Knochen im Mittelohr gehören zu den kleinsten Knochen des menschlichen Körpers?:3,0,6,2", "Was ähnelt dem Gehäuse einer Schnecke?:4,2,0,6", "Was transportiert auditive Sinnesinformationen von der Cochlea des Innenohrs direkt zum Gehirn?:5,2,0,6", "Was wird auch als Gehörgang bezeichnet?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Was ist die wichtigste und größte Arterie im menschlichen Körper?:0,3,8,6", "Welche Vene führt Blut von Kopf, Hals, Armen und Brust zurück zu Ihrem Herzen?:1,3,0,2", "Welche Vene führt Blut von Ihrem Unterkörper zurück zu Ihrem Herzen?:2,1,0,3", "Was ist die obere Kammer, durch die das Blut in die Herzkammern gelangt?:3,5,6,2", "Welche Herzkammer erhält sauerstoffreiches Blut aus der Lunge?:4,3,6,8", "Welche Klappe trennt die beiden Kammern der linken Herzhälfte?:5,8,7,3", "Was ist eine Muskelkammer, die Blut aus dem Herzen in das Kreislaufsystem pumpt?:6,5,8,2", "Welches ist eine der vier Herzkammern?:7,0,1,2", "Seine Aufgabe ist es, den Rückfluss von Blut aus der rechten Herzkammer in den rechten Vorhof zu verhindern.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Was ist eine dünne Struktur im Auge, die für die Kontrolle des Durchmessers und der Größe der Pupille verantwortlich ist?:0,1,3,2", "Was ist der transparente vordere Teil des Auges, der die Iris bedeckt?:1,2,3,0", "Was ist eine transparente Struktur im Auge, die hilft, Licht zu brechen, um es auf der Netzhaut zu fokussieren?:2,3,0,1", "Was ist die innerste, lichtempfindliche Gewebeschicht des Auges?:3,1,0,2", "Was überträgt visuelle Informationen von der Netzhaut zum Gehirn?:4,6,5,3", "Was ist der vordere Teil des Auges zwischen Hornhaut und Iris?:5,6,2,3", "Welche Augenkammer befindet sich hinter der Linse und vor dem Sehnerv?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Was befindet sich in der Mitte der Zelle und enthält in Chromosomen angeordnete DNA?:0,1,2,3", "Welche Region innerhalb der Zelle ist mit der Produktion der Zellribosomen befasst?:1,2,3,4", "Was ist eine gallertartige Flüssigkeit, die das Innere einer Zelle ausfüllt?:2,3,4,5", "Was schützt die Zelle vor ihrer äußeren Umgebung?:3,4,2,1", "Was ist eine Zellstruktur, die Protein produziert?:4,3,2,1", "Was wandelt chemische Energie in eine Energieform um, die die Zelle nutzen kann?:5,4,3,2", "Was ist das Transportsystem der eukaryotischen Zelle?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Was wird verwendet, um unsere Nahrung im Prozess der Zellatmung zu oxidieren und so Energie freizusetzen?:0,1,2,3", "Was ist das zweithäufigste Element im menschlichen Körper?:1,2,3,4", "Was wird verwendet, um den menschlichen Körper mit Feuchtigkeit zu versorgen?:2,3,4,5", "Was wird in unserem Körper zur Herstellung von Aminosäuren verwendet, die wiederum Proteine ​​herstellen?:3,5,4", "Was wird verwendet, um starke Knochen aufzubauen und zu erhalten?:4,0,1,2", "Was wird bei der Bildung von Knochen und Zähnen verwendet?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Was ist eine Krankheit, bei der sich Ihre Leber entzündet?:Hepatitis::", "Was ist eine Krankheit, bei der ein Parasit den Magen-Darm-Trakt des Menschen infiziert?:Magen-und Darmparasiten::", "Was ist eine Krankheit, bei der sich Ihre Bauchspeicheldrüse entzündet?:Pankreatitis::", "Was ist eine Krankheit, die eine Unterbrechung der Magenschleimhaut verursacht?:Magengeschwür::", "Was ist eine Krankheit, bei der sich Ihr Blinddarm entzündet?:Appendizitis::", "Was ist eine Krankheit, bei der sich Ihre Magenschleimhaut entzündet?:Gastritis::", "Welche Krankheit verursacht geschwollene Venen im unteren Rektum?:Hämorrhoiden::", "Was sind harte Ablagerungen aus Mineralien und Salzen?:Nierensteine::", "Was ist eine Vernarbung der Leber, die durch einen langfristigen Leberschaden verursacht wird?:Zirrhose::", "Was ist eine Art von entzündlicher Darmerkrankung?:Morbus Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Welche Krankheit verursacht Schmerzen und Entzündungen in einem Gelenk?:Arthritis::", "Was ist ein Bruch in der Kontinuität eines Knochens?:Knochenbruch::", "Welche Krankheit schwächt die Knochen, macht sie brüchig und bricht leichter?:Osteoporose::", "Welche Krankheit verursacht eine seitliche Krümmung der Wirbelsäule?:Skoliose::", "Was ist eine Art von Arthritis, die plötzliche, starke Gelenkschmerzen verursacht?:Gicht::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Welche Krankheit verursacht fortschreitende Schwäche und Verlust von Muskelmasse?:Muskeldystrophie::", "Welche Krankheit entsteht durch Bewegungsmangel?:Muskelatrophie::", "Welche Krankheit verursacht die Entzündung oder Reizung einer Sehne?:Sehnenentzündung::", "Was ist eine plötzliche und unwillkürliche Kontraktion eines Ihrer Muskeln?:Muskelkrämpfe::", "Was passiert, wenn Ihr Muskel überdehnt oder gerissen ist?:Muskelriss::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Was ist eine Krebsart, die in Zellen beginnt, die Teil des körpereigenen Immunsystems sind?:Lymphom::", "Was ist eine Krebsart, die normalerweise im Knochenmark beginnt?:Leukämie::", "Was wird durch längere Exposition gegenüber sehr kalten Temperaturen verursacht?:Unterkühlung::", "Was ist eine Verhärtung Ihrer Arterien, die durch allmähliche Plaquebildung verursacht wird?:Atherosklerose::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Was ist eine akute Entzündung der Schutzmembranen von Gehirn und Rückenmark?:Meningitis::", "Was ist eine Krankheit, die Ihr Gehirn und Ihr Rückenmark beeinträchtigen und Probleme mit dem Sehvermögen, dem Gleichgewicht und der Muskelkontrolle verursachen kann?:Multiple Sklerose::", "Was ist eine Gehirnstörung, die zu Zittern, Steifheit und Schwierigkeiten beim Gehen, Gleichgewicht und Koordination führt?:Parkinson-Krankheit::", "Was zeichnet sich durch mehrere Bewegungs-Tics und mindestens einen Vokal-Tic aus?:Tourette Syndrom::", "Was ist eine unheilbare, erbliche Gehirnerkrankung, die Gehirnzellen schädigt?:Huntington-Krankheit::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Was ist eine schwere Zahnfleischentzündung, die das Weichgewebe schädigt und den Knochen zerstören kann, der Ihre Zähne stützt?:Parodontitis::", "Was ist eine leichte Form der Zahnfleischerkrankung, die Reizungen, Rötungen und Schwellungen Ihres Zahnfleisches verursacht?:Zahnfleischentzündung::", "Was sind dauerhaft geschädigte Bereiche in der harten Oberfläche Ihrer Zähne?:Karies::", "Was ist eine Infektion der Mandeln im Rachen?:Mandelentzündung::", "Was passiert, wenn sich das Gewebe, aus dem die Lippe besteht, vor der Geburt nicht vollständig verbindet?:Lippenspalte::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Welche Gehirnstörung zerstört das Gedächtnis und die Denkfähigkeit und schließlich die Fähigkeit, die einfachsten Aufgaben auszuführen?:Alzheimer-Krankheit::", "Was ist eine ungewöhnliche, aber schwerwiegende Erkrankung, bei der sich das Gehirn entzündet?:Enzephalitis::", "Was ist eine Kopfschmerzerkrankung, die durch wiederkehrende mittelschwere bis schwere Kopfschmerzen gekennzeichnet ist?:Migräne::", "Was ist eine Krankheit, die das Gehirn betrifft und häufige Anfälle verursacht?:Epilepsie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Was passiert, wenn ein Virus oder Bakterium den Bereich hinter dem Trommelfell entzündet?:Otitis::", "Was bezieht sich auf die vollständige oder teilweise Unfähigkeit, Geräusche zu hören?:Taubheit::", "Was ist ein Zustand, in dem Sie Geräusche hören, wenn es keine äußere Quelle der Geräusche gibt?:Tinnitus::", "Was ist eine Erkrankung des Innenohrs, die zu Schwindelanfällen (Vertigo) und Hörverlust führen kann?:Morbus Menière::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Was ist ein Brustschmerz, der durch eine verminderte Durchblutung der Herzmuskeln verursacht wird?:Angina::", "Was ist Blutdruck, der höher als normal ist?:Hypertonie::", "Was passiert, wenn der Blutfluss zur Koronararterie des Herzens abnimmt oder stoppt?:Herzinfarkt::", "Was ist eine ernsthafte Erkrankung, bei der das Herz das Blut nicht so effizient pumpt, wie es sollte?:Herzinsuffizienz::", "Was ist ein Wort für hohe Cholesterinwerte im Blut?:Hypercholesterinämie::", "Was ist eine Anomalie des Herzrhythmus?:Arrhythmie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Was ist ein trüber Bereich in der Augenlinse, der zu einer Verschlechterung des Sehvermögens führt?:Katarakt::", "Was ist eine Augenerkrankung, die durch Infektionen oder Allergien verursacht wird?:Bindehautentzündung::", "Was ist eine Augenerkrankung, bei der der Sehnerv, der das Auge mit dem Gehirn verbindet, beschädigt wird?:Glaukom::", "Was ist eine Sehstörung, bei der das Gehirn die Eingaben von einem Auge nicht vollständig verarbeitet und mit der Zeit das andere Auge bevorzugt?:Amblyopie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Was ist eine Krebsart, die einen Knoten in der Brust oder eine Veränderung der Brustform beinhalten kann?:Brustkrebs::", "Was ist die häufigste Krebsart, die nur Männer betrifft?:Prostatakrebs::", "Was ist eine Krebsart, bei der Zellen im Dickdarm oder Mastdarm unkontrolliert wachsen?:Darmkrebs::", "Welche Art von Krebs wird durch langjähriges Tabakrauchen verursacht?:Lungenkrebs::", "Welche Art von Krebs wird durch übermäßige UV-Strahlung der Sonne verursacht?:Hautkrebs::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Wie nennt man einen unterdurchschnittlichen Sauerstoffgehalt in Ihrem Blut, insbesondere in den Arterien?:Hypoxämie::", "Wie nennt man einen unter dem Normalwert liegenden Kalziumspiegel in Ihrem Blut?:Hypokalzämie::", "Wie nennt man einen überdurchschnittlichen Kalziumspiegel in Ihrem Blut?:Hyperkalzämie::", "Wie nennt man einen unter dem Normalwert liegenden Phosphatspiegel in Ihrem Blut?:Hypophosphatämie::", "Wie nennt man einen überdurchschnittlichen Phosphatspiegel in Ihrem Blut?:Hyperphosphatämie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Gelbfärbung der Haut und des Augenweiß:Hepatitis:3,4,5:", "Hautausschlag oder Juckreiz um das Rektum herum:Magen-und Darmparasiten:2,7,8:", "Mäßige bis starke Bauchschmerzen, die sich auf den Rücken ausbreiten können:Pankreatitis:1,3,4:", "Starke Bauchschmerzen:Magengeschwür:6,7,8:", "Plötzlicher Schmerz, der auf der rechten Seite des Unterbauchs beginnt:Appendizitis:0,3,7:", "Übelkeit oder wiederkehrende Magenverstimmung:Gastritis:4,2,1:", "Extremer Juckreiz um den Anus:Hämorrhoiden:0,2,3:", "Schmerzen oder Brennen beim Wasserlassen:Nierensteine:3,9,1:", "Gelbfärbung der Haut und des Augenweiß:Zirrhose:7,5,4:", "Blut im Stuhl:Morbus Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["Gelenkschmerzen:Arthritis:1,2,3:", "sofortiger, starker Schmerz:Knochenbruch:2,3:", "Höhenverlust im Laufe der Zeit:Osteoporose:1,3,4:", "eine sichtbar gekrümmte Wirbelsäule:Skoliose:0,1,2:", "rote, glänzende Haut über dem betroffenen Gelenk:Gicht:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Große Wadenmuskulatur:Muskeldystrophie:2,3,4:", "Ein Arm oder ein Bein ist kleiner als das andere:Muskelatrophie:2,3,4:", "Schmerzen in einer Sehne, die sich verschlimmern, wenn Sie sich bewegen:Sehnenentzündung:1,3,4:", "Ein plötzlicher, stechender Schmerz:Muskelkrämpfe:1,2:", "plötzlicher Schmerz, der sich verschlimmert, während sich der Muskel zusammenzieht:Muskelriss:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Schmerzlose Schwellung der Lymphknoten im Nacken, in den Achselhöhlen oder in der Leistengegend:Lymphom:2,3:", "Geschwollene Lymphknoten, vergrößerte Leber oder Milz:Leukämie:2,3:", "Zittern:Unterkühlung:0,1:", "Taubheit oder Schwäche in Ihren Armen oder Beinen:Atherosklerose:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Plötzliches hohes Fieber, starke Kopfschmerzen, die anders als normal erscheinen:Meningitis:1,2,3:", "Blindheit auf einem Auge:Multiple Sklerose:0,3,4:", "Zittern in den Händen:Parkinson-Krankheit:0,3,4:", "Bewegungs-Tics:Tourette Syndrom:0,1,4:", "Konzentrationsschwierigkeiten und Gedächtnislücken:Huntington-Krankheit:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Rotes oder geschwollenes Zahnfleisch:Parodontitis:2,3,4:", "Rotes oder geschwollenes Zahnfleisch:Zahnfleischentzündung:2,3,4:", "Zahnschmerzen:Karies:0,4,3:", "Probleme beim Schlucken:Mandelentzündung:0,2,4:", "Deformitäten des Oberkiefers:Lippenspalte:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["Flüssigkeit, die aus dem Ohr abfließt:Otitis:1,2,3:", "Hörverlust:Taubheit:0,2,3:", "ein Klingeln in den Ohren:Tinnitus:0,1,3:", "Schwindel:Morbus Menière:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Getrübtes Sehen:Katarakt:1,2,3:", "Rosa oder rote Farbe im Weiß des Auges:Bindehautentzündung:0,2,3:", "starke Augenschmerzen:Glaukom:0,1,3:", "Schlechte Tiefenwahrnehmung und peripheres Sehen:Amblyopie:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Ein neuer Knoten in der Brust oder Achsel:Brustkrebs:1,2,3:", "Blut im Urin:Prostatakrebs:2,3,4:", "Eine Änderung der Stuhlgewohnheiten:Darmkrebs:1,3,4:", "ein Husten, der nach 2 oder 3 Wochen nicht verschwindet:Lungenkrebs:1,2,4:", "Ein Pigmentnävus, der sich in Farbe oder Größe verändert oder der blutet:Hautkrebs:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Bläuliche Farbe der Haut, Fingernägel und Lippen:Hypoxämie:1,2,3:", "Zucken in Händen, Gesicht und Füßen:Hypokalzämie:0,2,4:", "Häufigeres Wasserlassen und Durst:Hyperkalzämie:0,1:", "Schwächung der Knochen:Hypophosphatämie:0,4:", "Muskelkrämpfe oder Spasmen:Hyperphosphatämie:0,1:"]);
  }

  void addEL(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.el;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Ήπαρ:1,2,3:29.2,45", "στόμα:4,2,9:28.1,81.6", "Οισοφάγος:1,8,5:48.6,58.6", "Μεγάλο έντερο:4,2,6:20.5,21", "Το λεπτό έντερο:8,7,1:52.4,19", "Στομάχι:4,6,7:66,41", "Φάρυγγα:5,2,9:48.6,81", "Χοληδόχος κύστη:6,9,4:31.3,39.6", "Πάγκρεας:2,1,0:50,35.1", "Σκωληκοειδής απόφυση:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Κρανίο:11,8,6:48,97", "Ωμοπλάτη:5,4,3:61.1,80.2", "παϊδάκια:11,7,0:56,74.1", "Σπονδυλική στήλη:8,10,1:45.9,65.2", "Κνήμη:5,9,3:51.4,23.6", "Μηριαίο οστό:4,10,7:54.9,35.5", "Βραχιόνιο οστό:2,7,9:69.1,66.2", "Μετακάρπια οστά:6,0,1:81.3,44.8", "Καρπικά οστά:5,4,2:77.1,48.7", "Ταρσός:4,3,1:49.3,6.9", "Οστά των μετατάρσων:0,3,5:54.2,2.8", "Λεκάνη:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Δελτοειδής μυς:4,1,5:65.3,80.2", "Δικέφαλος βραχιόνιος μυς:5,0,4:67.3,71.5", "Θωρακικός:5,0,4:52.5,76.4", "Τραπεζοειδής μυς:1,5,4:51.4,85.5", "Κοιλιακή εξωτερική λοξή:1,5,0:54.2,65.9", "πρόσθιος κνημιαίος μυς:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Καρδιά:4,2,5:65.3,73", "Αορτή:4,2,5:62.9,77.6", "Νεφρικές φλέβες:0,4,5:57.3,59.1", "Νεφρική αρτηρία:0,5,4:61.5,59.1", "Σφαγιτιδικές φλέβες:0,2,5:60.4,86.1", "Μηριαία φλέβα:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Εγκεφάλου:5,4,3:50.4,96.8", "παρεγκεφαλίδα:5,4,3:56,92.6", "Νωτιαίο μυελό:0,4,3:50.7,86.8", "Σιατικό νεύρο:0,4,5:59.4,37.6", "Κνημιαίο νεύρο:1,5,3:61.1,19.4", "γάγγλιο:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Χείλη:1,2,4:61.4,96.6", "Σταφυλή:6,2,0:48.6,51.8", "Γομφίος:0,6,1:76.1,33", "Στέλεχος:0,4,1:50.4,83", "Γλώσσα:7,2,0:48.2,27.6", "Αμυγδαλές:4,0,6:69.5,46.8", "Σκληρός ουρανίσκο:1,2,0:48.6,73.8", "Μαλακό ουρανίσκο:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Μετωπικός λοβός:1,2,4:25,58.5", "Χρονικός λοβός:0,2,3:51.2,42.2", "Παριαγόνος λοβός:0,1,3:66,69", "Πτυσσόμενο λοβό:0,1,2:91,46", "Η παρεγκεφαλίδα:1,2,0:72.8,26.1", "Εγκεφαλικό στέλεχος:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Πτερύγιο ωτός:1,2,4:8,31", "Κανάλι αυτιών:0,2,6:33.5,42.1", "Ακουστικό αυτί:1,5,6:55.6,42", "οστάρια:1,0,6:54.3,52.9", "κοχλίας:6,1,5:75.8,45.7", "Ακουστικό νεύρο:6,2,1:91.8,48", "Ευσταχιανός σωλήνας:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Αορτά:8,6,3:51.7,84.7", "Ανώτερος κοίλης φλέβας:6,7,4:27.3,92", "Κατώτερη κοίλη φλέβα:1,4,3:27.8,6.8", "Δεξικός κόλπος:4,7,0:31,54.4", "Αίθριο αριστερά:7,6,0:59.6,55.5", "Μιτροειδής βαλβίδα:8,2,0:69.5,43.7", "Δεξιά κοιλία:0,1,3:47.8,38.9", "Αριστερής κοιλίας:1,8,3:58.1,43", "Τρικυκλική βαλβίδα:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Ίρις:6,3,4:11.3,57", "κερατοειδής χιτώνας:2,6,4:1.7,50.5", "Φακός:1,4,6:19,51.3", "Ρετίνα:1,6,4:64.6,76.8", "Οπτικό νεύρο:0,6,3:87.9,36.2", "Πρόσθιος θάλαμος του βολβού:6,4,3:7.2,51.4", "υαλώδες σώμα:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Κυτταρικός πυρήνας:5,3,2:57.3,75.5", "Πυρηνίσκος:2,6,4:44.5,67.9,8", "Κυτόπλασμα:1,4,6:93.08,50.09,9", "Κυτταρική μεμβράνη:2,5,1:90,24,14", "Ριβόσωμα:2,1,3:80.929,75.844,14", "Μιτοχόνδριο:1,2,3:51.4,90.35,18", "Ενδοπλασματικό πρόγραμμα:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Οξυγόνο:1,2,4:74.5,29,25", "Άνθρακας:2,0,4:74.5,57,25", "Υδρογόνο:1,0,5:74.5,73.2,25", "Άζωτο:1,0,2:74.5,83.5,25", "Ασβέστιο:0,1,2:74.5,91.2,25", "Φώσφορος:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Ποιο όργανο παράγει τη χολή που είναι απαραίτητη για την πέψη;:0,7,6,8", "Ποιο είναι το πρώτο τμήμα του πεπτικού σωλήνα που δέχεται τροφή και παράγει σάλιο;:1,2,6,5", "Από ποιο όργανο περνά η τροφή από τον φάρυγγα στο στομάχι;:2,6,9,7", "Ποιο όργανο είναι το τελευταίο μέρος του πεπτικού συστήματος;:3,4,7,8", "Πού γίνεται η μεγαλύτερη απορρόφηση θρεπτικών συστατικών και μετάλλων από τα τρόφιμα;:4,5,3,0", "Ποιο όργανο εκκρίνει πεπτικά ένζυμα και γαστρικό οξύ για να βοηθήσει στην πέψη των τροφών;:5,4,7,3", "Πώς ονομάζεται το τμήμα του λαιμού πίσω από το στόμα και τη ρινική κοιλότητα;:6,2,9,8", "Πού αποθηκεύεται και συγκεντρώνεται η χολή πριν απελευθερωθεί στο λεπτό έντερο;:7,6,9,8", "Από πού εκκρίνεται η ινσουλίνη;:8,0,7,6", "Ποιο όργανο βρίσκεται κάτω δεξιά στην κοιλιά;:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Τι είναι η οστική δομή που σχηματίζει το κεφάλι;:0,1,9,7", "Τι είναι γνωστό και ως οστό του ώμου;:1,9,11,6", "Τι είναι μια ημιάκαμπτη οστική και χόνδρινη δομή που περιβάλλει τη θωρακική κοιλότητα;:2,7,8,11", "Ποιο είναι το καθοριστικό χαρακτηριστικό ενός σπονδυλωτού;:3,0,11,2", "Ποιο είναι το μεγαλύτερο από τα δύο οστά στο πόδι κάτω από το γόνατο;:4,6,9,5", "Ποιο είναι το πιο μακρύ και δυνατό οστό στο σώμα σας;:5,6,9,1", "Τι είναι ένα μακρύ οστό στο χέρι που εκτείνεται από τον ώμο μέχρι τον αγκώνα;:6,5,1,7", "Τι είναι μια ομάδα πέντε οστών του χεριού μεταξύ των φάλαγγων και του καρπού;:7,5,1,3", "Ποια οστά αποτελούν τον καρπό;:8,7,9,10", "Τι είναι ένα σύμπλεγμα επτά οστών που αρθρώνουν σε κάθε πόδι;:9,7,8,1", "Τι είναι μια ομάδα πέντε μακριών οστών στο πόδι;:10,8,7,4", "Ποιο είναι το κάτω μέρος του κορμού;:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Ποιος είναι ο μυς που σχηματίζει το στρογγυλεμένο περίγραμμα του ανθρώπινου ώμου;:0,1,3,5", "Τι είναι ένας μεγάλος μυς που βρίσκεται στο μπροστινό μέρος του άνω βραχίονα μεταξύ του ώμου και του αγκώνα;:1,0,2,3", "Ποιος μυς βρίσκεται στο στήθος του ανθρώπινου σώματος;:2,3,5,1", "Τι είναι ένας τριγωνικός μυς που βρίσκεται στην οπίσθια όψη του λαιμού;:3,1,2,5", "Ποιος μυς είναι ο μεγαλύτερος από τους πλάγιους κοιλιακούς μυς;:4,1,2,0", "Ποιος είναι ο μεγαλύτερος από τους 4 μύες στο πρόσθιο διαμέρισμα του ποδιού;:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Τι είναι ένα μυϊκό όργανο που αντλεί αίμα μέσω των αιμοφόρων αγγείων του κυκλοφορικού συστήματος;:0,1,3,5", "Ποια είναι η κύρια και μεγαλύτερη αρτηρία στο ανθρώπινο σώμα;:1,4,3,2", "Ποιες είναι οι φλέβες που παροχετεύουν το νεφρό;:2,5,4,1", "Ποιες είναι οι ζευγαρωμένες αρτηρίες που τροφοδοτούν τα νεφρά με αίμα;:3,2,1,5", "Ποιες είναι οι φλέβες που μεταφέρουν το αποξυγονωμένο αίμα από το κεφάλι πίσω στην καρδιά;:4,2,5,1", "Τι είναι μια μεγάλη φλέβα που βρίσκεται βαθιά μέσα στον μηρό;:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Τι είναι ένα όργανο που χρησιμεύει ως το κέντρο του νευρικού συστήματος;:0,1,2,5", "Ποιο είναι το κύριο χαρακτηριστικό του οπίσθιου εγκεφάλου όλων των σπονδυλωτών;:1,5,0,2", "Τι είναι μια μακριά, λεπτή, σωληνοειδής δομή που αποτελείται από νευρικό ιστό;:2,1,3,4", "Τι είναι ένα μεγάλο νεύρο που τρέχει κατά μήκος της άρθρωσης του ισχίου;:3,2,1,5", "Τι είναι ένας κλάδος του ισχιακού νεύρου;:4,5,2,1", "Τι είναι μια ομάδα σωμάτων κυττάρων νευρώνων στο περιφερικό νευρικό σύστημα;:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Ποιες είναι οι μυϊκές πτυχές που περιβάλλουν το στόμα;:0,1,4,7", "Τι είναι μια σαρκώδης προέκταση που κρέμεται πάνω από το λαιμό;:1,4,0,7", "Τι είναι τα επίπεδα δόντια στο πίσω μέρος του στόματος;:2,3,5,6", "Τι είναι τα μπροστινά δόντια;:3,2,5,6", "Τι είναι ένα μυϊκό όργανο στο στόμα;:4,5,6,1", "Ποια όργανα παίζουν σημαντικό ρόλο στο ανοσοποιητικό σύστημα;:5,1,4,0", "Τι είναι μια λεπτή οριζόντια οστέινη πλάκα που αποτελείται από δύο οστά του σκελετού του προσώπου;:6,7,2,5", "Τι είναι ο μαλακός ιστός που αποτελεί το πίσω μέρος της οροφής του στόματος;:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Ποιος είναι ο μεγαλύτερος από τους τέσσερις κύριους λοβούς του εγκεφάλου;:0,3,1,4", "Τι κάθεται πίσω από τα αυτιά και είναι ο δεύτερος μεγαλύτερος λοβός;:1,0,3,2", "Τι εμπλέκεται στην αντίληψη της αίσθησης, συμπεριλαμβανομένης της αφής, της θερμοκρασίας, του πόνου;:2,0,3,5", "Τι είναι το οπτικό κέντρο επεξεργασίας του εγκεφάλου;:3,0,1,4", "Τι παίζει σημαντικό ρόλο στον έλεγχο της ισορροπίας;:4,5,0,1", "Τι βοηθά στον έλεγχο του καρδιακού ρυθμού και του ρυθμού της αναπνοής;:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Ποιο είναι το ορατό μέρος του αυτιού που βρίσκεται έξω από το κεφάλι;:0,3,6,2", "Τι είναι ένα μονοπάτι που εκτείνεται από το εξωτερικό αυτί στο μέσο αυτί;:1,2,3,0", "Τι είναι ένα λεπτό πτερύγιο δέρματος που τεντώνεται σφιχτά σαν τύμπανο και δονείται όταν το χτυπάει ο ήχος;:2,0,5,3", "Ποια είναι τα τρία οστά στο μέσο αυτί που είναι από τα μικρότερα οστά του ανθρώπινου σώματος;:3,0,6,2", "Τι μοιάζει με το κέλυφος ενός σαλιγκαριού;:4,2,0,6", "Τι μεταφέρει τις ακουστικές αισθητηριακές πληροφορίες από τον κοχλία του έσω αυτιού απευθείας στον εγκέφαλο;:5,2,0,6", "Τι είναι επίσης γνωστό ως ακουστικός σωλήνας;:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Ποια είναι η κύρια και μεγαλύτερη αρτηρία στο ανθρώπινο σώμα;:0,3,8,6", "Ποια φλέβα μεταφέρει αίμα από το κεφάλι, το λαιμό, τα χέρια και το στήθος πίσω στην καρδιά σας;:1,3,0,2", "Ποια φλέβα μεταφέρει το αίμα από το κάτω μέρος του σώματός σας πίσω στην καρδιά σας;:2,1,0,3", "Ποιος είναι ο άνω θάλαμος μέσω του οποίου το αίμα εισέρχεται στις κοιλίες της καρδιάς;:3,5,6,2", "ποιος καρδιακός θάλαμος λαμβάνει οξυγονωμένο αίμα από τους πνεύμονες;:4,3,6,8", "Ποια βαλβίδα χωρίζει τους δύο θαλάμους της αριστερής πλευράς της καρδιάς;:5,8,7,3", "Τι είναι ο μυϊκός θάλαμος που αντλεί αίμα από την καρδιά και στο κυκλοφορικό σύστημα;:6,5,8,2", "Ποιος είναι ένας από τους τέσσερις θαλάμους της καρδιάς;:7,0,1,2", "Ο ρόλος του είναι να εμποδίζει την επιστροφή του αίματος από τη δεξιά κοιλία στον δεξιό κόλπο.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Τι είναι μια λεπτή δομή στο μάτι, υπεύθυνη για τον έλεγχο της διαμέτρου και του μεγέθους της κόρης;:0,1,3,2", "Ποιο είναι το διαφανές μπροστινό μέρος του ματιού που καλύπτει την ίριδα;:1,2,3,0", "Τι είναι μια διαφανής δομή στο μάτι που βοηθά στη διάθλαση του φωτός για να εστιαστεί στον αμφιβληστροειδή;:2,3,0,1", "Ποιο είναι το πιο εσωτερικό, ευαίσθητο στο φως στρώμα ιστού του ματιού;:3,1,0,2", "Τι μεταδίδει οπτικές πληροφορίες από τον αμφιβληστροειδή στον εγκέφαλο;:4,6,5,3", "Ποιο είναι το μπροστινό μέρος του ματιού μεταξύ του κερατοειδούς και της ίριδας;:5,6,2,3", "Ποιος οφθαλμικός θάλαμος βρίσκεται πίσω από τον φακό και μπροστά από το οπτικό νεύρο;:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Τι βρίσκεται στη μέση του κυττάρου και περιέχει DNA διατεταγμένο σε χρωμοσώματα;:0,1,2,3", "Ποια περιοχή μέσα στο κύτταρο ασχολείται με την παραγωγή των κυτταρικών ριβοσωμάτων;:1,2,3,4", "Τι είναι ένα ζελατινώδες υγρό που γεμίζει το εσωτερικό ενός κυττάρου;:2,3,4,5", "Τι προστατεύει το κύτταρο από το εξωτερικό του περιβάλλον;:3,4,2,1", "Τι είναι μια κυτταρική δομή που παράγει πρωτεΐνη;:4,3,2,1", "Τι μετατρέπει τη χημική ενέργεια σε μια μορφή ενέργειας που μπορεί να χρησιμοποιήσει το κύτταρο;:5,4,3,2", "Ποιο είναι το σύστημα μεταφοράς του ευκαρυωτικού κυττάρου;:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Τι χρησιμοποιείται για να οξειδώσει το φαγητό μας, στη διαδικασία της κυτταρικής αναπνοής, απελευθερώνοντας έτσι ενέργεια;:0,1,2,3", "Ποιο είναι το δεύτερο πιο άφθονο στοιχείο στο ανθρώπινο σώμα;:1,2,3,4", "Τι χρησιμοποιείται για να κρατήσει το ανθρώπινο σώμα ενυδατωμένο;:2,3,4,5", "Τι χρησιμοποιείται για την παραγωγή αμινοξέων στο σώμα μας, τα οποία με τη σειρά τους παράγουν πρωτεΐνες;:3,5,4", "Τι χρησιμοποιείται για την κατασκευή και διατήρηση γερών οστών;:4,0,1,2", "Τι χρησιμοποιείται στο σχηματισμό οστών και δοντιών;:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Τι είναι μια ασθένεια κατά την οποία το συκώτι σας φλεγμονώνεται;:Ηπατίτιδα::", "Τι είναι μια ασθένεια κατά την οποία ένα παράσιτο προσβάλλει τη γαστρεντερική οδό του ανθρώπου;:Εντερικά παράσιτα::", "Τι είναι μια ασθένεια κατά την οποία το πάγκρεας σας φλεγμονώνεται;:Παγκρεατίτιδα::", "Τι είναι μια ασθένεια που προκαλεί σπάσιμο στην εσωτερική επένδυση του στομάχου;:Γαστρικό έλκος::", "Τι είναι μια ασθένεια στην οποία η σκωληκοειδής απόφυση σας φλεγμονή;:Σκωληκοειδίτιδα::", "Τι είναι μια ασθένεια κατά την οποία η εσωτερική επένδυση του στομάχου σας φλεγμονή;:Γαστρίτιδα::", "Ποια ασθένεια προκαλεί πρησμένες φλέβες στο κάτω ορθό σας;:Αιμορροϊδές::", "Τι είναι τα σκληρά κοιτάσματα από ορυκτά και άλατα;:Πέτρες στα νεφρά::", "Τι είναι η ουλή του ήπατος που προκαλείται από μακροχρόνια ηπατική βλάβη;:Κίρρωση::", "Τι είναι ένας τύπος φλεγμονώδους νόσου του εντέρου;:η νόσος του Κρον::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Ποια ασθένεια προκαλεί πόνο και φλεγμονή σε μια άρθρωση;:Αρθρίτιδα::", "Τι είναι το σπάσιμο της συνέχειας ενός οστού;:Κάταγμα οστού::", "Ποια ασθένεια αποδυναμώνει τα οστά, καθιστώντας τα εύθραυστα και πιο πιθανό να σπάσουν;:Οστεοπόρωση::", "Ποια ασθένεια προκαλεί πλάγια καμπυλότητα της σπονδυλικής στήλης;:Σκολίωση::", "Ποιος είναι ένας τύπος αρθρίτιδας που προκαλεί ξαφνικό, έντονο πόνο στις αρθρώσεις;:Αρθρίτιδα::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Ποια ασθένεια προκαλεί προοδευτική αδυναμία και απώλεια μυϊκής μάζας;:μυική δυστροφία::", "Ποια ασθένεια προκαλείται από την έλλειψη σωματικής δραστηριότητας;:μυϊκή ατροφία::", "Ποια ασθένεια προκαλεί τη φλεγμονή ή τον ερεθισμό ενός τένοντα;:τενοντίτιδα::", "Τι είναι μια ξαφνική και ακούσια σύσπαση ενός από τους μυς σας;:μυϊκές κράμπες::", "Τι συμβαίνει όταν ο μυς σας είναι υπερβολικά τεντωμένος ή σχισμένος;:ρήξη μυών::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Τι είναι ένας τύπος καρκίνου που ξεκινά από κύτταρα που αποτελούν μέρος του ανοσοποιητικού συστήματος του σώματος;:Λέμφωμα::", "Τι είναι ένας τύπος καρκίνου που συνήθως ξεκινά από τον μυελό των οστών;:Λευχαιμία::", "Τι προκαλείται από την παρατεταμένη έκθεση σε πολύ χαμηλές θερμοκρασίες;:Υποθερμία::", "Τι είναι η σκλήρυνση των αρτηριών σας που προκαλείται από τη σταδιακή συσσώρευση πλάκας;:Αθηροσκλήρωση::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Τι είναι η οξεία φλεγμονή των προστατευτικών μεμβρανών που καλύπτουν τον εγκέφαλο και το νωτιαίο μυελό;:Μηνιγγίτιδα::", "Ποια είναι μια ασθένεια που μπορεί να επηρεάσει τον εγκέφαλο και το νωτιαίο μυελό σας και μπορεί να προκαλέσει προβλήματα με την όραση, την ισορροπία, τον έλεγχο των μυών;:Σκλήρυνση κατά πλάκας::", "Τι είναι μια διαταραχή του εγκεφάλου που οδηγεί σε τρέμουλο, δυσκαμψία και δυσκολία στο περπάτημα, την ισορροπία και τον συντονισμό;:Νόσος Πάρκινσον::", "Τι χαρακτηρίζεται από τικ πολλαπλών κινήσεων και τουλάχιστον ένα φωνητικό τικ;:Σύνδρομο Τουρέτ::", "Τι είναι μια ανίατη, κληρονομική διαταραχή του εγκεφάλου που βλάπτει τα εγκεφαλικά κύτταρα;:Νόσος του Χάντινγκτον::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Τι είναι μια σοβαρή μόλυνση των ούλων που καταστρέφει τον μαλακό ιστό και που μπορεί να καταστρέψει το οστό που στηρίζει τα δόντια σας;:Περιοδοντίτιδα::", "Ποια είναι η ήπια μορφή ασθένειας των ούλων που προκαλεί ερεθισμό, ερυθρότητα και πρήξιμο των ούλων σας;:ουλίτιδα::", "Ποιες είναι οι μόνιμα κατεστραμμένες περιοχές στη σκληρή επιφάνεια των δοντιών σας;:Φθορά των δοντιών::", "Τι είναι μια μόλυνση των αμυγδαλών στο πίσω μέρος του λαιμού σας;:Αμυγδαλίτιδα::", "Τι συμβαίνει εάν ο ιστός που αποτελεί το χείλος δεν ενωθεί εντελώς πριν τη γέννηση;:Λαγόχειλο::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Ποια διαταραχή του εγκεφάλου καταστρέφει τη μνήμη και τις δεξιότητες σκέψης και, τελικά, την ικανότητα να εκτελείς τις πιο απλές εργασίες;:Η ασθένεια Αλτσχάϊμερ::", "Ποια είναι μια ασυνήθιστη αλλά σοβαρή πάθηση κατά την οποία ο εγκέφαλος γίνεται φλεγμονή;:Εγκεφαλίτιδα::", "Τι είναι μια διαταραχή πονοκεφάλου που χαρακτηρίζεται από επαναλαμβανόμενους πονοκεφάλους που είναι μέτριοι έως σοβαροί;:Ημικρανία::", "Τι είναι μια ασθένεια που επηρεάζει τον εγκέφαλο και προκαλεί συχνές κρίσεις;:Επιληψία::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Τι συμβαίνει όταν ένας ιός ή ένα βακτήριο προκαλούν φλεγμονή στην περιοχή πίσω από το τύμπανο;:Ωτίτιδα::", "Τι αναφέρεται στην ολική ή μερική αδυναμία ακρόασης ήχων;:Κώφωση::", "Ποια είναι η κατάσταση κατά την οποία ακούτε ήχους όταν δεν υπάρχει εξωτερική πηγή των ήχων;:Εμβοές::", "Τι είναι μια διαταραχή του εσωτερικού αυτιού που μπορεί να οδηγήσει σε ζαλάδες (ίλιγγο) και απώλεια ακοής;:Νόσος Meniere::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Τι είναι ο πόνος στο στήθος που προκαλείται από τη μειωμένη ροή αίματος στους καρδιακούς μυς;:Στηθάγχη::", "Τι είναι η αρτηριακή πίεση που είναι υψηλότερη από το κανονικό;:Υπέρταση::", "Τι συμβαίνει όταν η ροή του αίματος μειώνεται ή σταματά στη στεφανιαία αρτηρία της καρδιάς;:Εμφραγμα μυοκαρδίου::", "Ποια είναι μια σοβαρή κατάσταση κατά την οποία η καρδιά δεν αντλεί αίμα τόσο αποτελεσματικά όσο θα έπρεπε;:Συμφορητική καρδιακή ανεπάρκεια::", "Ποια είναι η λέξη για τα υψηλά επίπεδα χοληστερόλης στο αίμα;:Υπερχοληστερολαιμία::", "Τι είναι η ανωμαλία του καρδιακού ρυθμού;:Αρρυθμία::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Τι είναι μια θολή περιοχή στον φακό του ματιού που οδηγεί σε μείωση της όρασης;:Καταρράκτης::", "Τι είναι μια πάθηση των ματιών που προκαλείται από μόλυνση ή αλλεργίες;:Επιπεφυκίτιδα::", "Τι είναι μια πάθηση των ματιών όπου το οπτικό νεύρο, που συνδέει το μάτι με τον εγκέφαλο, καταστρέφεται;:Γλαυκώμα::", "Τι είναι μια διαταραχή της όρασης κατά την οποία ο εγκέφαλος αποτυγχάνει να επεξεργαστεί πλήρως τις εισροές από το ένα μάτι και με την πάροδο του χρόνου ευνοεί το άλλο μάτι;:Αμβλυωπία::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Τι είναι ένας τύπος καρκίνου που μπορεί να περιλαμβάνει ένα εξόγκωμα στο στήθος ή μια αλλαγή στο σχήμα του μαστού;:Καρκίνος του μαστού::", "Ποιος είναι ο πιο κοινός τύπος καρκίνου που προσβάλλει μόνο άνδρες;:Καρκίνος του προστάτη::", "Τι είναι ένας τύπος καρκίνου στον οποίο τα κύτταρα του παχέος εντέρου ή του ορθού αναπτύσσονται ανεξέλεγκτα;:Καρκίνος παχέος εντέρου::", "Ποιος τύπος καρκίνου προκαλείται από το μακροχρόνιο κάπνισμα;:Καρκίνος του πνεύμονα::", "Ποιος τύπος καρκίνου προκαλείται από την υπερβολική έκθεση στις υπεριώδεις ακτίνες του ήλιου;:Καρκίνος του δέρματος::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Πώς ονομάζεται ένα χαμηλότερο από το φυσιολογικό επίπεδο οξυγόνου στο αίμα σας, συγκεκριμένα στις αρτηρίες;:Υποξαιμία::", "Πώς ονομάζεται ένα χαμηλότερο από το φυσιολογικό επίπεδο ασβεστίου στο αίμα σας;:Υπασβεστιαιμία::", "Πώς ονομάζεται το επίπεδο ασβεστίου στο αίμα σας πάνω από το φυσιολογικό;:Υπερασβεστιαιμία::", "Πώς ονομάζεται ένα χαμηλότερο από το φυσιολογικό επίπεδο φωσφορικών στο αίμα σας;:υποφωσφαταιμία::", "Πώς ονομάζεται ένα υψηλότερο από το φυσιολογικό επίπεδο φωσφορικών αλάτων στο αίμα σας;:Υπερφωσφαταιμία::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Κιτρίνισμα του δέρματος και του λευκού των ματιών σας:Ηπατίτιδα:3,4,5:", "Εξάνθημα ή κνησμός γύρω από το ορθό:Εντερικά παράσιτα:2,7,8:", "Μέτριος έως σοβαρός πόνος στην κοιλιά που μπορεί να εξαπλωθεί στην πλάτη σας:Παγκρεατίτιδα:1,3,4:", "Έντονος πόνος στο στομάχι:Γαστρικό έλκος:6,7,8:", "Ξαφνικός πόνος που ξεκινά στη δεξιά πλευρά της κάτω κοιλιάς:Σκωληκοειδίτιδα:0,3,7:", "Ναυτία ή επαναλαμβανόμενες στομαχικές διαταραχές:Γαστρίτιδα:4,2,1:", "Έντονη φαγούρα γύρω από τον πρωκτό:Αιμορροϊδές:0,2,3:", "Πόνος ή αίσθημα καύσου κατά την ούρηση:Πέτρες στα νεφρά:3,9,1:", "Κιτρίνισμα του δέρματος και του λευκού των ματιών σας:Κίρρωση:7,5,4:", "Αίμα στα κόπρανα:η νόσος του Κρον:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["πόνος στις αρθρώσεις:Αρθρίτιδα:1,2,3:", "άμεσος, έντονος πόνος:Κάταγμα οστού:2,3:", "Απώλεια ύψους με την πάροδο του χρόνου:Οστεοπόρωση:1,3,4:", "μια εμφανώς κυρτή σπονδυλική στήλη:Σκολίωση:0,1,2:", "κόκκινο, λαμπερό δέρμα πάνω από την προσβεβλημένη άρθρωση:Αρθρίτιδα:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Μεγάλοι μύες της γάμπας:μυική δυστροφία:2,3,4:", "Το ένα χέρι ή το ένα πόδι είναι μικρότερο από το άλλο:μυϊκή ατροφία:2,3,4:", "πόνος σε έναν τένοντα που επιδεινώνεται όταν κινείστε:τενοντίτιδα:1,3,4:", "Ένας ξαφνικός, οξύς πόνος:μυϊκές κράμπες:1,2:", "ξαφνικός πόνος που επιδεινώνεται κατά τη σύσπαση του μυ:ρήξη μυών:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Ανώδυνο πρήξιμο των λεμφαδένων στο λαιμό, τις μασχάλες ή τη βουβωνική χώρα:Λέμφωμα:2,3:", "Διογκωμένοι λεμφαδένες, διευρυμένο ήπαρ ή σπλήνα:Λευχαιμία:2,3:", "Τουρτούρισμα:Υποθερμία:0,1:", "Μούδιασμα ή αδυναμία στα χέρια ή τα πόδια σας:Αθηροσκλήρωση:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Ξαφνικός υψηλός πυρετός, έντονος πονοκέφαλος που φαίνεται διαφορετικός από τον κανονικό:Μηνιγγίτιδα:1,2,3:", "τύφλωση στο ένα μάτι:Σκλήρυνση κατά πλάκας:0,3,4:", "Τρόμος στα χέρια:Νόσος Πάρκινσον:0,3,4:", "κινητικά τικ:Σύνδρομο Τουρέτ:0,1,4:", "δυσκολία συγκέντρωσης και κενά μνήμης:Νόσος του Χάντινγκτον:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Κόκκινα ή πρησμένα ούλα:Περιοδοντίτιδα:2,3,4:", "Κόκκινα ή πρησμένα ούλα:ουλίτιδα:2,3,4:", "Πονόδοντος:Φθορά των δοντιών:0,4,3:", "προβλήματα κατάποσης:Αμυγδαλίτιδα:0,2,4:", "Παραμορφώσεις της άνω γνάθου:Λαγόχειλο:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["υγρό που παροχετεύεται από το αυτί:Ωτίτιδα:1,2,3:", "Απώλεια ακοής:Κώφωση:0,2,3:", "ένα βουητό στα αυτιά:Εμβοές:0,1,3:", "ίλιγγος:Νόσος Meniere:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Συννεφιασμένη όραση:Καταρράκτης:1,2,3:", "Ροζ ή κόκκινο χρώμα στο λευκό του ματιού:Επιπεφυκίτιδα:0,2,3:", "έντονος πόνος στα μάτια:Γλαυκώμα:0,1,3:", "Κακή αντίληψη βάθους και περιφερειακή όραση:Αμβλυωπία:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Ένα νέο εξόγκωμα στο στήθος ή στη μασχάλη:Καρκίνος του μαστού:1,2,3:", "Αίμα στα ούρα:Καρκίνος του προστάτη:2,3,4:", "Αλλαγή στις συνήθειες του εντέρου:Καρκίνος παχέος εντέρου:1,3,4:", "βήχας που δεν υποχωρεί μετά από 2 ή 3 εβδομάδες:Καρκίνος του πνεύμονα:1,2,4:", "Ένας σπίλος που αλλάζει χρώμα, μέγεθος ή που αιμορραγεί:Καρκίνος του δέρματος:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Μπλε χρώμα στο δέρμα, τα νύχια και τα χείλη:Υποξαιμία:1,2,3:", "Συσπάσεις στα χέρια, το πρόσωπο και τα πόδια σας:Υπασβεστιαιμία:0,2,4:", "Πιο συχνή ούρηση και δίψα:Υπερασβεστιαιμία:0,1:", "αποδυνάμωση των οστών:υποφωσφαταιμία:0,4:", "μυϊκές κράμπες ή σπασμοί:Υπερφωσφαταιμία:0,1:"]);
  }

  void addEN(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.en;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Liver:1,2,3:29.2,45", "Mouth:4,2,9:28.1,81.6", "Esophagus:1,8,5:48.6,58.6", "Large intestine:4,2,6:20.5,21", "Small intestine:8,7,1:52.4,19", "Stomach:4,6,7:66,41", "Pharynx:5,2,9:48.6,81", "Gallbladder:6,9,4:31.3,39.6", "Pancreas:2,1,0:50,35.1", "Appendix:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Skull:11,8,6:48,97", "Scapula:5,4,3:61.1,80.2", "Rib cage:11,7,0:56,74.1", "Spine:8,10,1:45.9,65.2", "Tibia:5,9,3:51.4,23.6", "Femur:4,10,7:54.9,35.5", "Humerus:2,7,9:69.1,66.2", "Metacarpal bones:6,0,1:81.3,44.8", "Carpal bones:5,4,2:77.1,48.7", "Tarsus:4,3,1:49.3,6.9", "Metatarsal bones:0,3,5:54.2,2.8", "Pelvis:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltoid:4,1,5:65.3,80.2", "Biceps:5,0,4:67.3,71.5", "Pectoral:5,0,4:52.5,76.4", "Trapezius:1,5,4:51.4,85.5", "Abdominal external oblique:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Heart:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Renal veins:0,4,5:57.3,59.1", "Renal artery:0,5,4:61.5,59.1", "Jugular veins:0,2,5:60.4,86.1", "Femoral vein:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Brain:5,4,3:50.4,96.8", "Cerebellum:5,4,3:56,92.6", "Spinal cord:0,4,3:50.7,86.8", "Sciatic nerve:0,4,5:59.4,37.6", "Tibial nerve:1,5,3:61.1,19.4", "Ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Lips:1,2,4:61.4,96.6", "Uvula:6,2,0:48.6,51.8", "Molars:0,6,1:76.1,33", "Incisor:0,4,1:50.4,83", "Tongue:7,2,0:48.2,27.6", "Tonsil:4,0,6:69.5,46.8", "Hard palate:1,2,0:48.6,73.8", "Soft palate:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Frontal lobe:1,2,4:25,58.5", "Temporal lobe:0,2,3:51.2,42.2", "Parietal lobe:0,1,3:66,69", "Occipital lobe:0,1,2:91,46", "Cerebellum:1,2,0:72.8,26.1", "Brainstem:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Auricle:1,2,4:8,31", "Ear canal:0,2,6:33.5,42.1", "Eardrum:1,5,6:55.6,42", "Ossicles:1,0,6:54.3,52.9", "Cochlea:6,1,5:75.8,45.7", "Auditory nerve:6,2,1:91.8,48", "Eustachian tube:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Superior vena cava:6,7,4:27.3,92", "Inferior vena cava:1,4,3:27.8,6.8", "Right atrium:4,7,0:31,54.4", "Left atrium:7,6,0:59.6,55.5", "Mitral valve:8,2,0:69.5,43.7", "Right ventricle:0,1,3:47.8,38.9", "Left ventricle:1,8,3:58.1,43", "Tricuspid valve:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "Cornea:2,6,4:1.7,50.5", "Lens:1,4,6:19,51.3", "Retina:1,6,4:64.6,76.8", "Optic nerve:0,6,3:87.9,36.2", "Anterior chamber:6,4,3:7.2,51.4", "Vitreous chamber:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Nucleus:5,3,2:57.3,75.5", "Nucleolus:2,6,4:44.5,67.9,8", "Cytoplasm:1,4,6:93.08,50.09,9", "Cell membrane:2,5,1:90,24,14", "Ribosome:2,1,3:80.929,75.844,14", "Mitochondrion:1,2,3:51.4,90.35,18", "Endoplasmic reticulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oxygen:1,2,4:74.5,29,25", "Carbon:2,0,4:74.5,57,25", "Hydrogen:1,0,5:74.5,73.2,25", "Nitrogen:1,0,2:74.5,83.5,25", "Calcium:0,1,2:74.5,91.2,25", "Phosphorus:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["What organ produces bile necessary for digestion?:0,7,6,8", "What is the first portion of the alimentary canal that receives food and produces saliva?:1,2,6,5", "Through which organ food passes from the pharynx to the stomach?:2,6,9,7", "What organ is the last part of the digestive system?:3,4,7,8", "Where does the most absorption of nutrients and minerals from food take place?:4,5,3,0", "What organ secretes digestive enzymes and gastric acid to aid in food digestion?:5,4,7,3", "What is the part of the throat behind the mouth and nasal cavity named?:6,2,9,8", "Where is bile stored and concentrated before it is released into the small intestine?:7,6,9,8", "Where is insulin secreted from?:8,0,7,6", "What organ is located in the lower right abdomen?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["What is a bone structure that forms the head?:0,1,9,7", "What is known also as the shoulder bone?:1,9,11,6", "What is a semi-rigid bony and cartilaginous structure which surrounds the thoracic cavity?:2,7,8,11", "What is the defining characteristic of a vertebrate?:3,0,11,2", "What is the larger of the two bones in the leg below the knee?:4,6,9,5", "What is the longest and strongest bone in your body?:5,6,9,1", "What is a long bone in the arm that runs from the shoulder to the elbow?:6,5,1,7", "What is a group of five bones of the hand between the phalanges and the wrist?:7,5,1,3", "What bones make up the wrist?:8,7,9,10", "What is a cluster of seven articulating bones in each foot?:9,7,8,1", "What is a group of five long bones in the foot?:10,8,7,4", "What is the lower part of the torso?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["What is the muscle forming the rounded contour of the human shoulder?:0,1,3,5", "What is a large muscle that lies on the front of the upper arm between the shoulder and the elbow?:1,0,2,3", "What muscle is situated at the chest of the human body?:2,3,5,1", "What is a triangular muscle located on the posterior aspect of the neck?:3,1,2,5", "What muscle is the largest of the lateral abdominal muscles?:4,1,2,0", "What is the largest of 4 muscles in the anterior compartment of the leg?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["What is a muscular organ which pumps blood through the blood vessels of the circulatory system?:0,1,3,5", "What is the main and largest artery in the human body?:1,4,3,2", "What are veins that drain the kidney?:2,5,4,1", "What are paired arteries that supply the kidneys with blood?:3,2,1,5", "What are veins that take deoxygenated blood from the head back to the heart?:4,2,5,1", "What is a large vein located deep within the thigh?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["What is an organ that serves as the center of the nervous system?:0,1,2,5", "What is a major feature of the hindbrain of all vertebrates?:1,5,0,2", "What is a long, thin, tubular structure made up of nervous tissue?:2,1,3,4", "What is a large nerve that runs alongside the hip joint?:3,2,1,5", "What is a branch of the sciatic nerve?:4,5,2,1", "What is a group of neuron cell bodies in the peripheral nervous system?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["What are muscular folds that encircle the mouth?:0,1,4,7", "What is a fleshy extension which hangs above the throat?:1,4,0,7", "What are flat teeth at the back of the mouth?:2,3,5,6", "What are the front teeth?:3,2,5,6", "What is a muscular organ in the mouth?:4,5,6,1", "What organs play an important role in the immune system?:5,1,4,0", "What is a thin horizontal bony plate made up of two bones of the facial skeleton?:6,7,2,5", "What is the soft tissue constituting the back of the roof of the mouth?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["What is the largest of the four major lobes of the brain?:0,3,1,4", "What sits behind the ears and is the second largest lobe?:1,0,3,2", "What is involved in the perception of sensation, including touch, temperature, pain?:2,0,3,5", "What is the visual processing center of the brain?:3,0,1,4", "What plays an important role in balance control?:4,5,0,1", "What helps to control heart rate and breathing rate?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["What is the visible part of the ear that is outside the head?:0,3,6,2", "What is a pathway running from the outer ear to the middle ear?:1,2,3,0", "What is a thin flap of skin that is stretched tight like a drum and vibrates when sound hits it?:2,0,5,3", "What are three bones in the middle ear that are among the smallest bones in the human body?:3,0,6,2", "What resembles to the shell of a snail?:4,2,0,6", "What carries auditory sensory information from the cochlea of the inner ear directly to the brain?:5,2,0,6", "What is also known as the auditory tube?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["What is the main and largest artery in the human body?:0,3,8,6", "Which vein carries blood from your head, neck, arms and chest back to your heart?:1,3,0,2", "Which vein carries blood from your lower body back to your heart?:2,1,0,3", "What is the upper chamber through which blood enters the ventricles of the heart?:3,5,6,2", "what heart chamber receives oxygenated blood from the lungs?:4,3,6,8", "What valve separates the two chambers of the left side of the heart?:5,8,7,3", "What is muscular chamber that pumps blood out of the heart and into the circulatory system?:6,5,8,2", "Which is one of four chambers of the heart?:7,0,1,2", "It's role is to prevent back flow of blood from the right ventricle into the right atrium.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["What is a thin structure in the eye, responsible for controlling the diameter and size of the pupil?:0,1,3,2", "What is the transparent front part of the eye that covers the iris?:1,2,3,0", "What is a transparent structure in the eye that helps to refract light to be focused on the retina?:2,3,0,1", "What is the innermost, light-sensitive layer of tissue of the eye?:3,1,0,2", "What transmits visual information from the retina to the brain?:4,6,5,3", "What is the front part of the eye between the cornea and the iris?:5,6,2,3", "What eye chamber is located behind the lens and in front of the optic nerve?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["What is found in the middle of the cell and it contains DNA arranged in chromosomes?:0,1,2,3", "What region within the cell is concerned with producing the cell ribosomes?:1,2,3,4", "What is a gelatinous liquid that fills the inside of a cell?:2,3,4,5", "What protects the cell from its external environment?:3,4,2,1", "What is a cell structure that produces protein?:4,3,2,1", "What converts chemical energy into an energy form that the cell can use?:5,4,3,2", "What is the transportation system of the eukaryotic cell?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["What is used to oxidize our food, in the process of cellular respiration, thus releasing energy?:0,1,2,3", "What is the second most abundant element in the human body?:1,2,3,4", "What is used to keep the human body hydrated?:2,3,4,5", "What is used to make amino acids in our body which in turn make proteins?:3,5,4", "What is used to build and maintain strong bones?:4,0,1,2", "What is used in the formation of bones and teeth?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["What is a disease in which your liver becomes inflamed?:Hepatitis::", "What is a disease in which a parasite infects the gastro-intestinal tract of humans?:Intestinal parasites::", "What is a disease in which your pancreas becomes inflamed?:Pancreatitis::", "What is a disease that causes a break in the inner lining of the stomach?:Gastric ulcer::", "What is a disease in which your appendix becomes inflamed?:Appendicitis::", "What is a disease in which your inner lining of the stomach becomes inflamed?:Gastritis::", "What disease causes swollen veins in your lower rectum?:Hemorrhoids::", "What are hard deposits made of minerals and salts?:Kidney stones::", "What is scarring of the liver caused by long-term liver damage?:Cirrhosis::", "What is a type of inflammatory bowel disease?:Crohn's disease::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["What disease causes pain and inflammation in a joint?:Arthritis::", "What is a break in the continuity of a bone?:Bone fracture::", "What disease weakens bones, making them fragile and more likely to break?:Osteoporosis::", "What disease causes a sideways curvature of the spine?:Scoliosis::", "What is a type of arthritis that causes sudden, severe joint pain?:Gout::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["What disease causes progressive weakness and loss of muscle mass?:muscular dystrophy::", "What disease is caused by lack of physical activity?:muscular atrophy::", "What disease causes the inflammation or irritation of a tendon?:tendinitis::", "What is a sudden and involuntary contraction of one of your muscles?:muscular cramps::", "What occurs when your muscle is overstretched or torn?:muscle rupture::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["What is a type of cancer that starts in cells that are part of the body's immune system?:Lymphoma::", "What is a type of cancer that usually begins in the bone marrow?:Leukemia::", "What is caused by prolonged exposures to very cold temperatures?:Hypothermia::", "What is a hardening of your arteries caused by gradual plaque buildup?:Atherosclerosis::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["What is an acute inflammation of the protective membranes covering the brain and spinal cord?:Meningitis::", "What is a disease that can affect your brain and spinal cord, and can cause problems with vision, balance, muscle control?:Multiple sclerosis::", "What is a brain disorder that leads to shaking, stiffness, and difficulty with walking, balance, and coordination?:Parkinson's disease::", "What is characterized by multiple movement tics and at least one vocal tic?:Tourette syndrome::", "What is an incurable, hereditary brain disorder that damages brain cells?:Huntington's disease::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["What is a serious gum infection that damages the soft tissue and that can destroy the bone that supports your teeth?:Periodontitis::", "What is a mild form of gum disease that causes irritation, redness and swelling of your gingiva?:gingivitis::", "What are permanently damaged areas in the hard surface of your teeth?:Tooth decay::", "What is an infection of the tonsils at the back of your throat?:Tonsillitis::", "What happens if the tissue that makes up the lip does not join completely before birth?:Cleft lip::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["What brain disorder destroys memory and thinking skills and, eventually, the ability to carry out the simplest tasks?:Alzheimer's disease::", "What is an uncommon but serious condition in which the brain becomes inflamed?:Encephalitis::", "What is a headache disorder characterized by recurrent headaches that are moderate to severe?:Migraine::", "What is a disease that affects the brain and causes frequent seizures?:Epilepsy::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["What occurs when a virus or bacteria cause the area behind the eardrum to become inflamed?:Otitis‎::", "What refers to the total or partial inability to hear sounds?:Deafness::", "What is a condition in which you hear sounds when there is no outside source of the sounds?:Tinnitus::", "What is a disorder of the inner ear that can lead to dizzy spells (vertigo) and hearing loss?:Meniere's disease::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["What is a chest pain caused by reduced blood flow to the heart muscles?:Angina::", "What is blood pressure that is higher than normal?:Hypertension::", "What occurs when blood flow decreases or stops to the coronary artery of the heart?:Myocardial infarction::", "What is a serious condition in which the heart doesn't pump blood as efficiently as it should?:Congestive heart failure::", "What is a word for high levels of cholesterol in the blood?:Hypercholesterolemia::", "What is an abnormality of the heart's rhythm?:Arrhythmia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["What is a cloudy area in the lens of the eye that leads to a decrease in vision?:Cataract::", "What is an eye condition caused by infection or allergies?:Conjunctivitis::", "What is an eye condition where the optic nerve, which connects the eye to the brain, becomes damaged?:Glaucoma::", "What is a disorder of sight in which the brain fails to fully process inputs from one eye and over time favors the other eye?:Amblyopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["What is a type of cancer that may include a lump in the breast or a change in breast shape?:Breast cancer::", "What is the most common type of cancer that affects only men?:Prostate cancer::", "What is a type of cancer in which cells in the colon or rectum grow out of control?:Colorectal cancer::", "What type of cancer is caused by long-term tobacco smoking?:Lung cancer::", "What type of cancer is caused by overexposure to ultraviolet rays from the sun?:Skin cancer::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["What is a below-normal level of oxygen in your blood called, specifically in the arteries?:Hypoxemia::", "What is a below-normal level of calcium in your blood called?:Hypocalcemia::", "What is an above-normal level of calcium in your blood called?:Hypercalcemia::", "What is a below-normal level of phosphate in your blood called?:hypophosphatemia::", "What is an above-normal level of phosphate in your blood called?:Hyperphosphatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Yellowing of the skin and the whites of your eyes:Hepatitis:3,4,5:", "Rash or itching around the rectum:Intestinal parasites:2,7,8:", "Moderate to severe abdominal pain that may spread to your back:Pancreatitis:1,3,4:", "Severe stomach pain:Gastric ulcer:6,7,8:", "Sudden pain that begins on the right side of the lower abdomen:Appendicitis:0,3,7:", "Nausea or recurrent upset stomach:Gastritis:4,2,1:", "Extreme itching around the anus:Hemorrhoids:0,2,3:", "Pain or burning sensation while urinating:Kidney stones:3,9,1:", "Yellowing of the skin and the whites of your eyes:Cirrhosis:7,5,4:", "Blood in the stool:Crohn's disease:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["joint pain:Arthritis:1,2,3:", "immediate, severe pain:Bone fracture:2,3:", "Loss of height over time:Osteoporosis:1,3,4:", "a visibly curved spine:Scoliosis:0,1,2:", "red, shiny skin over the affected joint:Gout:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Large calf muscles:muscular dystrophy:2,3,4:", "One arm or one leg is smaller than the other:muscular atrophy:2,3,4:", "pain in a tendon that gets worse when you move:tendinitis:1,3,4:", "A sudden, sharp pain:muscular cramps:1,2:", "sudden pain that worsens while contracting the muscle:muscle rupture:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Painless swelling of lymph nodes in your neck, armpits or groin:Lymphoma:2,3:", "Swollen lymph nodes, enlarged liver or spleen:Leukemia:2,3:", "Shivering:Hypothermia:0,1:", "Numbness or weakness in your arms or legs:Atherosclerosis:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Sudden high fever, severe headache that seems different from normal:Meningitis:1,2,3:", "blindness in one eye:Multiple sclerosis:0,3,4:", "Tremor in hands:Parkinson's disease:0,3,4:", "movement tics:Tourette syndrome:0,1,4:", "difficulty concentrating and memory lapses:Huntington's disease:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Red or swollen gums:Periodontitis:2,3,4:", "Red or swollen gums:gingivitis:2,3,4:", "Toothache:Tooth decay:0,4,3:", "problems swallowing:Tonsillitis:0,2,4:", "Deformities of the upper jaw:Cleft lip:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["fluid that drains from the ear:Otitis‎:1,2,3:", "Loss of hearing:Deafness:0,2,3:", "a ringing noise in the ears:Tinnitus:0,1,3:", "vertigo:Meniere's disease:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Clouded vision:Cataract:1,2,3:", "Pink or red color in the white of the eye:Conjunctivitis:0,2,3:", "intense eye pain:Glaucoma:0,1,3:", "Poor depth perception and peripheral vision:Amblyopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["A new lump in the breast or underarm:Breast cancer:1,2,3:", "Blood in the urine:Prostate cancer:2,3,4:", "A change in bowel habits:Colorectal cancer:1,3,4:", "a cough that doesn't go away after 2 or 3 weeks:Lung cancer:1,2,4:", "A mole that changes in color, size or that bleeds:Skin cancer:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Bluish color in skin, fingernails, and lips:Hypoxemia:1,2,3:", "Twitching in your hands, face, and feet:Hypocalcemia:0,2,4:", "More frequent urination and thirst:Hypercalcemia:0,1:", "weakening of bones:hypophosphatemia:0,4:", "muscle cramps or spasms:Hyperphosphatemia:0,1:"]);
  }

  void addES(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.es;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Hígado:1,2,3:29.2,45", "Boca:4,2,9:28.1,81.6", "Esófago:1,8,5:48.6,58.6", "Intestino grueso:4,2,6:20.5,21", "Intestino delgado:8,7,1:52.4,19", "Estómago:4,6,7:66,41", "Faringe:5,2,9:48.6,81", "Vesícula biliar:6,9,4:31.3,39.6", "Páncreas:2,1,0:50,35.1", "Apéndice:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Cráneo:11,8,6:48,97", "Escápula:5,4,3:61.1,80.2", "Costillas:11,7,0:56,74.1", "Columna vertebral:8,10,1:45.9,65.2", "Tibia:5,9,3:51.4,23.6", "Fémur:4,10,7:54.9,35.5", "Húmero:2,7,9:69.1,66.2", "Huesos metacarpianos:6,0,1:81.3,44.8", "Huesos del carpo:5,4,2:77.1,48.7", "Tarso:4,3,1:49.3,6.9", "Huesos metatarsianos:0,3,5:54.2,2.8", "Pelvis:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Músculo deltoides:4,1,5:65.3,80.2", "Bíceps:5,0,4:67.3,71.5", "Músculo pectoral:5,0,4:52.5,76.4", "Trapecio:1,5,4:51.4,85.5", "Músculo oblicuo externo del abdomen:1,5,0:54.2,65.9", "Músculo tibial anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Corazón:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Venas renales:0,4,5:57.3,59.1", "Arteria renal:0,5,4:61.5,59.1", "Vena yugular:0,2,5:60.4,86.1", "Vena femoral:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Cerebro:5,4,3:50.4,96.8", "Cerebelo:5,4,3:56,92.6", "Médula espinal:0,4,3:50.7,86.8", "Nervio ciático:0,4,5:59.4,37.6", "Nervio tibial:1,5,3:61.1,19.4", "Ganglio:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Labios:1,2,4:61.4,96.6", "Úvula:6,2,0:48.6,51.8", "Molares:0,6,1:76.1,33", "Incisivo:0,4,1:50.4,83", "Lengua:7,2,0:48.2,27.6", "Amígdalas:4,0,6:69.5,46.8", "Paladar duro:1,2,0:48.6,73.8", "Paladar blando:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Lóbulo frontal:1,2,4:25,58.5", "Lóbulo temporal:0,2,3:51.2,42.2", "Lóbulo parietal:0,1,3:66,69", "Lóbulo occipital:0,1,2:91,46", "Cerebelo:1,2,0:72.8,26.1", "Tronco encefálico:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Pabellón auricular:1,2,4:8,31", "Canal auditivo:0,2,6:33.5,42.1", "Tímpano:1,5,6:55.6,42", "Osículos:1,0,6:54.3,52.9", "Cóclea:6,1,5:75.8,45.7", "Nervio auditivo:6,2,1:91.8,48", "trompa de Eustaquio:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "vena cava superior:6,7,4:27.3,92", "vena cava inferior:1,4,3:27.8,6.8", "Aurícula derecha:4,7,0:31,54.4", "Aurícula izquierda:7,6,0:59.6,55.5", "Válvula mitral:8,2,0:69.5,43.7", "Ventrículo derecho:0,1,3:47.8,38.9", "Ventrículo izquierdo:1,8,3:58.1,43", "Válvula tricúspide:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "Córnea:2,6,4:1.7,50.5", "cristalino:1,4,6:19,51.3", "Retina:1,6,4:64.6,76.8", "Nervio óptico:0,6,3:87.9,36.2", "Cámara anterior:6,4,3:7.2,51.4", "Humor vítreo:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Núcleo:5,3,2:57.3,75.5", "Nucléolo:2,6,4:44.5,67.9,8", "Citoplasma:1,4,6:93.08,50.09,9", "Membrana celular:2,5,1:90,24,14", "Ribosoma:2,1,3:80.929,75.844,14", "Mitocondria:1,2,3:51.4,90.35,18", "Retículo endoplásmico:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oxígeno:1,2,4:74.5,29,25", "Carbono:2,0,4:74.5,57,25", "Hidrógeno:1,0,5:74.5,73.2,25", "Nitrógeno:1,0,2:74.5,83.5,25", "Calcio:0,1,2:74.5,91.2,25", "Fósforo:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["¿Qué órgano produce la bilis necesaria para la digestión?:0,7,6,8", "¿Cuál es la primera porción del tubo digestivo que recibe alimento y produce saliva?:1,2,6,5", "¿A través de qué órgano pasa el alimento de la faringe al estómago?:2,6,9,7", "¿Qué órgano es la última parte del sistema digestivo?:3,4,7,8", "¿Dónde tiene lugar la mayor absorción de nutrientes y minerales de los alimentos?:4,5,3,0", "¿Qué órgano secreta enzimas digestivas y ácido gástrico para ayudar en la digestión de los alimentos?:5,4,7,3", "¿Cómo se llama la parte de la garganta detrás de la boca y la cavidad nasal?:6,2,9,8", "¿Dónde se almacena y concentra la bilis antes de que se libere en el intestino delgado?:7,6,9,8", "¿De dónde se secreta la insulina?:8,0,7,6", "¿Qué órgano se encuentra en la parte inferior derecha del abdomen?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["¿Qué es una estructura ósea que forma la cabeza?:0,1,9,7", "¿Qué se conoce también como el hueso del hombro?:1,9,11,6", "¿Qué es una estructura ósea y cartilaginosa semirrígida que rodea la cavidad torácica?:2,7,8,11", "¿Cuál es la característica que define a un vertebrado?:3,0,11,2", "¿Cuál es el mayor de los dos huesos de la pierna debajo de la rodilla?:4,6,9,5", "¿Cuál es el hueso más largo y fuerte de tu cuerpo?:5,6,9,1", "¿Qué es un hueso largo en el brazo que va desde el hombro hasta el codo?:6,5,1,7", "¿Qué es un grupo de cinco huesos de la mano entre las falanges y la muñeca?:7,5,1,3", "¿Qué huesos forman la muñeca?:8,7,9,10", "¿Qué es un grupo de siete huesos articulados en cada pie?:9,7,8,1", "¿Qué es un grupo de cinco huesos largos en el pie?:10,8,7,4", "¿Cuál es la parte inferior del torso?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["¿Cuál es el músculo que forma el contorno redondeado del hombro humano?:0,1,3,5", "¿Qué es un músculo grande que se encuentra en la parte delantera de la parte superior del brazo entre el hombro y el codo?:1,0,2,3", "¿Qué músculo se encuentra en el pecho del cuerpo humano?:2,3,5,1", "¿Qué es un músculo triangular ubicado en la cara posterior del cuello?:3,1,2,5", "¿Qué músculo es el más grande de los músculos abdominales laterales?:4,1,2,0", "¿Cuál es el mayor de los 4 músculos del compartimiento anterior de la pierna?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["¿Qué es un órgano muscular que bombea sangre a través de los vasos sanguíneos del sistema circulatorio?:0,1,3,5", "¿Cuál es la arteria principal y más grande del cuerpo humano?:1,4,3,2", "¿Cuáles son las venas que drenan el riñón?:2,5,4,1", "¿Cuáles son las arterias pares que suministran sangre a los riñones?:3,2,1,5", "¿Cuáles son las venas que llevan sangre desoxigenada de la cabeza al corazón?:4,2,5,1", "¿Qué es una vena grande ubicada en lo profundo del muslo?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["¿Qué es un órgano que sirve como el centro del sistema nervioso?:0,1,2,5", "¿Cuál es una característica importante del rombencéfalo de todos los vertebrados?:1,5,0,2", "¿Qué es una estructura tubular larga y delgada formada por tejido nervioso?:2,1,3,4", "¿Qué es un nervio grande que corre a lo largo de la articulación de la cadera?:3,2,1,5", "¿Qué es una rama del nervio ciático?:4,5,2,1", "¿Qué es un grupo de cuerpos celulares de neuronas en el sistema nervioso periférico?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["¿Qué son los pliegues musculares que rodean la boca?:0,1,4,7", "¿Qué es una extensión carnosa que cuelga sobre la garganta?:1,4,0,7", "¿Qué son los dientes planos en la parte posterior de la boca?:2,3,5,6", "¿Qué son los dientes frontales?:3,2,5,6", "¿Qué es un órgano muscular en la boca?:4,5,6,1", "¿Qué órganos juegan un papel importante en el sistema inmunológico?:5,1,4,0", "¿Qué es una placa ósea horizontal delgada formada por dos huesos del esqueleto facial?:6,7,2,5", "¿Cuál es el tejido blando que constituye la parte posterior del techo de la boca?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["¿Cuál es el mayor de los cuatro lóbulos principales del cerebro?:0,3,1,4", "¿Qué se encuentra detrás de las orejas y es el segundo lóbulo más grande?:1,0,3,2", "¿Qué está involucrado en la percepción de la sensación, incluyendo el tacto, la temperatura, el dolor?:2,0,3,5", "¿Cuál es el centro de procesamiento visual del cerebro?:3,0,1,4", "¿Qué juega un papel importante en el control del equilibrio?:4,5,0,1", "¿Qué ayuda a controlar la frecuencia cardíaca y la frecuencia respiratoria?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["¿Cuál es la parte visible de la oreja que está fuera de la cabeza?:0,3,6,2", "¿Qué es un camino que va desde el oído externo hasta el oído medio?:1,2,3,0", "¿Qué es un delgado colgajo de piel que se tensa como un tambor y vibra cuando el sonido lo golpea?:2,0,5,3", "¿Cuáles son los tres huesos del oído medio que se encuentran entre los huesos más pequeños del cuerpo humano?:3,0,6,2", "¿Qué se parece a la concha de un caracol?:4,2,0,6", "¿Qué transporta la información sensorial auditiva desde la cóclea del oído interno directamente al cerebro?:5,2,0,6", "¿Qué es también conocido como el tubo auditivo?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["¿Cuál es la arteria principal y más grande del cuerpo humano?:0,3,8,6", "¿Qué vena lleva la sangre desde la cabeza, el cuello, los brazos y el pecho hasta el corazón?:1,3,0,2", "¿Qué vena lleva la sangre desde la parte inferior de su cuerpo de regreso a su corazón?:2,1,0,3", "¿Cuál es la cámara superior por donde entra la sangre a los ventrículos del corazón?:3,5,6,2", "¿Qué cámara del corazón recibe sangre oxigenada de los pulmones?:4,3,6,8", "¿Qué válvula separa las dos cámaras del lado izquierdo del corazón?:5,8,7,3", "¿Cuál es la cámara muscular que bombea la sangre desde el corazón hacia el sistema circulatorio?:6,5,8,2", "¿Cuál es una de las cuatro cámaras del corazón?:7,0,1,2", "Su función es evitar el reflujo de sangre desde el ventrículo derecho hacia la aurícula derecha.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["¿Qué es una estructura delgada en el ojo, responsable de controlar el diámetro y el tamaño de la pupila?:0,1,3,2", "¿Qué es la parte frontal transparente del ojo que cubre el iris?:1,2,3,0", "¿Qué es una estructura transparente en el ojo que ayuda a refractar la luz para enfocarla en la retina?:2,3,0,1", "¿Cuál es la capa de tejido del ojo más interna, sensible a la luz?:3,1,0,2", "¿Qué transmite la información visual de la retina al cerebro?:4,6,5,3", "¿Cuál es la parte frontal del ojo entre la córnea y el iris?:5,6,2,3", "¿Qué cámara ocular se encuentra detrás del cristalino y delante del nervio óptico?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["¿Qué se encuentra en el medio de la célula y contiene ADN dispuesto en cromosomas?:0,1,2,3", "¿Qué región dentro de la célula se ocupa de producir los ribosomas celulares?:1,2,3,4", "¿Qué es un líquido gelatinoso que llena el interior de una célula?:2,3,4,5", "¿Qué protege a la célula de su entorno externo?:3,4,2,1", "¿Qué es una estructura celular que produce proteínas?:4,3,2,1", "¿Qué convierte la energía química en una forma de energía que la célula puede utilizar?:5,4,3,2", "¿Cuál es el sistema de transporte de la célula eucariota?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["¿Qué se utiliza para oxidar nuestros alimentos, en el proceso de respiración celular, liberando así energía?:0,1,2,3", "¿Cuál es el segundo elemento más abundante en el cuerpo humano?:1,2,3,4", "¿Qué se utiliza para mantener el cuerpo humano hidratado?:2,3,4,5", "¿Qué se usa para producir aminoácidos en nuestro cuerpo que a su vez produce proteínas?:3,5,4", "¿Qué se usa para construir y mantener huesos fuertes?:4,0,1,2", "¿Qué se utiliza en la formación de huesos y dientes?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["¿Qué es una enfermedad en la que el hígado se inflama?:Hepatitis::", "¿Qué es una enfermedad en la que un parásito infecta el tracto gastrointestinal de los humanos?:Parásitos intestinales::", "¿Qué es una enfermedad en la que se inflama el páncreas?:pancreatitis::", "¿Qué es una enfermedad que causa una ruptura en el revestimiento interno del estómago?:Úlcera gástrica::", "¿Qué es una enfermedad en la que su apéndice se inflama?:Apendicitis::", "¿Qué es una enfermedad en la que se inflama el revestimiento interno del estómago?:Gastritis::", "¿Qué enfermedad causa la inflamación de las venas en la parte inferior del recto?:Hemorroides::", "¿Qué son los depósitos duros hechos de minerales y sales?:Cálculos renales::", "¿Qué es la cicatrización del hígado causada por daño hepático a largo plazo?:Cirrosis::", "¿Qué es un tipo de enfermedad inflamatoria intestinal?:enfermedad de Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["¿Qué enfermedad causa dolor e inflamación en una articulación?:Artritis::", "¿Qué es una ruptura en la continuidad de un hueso?:Fractura de hueso::", "¿Qué enfermedad debilita los huesos, haciéndolos frágiles y más propensos a romperse?:Osteoporosis::", "¿Qué enfermedad causa una curvatura lateral de la columna?:Escoliosis::", "¿Cuál es un tipo de artritis que causa dolor articular intenso y repentino?:Gota::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["¿Qué enfermedad causa debilidad progresiva y pérdida de masa muscular?:distrofia muscular::", "¿Qué enfermedad se produce por la falta de actividad física?:atrofia muscular::", "¿Qué enfermedad causa la inflamación o irritación de un tendón?:tendinitis::", "¿Qué es una contracción repentina e involuntaria de uno de sus músculos?:calambres musculares::", "¿Qué ocurre cuando su músculo está demasiado estirado o desgarrado?:ruptura muscular::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["¿Qué es un tipo de cáncer que comienza en las células que forman parte del sistema inmunitario del cuerpo?:linfoma::", "¿Qué es un tipo de cáncer que generalmente comienza en la médula ósea?:Leucemia::", "¿Qué es causado por exposiciones prolongadas a temperaturas muy frías?:Hipotermia::", "¿Qué es un endurecimiento de las arterias causado por la acumulación gradual de placa?:aterosclerosis::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["¿Qué es una inflamación aguda de las membranas protectoras que recubren el cerebro y la médula espinal?:Meningitis::", "¿Qué es una enfermedad que puede afectar el cerebro y la médula espinal y puede causar problemas con la visión, el equilibrio y el control muscular?:Esclerosis múltiple::", "¿Qué es un trastorno cerebral que provoca temblores, rigidez y dificultad para caminar, mantener el equilibrio y la coordinación?:enfermedad de Parkinson::", "¿Qué se caracteriza por los tics de múltiples movimientos y al menos un tic vocal?:Síndrome de Tourette::", "¿Qué es un trastorno cerebral hereditario incurable que daña las células cerebrales?:enfermedad de Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["¿Qué es una infección grave de las encías que daña el tejido blando y puede destruir el hueso que sostiene los dientes?:periodontitis::", "¿Qué es una forma leve de enfermedad de las encías que causa irritación, enrojecimiento e hinchazón de la encía?:gingivitis::", "¿Cuáles son las áreas permanentemente dañadas en la superficie dura de los dientes?:Caries dental::", "¿Qué es una infección de las amígdalas en la parte posterior de la garganta?:Amigdalitis::", "¿Qué sucede si el tejido que conforma el labio no se une por completo antes del nacimiento?:Labio leporino::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["¿Qué trastorno cerebral destruye la memoria y las habilidades de pensamiento y, eventualmente, la capacidad de realizar las tareas más simples?:enfermedad de alzheimer::", "¿Qué es una afección poco común pero grave en la que el cerebro se inflama?:Encefalitis::", "¿Qué es un trastorno de dolor de cabeza caracterizado por dolores de cabeza recurrentes que son moderados a severos?:Migraña::", "¿Qué es una enfermedad que afecta el cerebro y causa convulsiones frecuentes?:Epilepsia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["¿Qué ocurre cuando un virus o una bacteria hacen que el área detrás del tímpano se inflame?:Otitis‎::", "¿Qué se refiere a la incapacidad total o parcial para oír sonidos?:Sordera::", "¿Cuál es una condición en la que escuchas sonidos cuando no hay una fuente externa de los sonidos?:Tinnitus::", "¿Qué es un trastorno del oído interno que puede provocar mareos (vértigo) y pérdida de la audición?:La enfermedad de Meniere::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["¿Qué es un dolor de pecho causado por la reducción del flujo de sangre a los músculos del corazón?:Angina de pecho::", "¿Qué es la presión arterial que es más alta de lo normal?:Hipertensión::", "¿Qué ocurre cuando el flujo sanguíneo disminuye o se detiene en la arteria coronaria del corazón?:Infarto de miocardio::", "¿Qué es una afección grave en la que el corazón no bombea sangre tan eficientemente como debería?:Insuficiencia cardíaca congestiva::", "¿Cuál es una palabra para altos niveles de colesterol en la sangre?:Hipercolesterolemia::", "¿Qué es una anomalía del ritmo cardíaco?:Arritmia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["¿Qué es un área nublada en el cristalino del ojo que conduce a una disminución de la visión?:Catarata::", "¿Qué es una afección ocular causada por una infección o alergias?:Conjuntivitis::", "¿Qué es una afección ocular en la que el nervio óptico, que conecta el ojo con el cerebro, se daña?:Glaucoma::", "¿Qué es un trastorno de la vista en el que el cerebro no procesa completamente las entradas de un ojo y con el tiempo favorece al otro ojo?:Ambliopía::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["¿Qué tipo de cáncer puede incluir un bulto en el seno o un cambio en la forma del seno?:Cáncer de mama::", "¿Cuál es el tipo de cáncer más común que afecta solo a los hombres?:Cancer de prostata::", "¿Qué es un tipo de cáncer en el que las células del colon o del recto crecen sin control?:Cáncer colonrectal::", "¿Qué tipo de cáncer es causado por fumar tabaco a largo plazo?:Cáncer de pulmón::", "¿Qué tipo de cáncer es causado por la sobreexposición a los rayos ultravioleta del sol?:Cáncer de piel::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["¿Cómo se llama un nivel de oxígeno en la sangre por debajo de lo normal, específicamente en las arterias?:hipoxemia::", "¿Cómo se llama un nivel de calcio por debajo de lo normal en la sangre?:Hipocalcemia::", "¿Cómo se llama un nivel de calcio en la sangre por encima de lo normal?:hipercalcemia::", "¿Cómo se llama un nivel de fosfato por debajo de lo normal en la sangre?:hipofosfatemia::", "¿Cómo se llama un nivel de fosfato en la sangre por encima de lo normal?:hiperfosfatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Coloración amarillenta de la piel y el blanco de los ojos:Hepatitis:3,4,5:", "Sarpullido o picazón alrededor del recto:Parásitos intestinales:2,7,8:", "Dolor abdominal de moderado a intenso que puede extenderse a la espalda:pancreatitis:1,3,4:", "Dolor de estómago severo:Úlcera gástrica:6,7,8:", "Dolor repentino que comienza en el lado derecho de la parte inferior del abdomen:Apendicitis:0,3,7:", "Náuseas o malestar estomacal recurrente:Gastritis:4,2,1:", "Picazón extrema alrededor del ano:Hemorroides:0,2,3:", "Dolor o sensación de ardor al orinar:Cálculos renales:3,9,1:", "Coloración amarillenta de la piel y el blanco de los ojos:Cirrosis:7,5,4:", "Sangre en las heces:enfermedad de Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["dolor en las articulaciones:Artritis:1,2,3:", "dolor intenso e inmediato:Fractura de hueso:2,3:", "Pérdida de altura con el tiempo.:Osteoporosis:1,3,4:", "una columna vertebral visiblemente curvada:Escoliosis:0,1,2:", "piel roja y brillante sobre la articulación afectada:Gota:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Grandes músculos de la pantorrilla:distrofia muscular:2,3,4:", "Un brazo o una pierna es más pequeño que el otro:atrofia muscular:2,3,4:", "dolor en un tendón que empeora cuando se mueve:tendinitis:1,3,4:", "Un dolor repentino y agudo:calambres musculares:1,2:", "dolor repentino que empeora al contraer el músculo:ruptura muscular:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Inflamación indolora de los ganglios linfáticos en el cuello, las axilas o la ingle:linfoma:2,3:", "Ganglios linfáticos inflamados, hígado o bazo agrandados:Leucemia:2,3:", "temblando:Hipotermia:0,1:", "Entumecimiento o debilidad en los brazos o las piernas:aterosclerosis:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Fiebre alta repentina, dolor de cabeza intenso que parece diferente de lo normal:Meningitis:1,2,3:", "ceguera en un ojo:Esclerosis múltiple:0,3,4:", "Temblor en las manos:enfermedad de Parkinson:0,3,4:", "tics de movimiento:Síndrome de Tourette:0,1,4:", "dificultad para concentrarse y lapsos de memoria:enfermedad de Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Encías rojas o hinchadas:periodontitis:2,3,4:", "Encías rojas o hinchadas:gingivitis:2,3,4:", "Dolor de muelas:Caries dental:0,4,3:", "problemas para tragar:Amigdalitis:0,2,4:", "Deformidades de la mandíbula superior:Labio leporino:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["líquido que drena del oído:Otitis‎:1,2,3:", "Pérdida de la audición:Sordera:0,2,3:", "un zumbido en los oídos:Tinnitus:0,1,3:", "vértigo:La enfermedad de Meniere:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["visión nublada:Catarata:1,2,3:", "Color rosado o rojo en el blanco del ojo.:Conjuntivitis:0,2,3:", "intenso dolor de ojos:Glaucoma:0,1,3:", "Mala percepción de la profundidad y visión periférica.:Ambliopía:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Un bulto nuevo en el seno o la axila:Cáncer de mama:1,2,3:", "Sangre en la orina:Cancer de prostata:2,3,4:", "Un cambio en los hábitos intestinales.:Cáncer colonrectal:1,3,4:", "una tos que no desaparece después de 2 o 3 semanas:Cáncer de pulmón:1,2,4:", "Un lunar que cambia de color, de tamaño o que sangra:Cáncer de piel:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Color azulado en piel, uñas y labios.:hipoxemia:1,2,3:", "Espasmos en las manos, la cara y los pies:Hipocalcemia:0,2,4:", "Micción más frecuente y sed.:hipercalcemia:0,1:", "debilitamiento de los huesos:hipofosfatemia:0,4:", "calambres o espasmos musculares:hiperfosfatemia:0,1:"]);
  }

  void addFI(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.fi;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Maksa:1,2,3:29.2,45", "Suu:4,2,9:28.1,81.6", "Ruokatorven:1,8,5:48.6,58.6", "paksusuoli:4,2,6:20.5,21", "ohutsuole:8,7,1:52.4,19", "Vatsa:4,6,7:66,41", "Nielu:5,2,9:48.6,81", "Sappirakon:6,9,4:31.3,39.6", "haima:2,1,0:50,35.1", "Umpilisäke:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Kallo:11,8,6:48,97", "lapaluun:5,4,3:61.1,80.2", "kylkiluut:11,7,0:56,74.1", "Selkäranka:8,10,1:45.9,65.2", "Sääriluu:5,9,3:51.4,23.6", "Reisi:4,10,7:54.9,35.5", "Olkaluu:2,7,9:69.1,66.2", "Metakarpaaliset luut:6,0,1:81.3,44.8", "Karpaalihakset:5,4,2:77.1,48.7", "Nilkkaluu:4,3,1:49.3,6.9", "Metatarsaaliset luut:0,3,5:54.2,2.8", "Lantio:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Kolmipäinen hartialihas:4,1,5:65.3,80.2", "hauis:5,0,4:67.3,71.5", "Rintakehän lihakset:5,0,4:52.5,76.4", "Epäkäslihas:1,5,4:51.4,85.5", "Ulompi vino vatsalihas:1,5,0:54.2,65.9", "Tibialis etuosa:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Sydän:4,2,5:65.3,73", "Aortta:4,2,5:62.9,77.6", "Munuaislaskimo:0,4,5:57.3,59.1", "Munuaisvaltimo:0,5,4:61.5,59.1", "Kaarevat suonet:0,2,5:60.4,86.1", "reisiluulaskimo:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Aivot:5,4,3:50.4,96.8", "Pikkuaivot:5,4,3:56,92.6", "Selkäydin:0,4,3:50.7,86.8", "Iskiashermo:0,4,5:59.4,37.6", "sääriluun hermo:1,5,3:61.1,19.4", "Hermosolmu:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Huulet:1,2,4:61.4,96.6", "Kitakieleke:6,2,0:48.6,51.8", "Poskihampaat:0,6,1:76.1,33", "Etuhampaat:0,4,1:50.4,83", "Kieli:7,2,0:48.2,27.6", "Nielurisa:4,0,6:69.5,46.8", "kova suulaki:1,2,0:48.6,73.8", "pehmeä suulaki:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["frontaalilohkoon:1,2,4:25,58.5", "temporaalilohkoon:0,2,3:51.2,42.2", "parietaalilohkoon:0,1,3:66,69", "oksipitaalilohkoon:0,1,2:91,46", "Pikkuaivot:1,2,0:72.8,26.1", "Aivorunko:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Korvalehti:1,2,4:8,31", "Korvakanava:0,2,6:33.5,42.1", "Korva rumpu:1,5,6:55.6,42", "Kuuloluut:1,0,6:54.3,52.9", "Simpukka:6,1,5:75.8,45.7", "kuulohermo:6,2,1:91.8,48", "Eustachian putki:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aortta:8,6,3:51.7,84.7", "yläonttolaskimo:6,7,4:27.3,92", "alaonttolaskimo:1,4,3:27.8,6.8", "Oikea eteinen:4,7,0:31,54.4", "vasen eteinen:7,6,0:59.6,55.5", "Mitraaliventtiili:8,2,0:69.5,43.7", "Oikea kammio:0,1,3:47.8,38.9", "Vasen kammio:1,8,3:58.1,43", "Tricuspid-venttiili:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["värikalvo:6,3,4:11.3,57", "Sarveiskalvo:2,6,4:1.7,50.5", "Linssi:1,4,6:19,51.3", "verkkokalvo:1,6,4:64.6,76.8", "Näköhermo:0,6,3:87.9,36.2", "Etukammio:6,4,3:7.2,51.4", "Lasiainen:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Tuma:5,3,2:57.3,75.5", "Tumajyvänen:2,6,4:44.5,67.9,8", "Sytoplasma:1,4,6:93.08,50.09,9", "Solukalvo:2,5,1:90,24,14", "Ribosomi:2,1,3:80.929,75.844,14", "Mitokondrio:1,2,3:51.4,90.35,18", "Endoplasminen verkkokalvo:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Happi:1,2,4:74.5,29,25", "Hiili:2,0,4:74.5,57,25", "Vety:1,0,5:74.5,73.2,25", "Typpi:1,0,2:74.5,83.5,25", "Kalsium:0,1,2:74.5,91.2,25", "Fosfori:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Mikä elin tuottaa ruoansulatukseen tarvittavaa sappia?:0,7,6,8", "Mikä on ensimmäinen osa ruoansulatuskanavasta, joka vastaanottaa ruokaa ja tuottaa sylkeä?:1,2,6,5", "Minkä elimen kautta ruoka kulkee nielusta mahalaukkuun?:2,6,9,7", "Mikä elin on ruoansulatusjärjestelmän viimeinen osa?:3,4,7,8", "Mistä ravintoaineet ja kivennäisaineet imeytyvät ruoasta eniten?:4,5,3,0", "Mikä elin erittää ruoansulatusentsyymejä ja mahahappoa ruoansulatuksen edistämiseksi?:5,4,7,3", "Mikä on suun ja nenäontelon takana oleva kurkun osa nimeltään?:6,2,9,8", "Missä sappi varastoidaan ja konsentroituu ennen kuin se vapautuu ohutsuoleen?:7,6,9,8", "Mistä insuliinia erittyy?:8,0,7,6", "Mikä elin sijaitsee oikeassa alavatsassa?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Mikä on luurakenne, joka muodostaa pään?:0,1,9,7", "Mikä tunnetaan myös olkapään luuna?:1,9,11,6", "Mikä on puolijäykkä luinen ja rustoinen rakenne, joka ympäröi rintaonteloa?:2,7,8,11", "Mikä on selkärankaisen määrittelevä ominaisuus?:3,0,11,2", "Mikä on polven alapuolella olevan jalan kahdesta luusta suurempi?:4,6,9,5", "Mikä on kehosi pisin ja vahvin luu?:5,6,9,1", "Mikä on pitkä luu käsivarressa, joka ulottuu olkapäästä kyynärpäähän?:6,5,1,7", "Mikä on käden viiden luun ryhmä sormien ja ranteen välissä?:7,5,1,3", "Mitkä luut muodostavat ranteen?:8,7,9,10", "Mikä on seitsemän nivellevän luun ryhmä kummassakin jalassa?:9,7,8,1", "Mikä on viiden pitkän luun ryhmä jalassa?:10,8,7,4", "Mikä on vartalon alaosa?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Mikä on lihas, joka muodostaa ihmisen olkapään pyöristetyn muodon?:0,1,3,5", "Mikä on suuri lihas, joka sijaitsee olkavarren etuosassa olkapään ja kyynärpään välissä?:1,0,2,3", "Mikä lihas sijaitsee ihmiskehon rinnassa?:2,3,5,1", "Mikä on kolmiomainen lihas, joka sijaitsee kaulan takaosassa?:3,1,2,5", "Mikä lihas on sivuttaisista vatsalihaksista suurin?:4,1,2,0", "Mikä on suurin jalan etuosan neljästä lihaksesta?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Mikä on lihaksikas elin, joka pumppaa verta verenkiertoelimistön verisuonten läpi?:0,1,3,5", "Mikä on tärkein ja suurin valtimo ihmiskehossa?:1,4,3,2", "Mitkä ovat suonet, jotka tyhjentävät munuaisen?:2,5,4,1", "Mitkä ovat parilliset valtimot, jotka toimittavat munuaisille verta?:3,2,1,5", "Mitkä ovat suonet, jotka vievät happitonta verta päästä takaisin sydämeen?:4,2,5,1", "Mikä on suuri suoni, joka sijaitsee syvällä reidessä?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Mikä on hermoston keskuksena toimiva elin?:0,1,2,5", "Mikä on kaikkien selkärankaisten takaaivojen tärkein ominaisuus?:1,5,0,2", "Mikä on pitkä, ohut, putkimainen rakenne, joka koostuu hermokudoksesta?:2,1,3,4", "Mikä on suuri hermo, joka kulkee lonkkanivelen rinnalla?:3,2,1,5", "Mikä on iskiashermon haara?:4,5,2,1", "Mikä on ryhmä hermosolujen kappaleita ääreishermostossa?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Mitä ovat suua ympäröivät lihaksikkaat poimut?:0,1,4,7", "Mikä on mehevä jatke, joka roikkuu kurkun yläpuolella?:1,4,0,7", "Mitä ovat litteät hampaat suun takaosassa?:2,3,5,6", "Mitkä ovat etuhampaat?:3,2,5,6", "Mikä on lihaksikas elin suussa?:4,5,6,1", "Mitkä elimet ovat tärkeitä immuunijärjestelmässä?:5,1,4,0", "Mikä on ohut vaakasuora luulevy, joka koostuu kahdesta kasvojen luurangosta?:6,7,2,5", "Mikä on pehmytkudos, joka muodostaa suun katon takaosan?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Mikä on suurin aivojen neljästä suuresta lohkosta?:0,3,1,4", "Mikä istuu korvien takana ja on toiseksi suurin lohko?:1,0,3,2", "Mitä aistihavaintoon liittyy, mukaan lukien kosketus, lämpötila, kipu?:2,0,3,5", "Mikä on aivojen visuaalinen käsittelykeskus?:3,0,1,4", "Mikä on tärkeä rooli tasapainonhallinnassa?:4,5,0,1", "Mikä auttaa hallitsemaan sykettä ja hengitystiheyttä?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Mikä on korvan näkyvä osa, joka on pään ulkopuolella?:0,3,6,2", "Mikä on reitti, joka kulkee ulkokorvasta välikorvaan?:1,2,3,0", "Mikä on ohut iholäppä, joka on venytetty tiukalle kuin rumpu ja värisee, kun siihen osuu ääni?:2,0,5,3", "Mitkä ovat kolme keskikorvan luuta, jotka ovat ihmiskehon pienimpiä luita?:3,0,6,2", "Mikä muistuttaa etanan kuorta?:4,2,0,6", "Mikä kuljettaa kuuloaistitietoa sisäkorvan simpukasta suoraan aivoihin?:5,2,0,6", "Mitä kutsutaan myös kuuloputkeksi?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Mikä on tärkein ja suurin valtimo ihmiskehossa?:0,3,8,6", "Mikä laskimo kuljettaa verta päästäsi, kaulastasi, käsivarsistasi ja rinnasta takaisin sydämeesi?:1,3,0,2", "Mikä laskimo kuljettaa verta alavartalostasi takaisin sydämeesi?:2,1,0,3", "Mikä on ylempi kammio, jonka kautta veri tulee sydämen kammioihin?:3,5,6,2", "mikä sydämen kammio vastaanottaa happipitoista verta keuhkoista?:4,3,6,8", "Mikä venttiili erottaa sydämen vasemman puolen kaksi kammiota?:5,8,7,3", "Mikä on lihaskammio, joka pumppaa verta sydämestä ja verenkiertoelimistöön?:6,5,8,2", "Mikä on yksi sydämen neljästä kammiosta?:7,0,1,2", "Sen tehtävänä on estää veren takaisinvirtaus oikeasta kammiosta oikeaan eteiseen.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Mikä on silmän ohut rakenne, joka säätelee pupillin halkaisijaa ja kokoa?:0,1,3,2", "Mikä on silmän läpinäkyvä etuosa, joka peittää iiriksen?:1,2,3,0", "Mikä on läpinäkyvä rakenne silmässä, joka auttaa taittamaan valon keskittyäkseen verkkokalvoon?:2,3,0,1", "Mikä on silmän sisin, valoherkkä kudoskerros?:3,1,0,2", "Mikä välittää visuaalista tietoa verkkokalvolta aivoihin?:4,6,5,3", "Mikä on silmän etuosa sarveiskalvon ja iiriksen välissä?:5,6,2,3", "Mikä silmäkammio sijaitsee linssin takana ja näköhermon edessä?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Mitä löytyy solun keskeltä ja se sisältää DNA:ta kromosomeihin järjestyneenä?:0,1,2,3", "Mikä solun alue liittyy solun ribosomien tuottamiseen?:1,2,3,4", "Mikä on hyytelömäinen neste, joka täyttää solun sisäpuolen?:2,3,4,5", "Mikä suojaa solua sen ulkoiselta ympäristöltä?:3,4,2,1", "Mikä on proteiinia tuottava solurakenne?:4,3,2,1", "Mikä muuntaa kemiallisen energian energiamuodoksi, jota solu voi käyttää?:5,4,3,2", "Mikä on eukaryoottisolun kuljetusjärjestelmä?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Mitä käytetään hapettamaan ruokaamme soluhengitysprosessissa, jolloin vapautuu energiaa?:0,1,2,3", "Mikä on toiseksi runsain alkuaine ihmiskehossa?:1,2,3,4", "Mitä käytetään pitämään ihmiskehon nesteytettynä?:2,3,4,5", "Mitä käytetään aminohappojen tuottamiseen kehossamme, jotka puolestaan ​​muodostavat proteiineja?:3,5,4", "Mitä käytetään vahvojen luiden rakentamiseen ja ylläpitämiseen?:4,0,1,2", "Mitä käytetään luiden ja hampaiden muodostumiseen?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Mikä on sairaus, jossa maksasi tulehtuu?:Hepatiitti::", "Mikä on sairaus, jossa loinen saastuttaa ihmisen maha-suolikanavan?:Suoliston loiset::", "Mikä on sairaus, jossa haimasi tulehtuu?:Haimatulehdus::", "Mikä on sairaus, joka aiheuttaa murtuman mahalaukun sisäkalvossa?:Mahahaava::", "Mikä on sairaus, jossa umpilisäke tulehtuu?:Umpilisäkkeen tulehdus::", "Mikä on sairaus, jossa mahalaukun sisäkalvo tulehtuu?:Gastriitti::", "Mikä sairaus aiheuttaa suonten turvotusta peräsuolen alaosassa?:Peräpukamat::", "Mitä ovat mineraaleista ja suoloista tehdyt kovat kerrostumat?:Munuaiskiviä::", "Mikä on pitkäaikaisen maksavaurion aiheuttama maksan arpeutuminen?:Kirroosi::", "Mikä on tulehduksellinen suolistosairaus?:Crohnin tauti::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Mikä sairaus aiheuttaa kipua ja tulehdusta nivelessä?:Niveltulehdus::", "Mikä on katkeaminen luun jatkuvuudessa?:Luunmurtuma::", "Mikä sairaus heikentää luita tehden niistä hauraita ja todennäköisemmin murtuvia?:Osteoporoosi::", "Mikä sairaus aiheuttaa selkärangan sivuttain kaarevuuden?:Skolioosi::", "Mikä on niveltulehdus, joka aiheuttaa äkillistä, voimakasta nivelkipua?:Kihti::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Mikä sairaus aiheuttaa progressiivista heikkoutta ja lihasmassan menetystä?:lihassurkastumatauti::", "Mikä sairaus johtuu fyysisen toiminnan puutteesta?:lihasatrofia::", "Mikä sairaus aiheuttaa jänteen tulehduksen tai ärsytyksen?:tendiniitti::", "Mikä on jonkin lihaksesi äkillinen ja tahaton supistuminen?:lihaskrampit::", "Mitä tapahtuu, kun lihaksesi on ylijännitetty tai repeytynyt?:lihasten repeämä::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Mikä on eräänlainen syöpä, joka alkaa soluista, jotka ovat osa elimistön immuunijärjestelmää?:Lymfooma::", "Millainen syöpä yleensä alkaa luuytimestä?:Leukemia::", "Mikä johtuu pitkäaikaisesta altistumisesta erittäin kylmille lämpötiloille?:Hypotermia::", "Mikä on valtimoiden kovettuminen, joka johtuu asteittaisesta plakin kertymisestä?:Ateroskleroosi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Mikä on aivojen ja selkäytimen suojaavien kalvojen akuutti tulehdus?:Aivokalvontulehdus::", "Mikä on sairaus, joka voi vaikuttaa aivoihin ja selkäytimeen ja aiheuttaa näköongelmia, tasapainoa ja lihasten hallintaa?:Multippeliskleroosi::", "Mikä on aivosairaus, joka johtaa vapinaan, jäykkyyteen ja kävely-, tasapaino- ja koordinaatiovaikeuksiin?:Parkinsonin tauti::", "Mikä on tunnusomaista useille liike-ticille ja vähintään yhdelle lauluticille?:Touretten syndrooma::", "Mikä on parantumaton, perinnöllinen aivosairaus, joka vahingoittaa aivosoluja?:Huntingtonin tauti::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Mikä on vakava ientulehdus, joka vahingoittaa pehmytkudosta ja voi tuhota hampaita tukevan luun?:Parodontiitti::", "Mikä on lievä iensairauksien muoto, joka aiheuttaa ienen ärsytystä, punoitusta ja turvotusta?:ientulehdus::", "Mitkä ovat pysyvästi vaurioituneet alueet hampaiden kovalla pinnalla?:Hammasmätä::", "Mikä on kurkun takaosassa olevien risojen tulehdus?:Nielurisatulehdus::", "Mitä tapahtuu, jos huulen muodostava kudos ei liity kokonaan yhteen ennen syntymää?:Huulihalkeama::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Mikä aivosairaus tuhoaa muistin ja ajattelutaidot ja lopulta kyvyn suorittaa yksinkertaisia ​​tehtäviä?:Alzheimerin tauti::", "Mikä on harvinainen mutta vakava tila, jossa aivot tulehtuvat?:Enkefaliitti::", "Mikä on päänsäryn häiriö, jolle on ominaista toistuvat keskivaikeat tai vaikeat päänsäryt?:Migreeni::", "Mikä on aivoihin vaikuttava sairaus, joka aiheuttaa toistuvia kohtauksia?:Epilepsia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Mitä tapahtuu, kun virus tai bakteeri aiheuttaa tärykalvon takana olevan alueen tulehduksen?:Otitis::", "Mikä tarkoittaa täydellistä tai osittaista kyvyttömyyttä kuulla ääniä?:Kuurous::", "Mikä on tila, jossa kuulet ääniä, kun ulkopuolista äänilähdettä ei ole?:Tinnitus::", "Mikä on sisäkorvan häiriö, joka voi johtaa huimaukseen (huimaukseen) ja kuulon heikkenemiseen?:Menieren tauti::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Mikä on rintakipu, jonka aiheuttaa sydänlihasten heikentynyt verenkierto?:Angina pectoris::", "Mikä on normaalia korkeampi verenpaine?:Hypertensio::", "Mitä tapahtuu, kun veren virtaus heikkenee tai pysähtyy sydämen sepelvaltimoon?:Sydäninfarkti::", "Mikä on vakava tila, jossa sydän ei pumppaa verta niin tehokkaasti kuin sen pitäisi?:Sydämen vajaatoiminta::", "Mikä sana tarkoittaa korkeaa kolesterolitasoa veressä?:Hyperkolesterolemia::", "Mikä on sydämen rytmihäiriö?:Rytmihäiriö::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Mikä on silmän linssin samea alue, joka johtaa näön heikkenemiseen?:Kaihi::", "Mikä on tulehduksen tai allergian aiheuttama silmäsairaus?:Sidekalvotulehdus::", "Mikä on silmäsairaus, jossa näköhermo, joka yhdistää silmän aivoihin, vaurioituu?:Glaukooma::", "Mikä on näköhäiriö, jossa aivot eivät pysty täysin käsittelemään yhdestä silmästä tulevaa syötettä ja suosivat ajan myötä toista silmää?:Amblyopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Mikä on sellainen syöpä, johon voi liittyä kyhmy rinnassa tai rintojen muodon muutos?:Rintasyöpä::", "Mikä on yleisin syöpä, joka vaikuttaa vain miehiin?:Eturauhassyöpä::", "Mikä on syövän tyyppi, jossa paksu- tai peräsuolen solut kasvavat hallitsemattomasti?:Peräsuolen syöpä::", "Millaisen syövän pitkäaikainen tupakointi aiheuttaa?:Keuhkosyöpä::", "Millaisen syövän aiheuttaa liiallinen altistuminen auringon ultraviolettisäteille?:Ihosyöpä::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Mitä kutsutaan normaalia pienemmiksi happitasoiksi veressäsi, erityisesti valtimoissa?:Hypoksemia::", "Mitä kutsutaan normaalia pienemmiksi veresi kalsiumpitoisuuksiksi?:Hypokalsemia::", "Mitä kutsutaan normaalia korkeammalle kalsiumtasolle veressäsi?:Hyperkalsemia::", "Miksi veresi fosfaattipitoisuus on normaalia pienempi?:hypofosfatemia::", "Mitä kutsutaan normaalia korkeammalle fosfaattipitoisuudelle veressäsi?:Hyperfosfatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Ihon ja silmänvalkuaisten kellastuminen:Hepatiitti:3,4,5:", "Ihottuma tai kutina peräsuolen ympärillä:Suoliston loiset:2,7,8:", "Kohtalainen tai vaikea vatsakipu, joka voi levitä selkään:Haimatulehdus:1,3,4:", "Vaikea vatsakipu:Mahahaava:6,7,8:", "Äkillinen kipu, joka alkaa alavatsan oikealta puolelta:Umpilisäkkeen tulehdus:0,3,7:", "Pahoinvointi tai toistuva vatsavaivat:Gastriitti:4,2,1:", "Äärimmäinen kutina peräaukon ympärillä:Peräpukamat:0,2,3:", "Kipu tai polttava tunne virtsatessa:Munuaiskiviä:3,9,1:", "Ihon ja silmänvalkuaisten kellastuminen:Kirroosi:7,5,4:", "Veri ulosteessa:Crohnin tauti:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["nivelkipu:Niveltulehdus:1,2,3:", "välitön, voimakas kipu:Luunmurtuma:2,3:", "Pituuden menetys ajan myötä:Osteoporoosi:1,3,4:", "näkyvästi kaareva selkäranka:Skolioosi:0,1,2:", "punainen, kiiltävä iho vaurioituneen nivelen päällä:Kihti:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Suuret pohkeen lihakset:lihassurkastumatauti:2,3,4:", "Toinen käsi tai toinen jalka on pienempi kuin toinen:lihasatrofia:2,3,4:", "jännekipu, joka pahenee liikuttaessa:tendiniitti:1,3,4:", "Äkillinen, voimakas kipu:lihaskrampit:1,2:", "äkillinen kipu, joka pahenee lihasten supistumisen aikana:lihasten repeämä:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Kivuton imusolmukkeiden turvotus niskassa, kainaloissa tai nivusissa:Lymfooma:2,3:", "Turvonneet imusolmukkeet, suurentunut maksa tai perna:Leukemia:2,3:", "Vapina:Hypotermia:0,1:", "Tunnottomuus tai heikkous käsissäsi tai jaloissasi:Ateroskleroosi:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Äkillinen korkea kuume, voimakas päänsärky, joka näyttää erilaiselta kuin normaali:Aivokalvontulehdus:1,2,3:", "sokeus toisessa silmässä:Multippeliskleroosi:0,3,4:", "Vapina käsissä:Parkinsonin tauti:0,3,4:", "liike tics:Touretten syndrooma:0,1,4:", "keskittymisvaikeuksia ja muistihäiriöitä:Huntingtonin tauti:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Punaiset tai turvonneet ikenet:Parodontiitti:2,3,4:", "Punaiset tai turvonneet ikenet:ientulehdus:2,3,4:", "Hammassärky:Hammasmätä:0,4,3:", "nielemisongelmia:Nielurisatulehdus:0,2,4:", "Yläleuan epämuodostumat:Huulihalkeama:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["nestettä, joka valuu korvasta:Otitis:1,2,3:", "Kuulon menetys:Kuurous:0,2,3:", "soiva ääni korvissa:Tinnitus:0,1,3:", "huimaus:Menieren tauti:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Pilvinen näkö:Kaihi:1,2,3:", "Vaaleanpunainen tai punainen väri silmänvalkuaisessa:Sidekalvotulehdus:0,2,3:", "voimakas silmäkipu:Glaukooma:0,1,3:", "Huono syvyyshavainnointi ja perifeerinen näkö:Amblyopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Uusi kyhmy rinnassa tai kainalossa:Rintasyöpä:1,2,3:", "Veri virtsassa:Eturauhassyöpä:2,3,4:", "Muutos suolistotottumuksissa:Peräsuolen syöpä:1,3,4:", "yskä, joka ei häviä 2 tai 3 viikon kuluttua:Keuhkosyöpä:1,2,4:", "luomea, jonka väri, koko muuttuu tai joka vuotaa verta:Ihosyöpä:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Sinertävä väri ihossa, kynsissä ja huulissa:Hypoksemia:1,2,3:", "Nykiminen käsissä, kasvoissa ja jaloissa:Hypokalsemia:0,2,4:", "Useammin virtsaaminen ja jano:Hyperkalsemia:0,1:", "luiden heikkeneminen:hypofosfatemia:0,4:", "lihaskrampit tai kouristukset:Hyperfosfatemia:0,1:"]);
  }

  void addFR(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.fr;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Foie:1,2,3:29.2,45", "Bouche:4,2,9:28.1,81.6", "Oesophage:1,8,5:48.6,58.6", "Gros intestin:4,2,6:20.5,21", "Intestin grêle:8,7,1:52.4,19", "Estomac:4,6,7:66,41", "Pharynx:5,2,9:48.6,81", "Vésicule biliaire:6,9,4:31.3,39.6", "Pancréas:2,1,0:50,35.1", "Appendice iléo-cæcal:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Crâne:11,8,6:48,97", "Omoplate:5,4,3:61.1,80.2", "Côtes:11,7,0:56,74.1", "Vertebral column:8,10,1:45.9,65.2", "Tibia:5,9,3:51.4,23.6", "Fémur:4,10,7:54.9,35.5", "Humérus:2,7,9:69.1,66.2", "Métacarpe:6,0,1:81.3,44.8", "Carpe:5,4,2:77.1,48.7", "Tarse:4,3,1:49.3,6.9", "Métatarse:0,3,5:54.2,2.8", "Bassin:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["deltoïde:4,1,5:65.3,80.2", "Biceps:5,0,4:67.3,71.5", "Muscle pectoral:5,0,4:52.5,76.4", "Muscle trapèze:1,5,4:51.4,85.5", "Muscle oblique externe de l'abdomen:1,5,0:54.2,65.9", "Tibial antérieur:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Cœur:4,2,5:65.3,73", "Aorte:4,2,5:62.9,77.6", "veines rénales:0,4,5:57.3,59.1", "Artère rénale:0,5,4:61.5,59.1", "Veines jugulaires:0,2,5:60.4,86.1", "Veine fémorale:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Cerveau:5,4,3:50.4,96.8", "cervelet:5,4,3:56,92.6", "moelle épinière:0,4,3:50.7,86.8", "nerf sciatique:0,4,5:59.4,37.6", "Nerf tibial:1,5,3:61.1,19.4", "Ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Lèvres:1,2,4:61.4,96.6", "Luette:6,2,0:48.6,51.8", "Molaire:0,6,1:76.1,33", "Incisive:0,4,1:50.4,83", "Langue:7,2,0:48.2,27.6", "Amygdale:4,0,6:69.5,46.8", "Palais dur:1,2,0:48.6,73.8", "palais mou:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["lobe frontal:1,2,4:25,58.5", "Lobe temporal:0,2,3:51.2,42.2", "Lobe pariétal:0,1,3:66,69", "Lobe occipital:0,1,2:91,46", "cervelet:1,2,0:72.8,26.1", "Tronc cérébral:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Pavillon de l'oreille:1,2,4:8,31", "Canal de l'oreille:0,2,6:33.5,42.1", "Tambours:1,5,6:55.6,42", "Osselet:1,0,6:54.3,52.9", "cochlée:6,1,5:75.8,45.7", "nerf auditif:6,2,1:91.8,48", "trompe d'Eustache:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorte:8,6,3:51.7,84.7", "Veine cave supérieure:6,7,4:27.3,92", "Veine cave inférieure:1,4,3:27.8,6.8", "oreillette droite:4,7,0:31,54.4", "oreillette gauche:7,6,0:59.6,55.5", "Valve mitrale:8,2,0:69.5,43.7", "Ventricule droit:0,1,3:47.8,38.9", "ventricule gauche:1,8,3:58.1,43", "Valve tricuspide:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "Cornée:2,6,4:1.7,50.5", "cristallin:1,4,6:19,51.3", "Rétine:1,6,4:64.6,76.8", "nerf optique:0,6,3:87.9,36.2", "Chambre antérieure:6,4,3:7.2,51.4", "Corps vitré:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Noyau:5,3,2:57.3,75.5", "Nucléole:2,6,4:44.5,67.9,8", "Cytoplasme:1,4,6:93.08,50.09,9", "Membrane cellulaire:2,5,1:90,24,14", "Ribosome:2,1,3:80.929,75.844,14", "Mitochondrie:1,2,3:51.4,90.35,18", "Réticulum endoplasmique:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oxygène:1,2,4:74.5,29,25", "Carbone:2,0,4:74.5,57,25", "Hydrogène:1,0,5:74.5,73.2,25", "Azote:1,0,2:74.5,83.5,25", "Calcium:0,1,2:74.5,91.2,25", "Phosphore:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Quel organe produit la bile nécessaire à la digestion ?:0,7,6,8", "Quelle est la première partie du tube digestif qui reçoit de la nourriture et produit de la salive ?:1,2,6,5", "Par quel organe la nourriture passe du pharynx à l'estomac ?:2,6,9,7", "Quel organe est la dernière partie du système digestif ?:3,4,7,8", "Où se fait la plus grande absorption des nutriments et des minéraux provenant des aliments ?:4,5,3,0", "Quel organe sécrète des enzymes digestives et de l'acide gastrique pour faciliter la digestion des aliments ?:5,4,7,3", "Comment s'appelle la partie de la gorge située derrière la bouche et la cavité nasale ?:6,2,9,8", "Où la bile est-elle stockée et concentrée avant d'être libérée dans l'intestin grêle ?:7,6,9,8", "D'où l'insuline est-elle sécrétée ?:8,0,7,6", "Quel organe est situé dans le bas-ventre droit ?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Qu'est-ce qu'une structure osseuse qui forme la tête?:0,1,9,7", "Qu'est-ce qu'on appelle aussi l'os de l'épaule ?:1,9,11,6", "Qu'est-ce qu'une structure osseuse et cartilagineuse semi-rigide qui entoure la cavité thoracique ?:2,7,8,11", "Quelle est la caractéristique déterminante d'un vertébré?:3,0,11,2", "Quel est le plus grand des deux os de la jambe sous le genou ?:4,6,9,5", "Quel est l'os le plus long et le plus solide de votre corps ?:5,6,9,1", "Qu'est-ce qu'un os long du bras qui va de l'épaule au coude ?:6,5,1,7", "Qu'est-ce qu'un groupe de cinq os de la main entre les phalanges et le poignet ?:7,5,1,3", "Quels os composent le poignet ?:8,7,9,10", "Qu'est-ce qu'un groupe de sept os articulés dans chaque pied ?:9,7,8,1", "Qu'est-ce qu'un groupe de cinq os longs dans le pied ?:10,8,7,4", "Quelle est la partie inférieure du torse ?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Quel est le muscle formant le contour arrondi de l'épaule humaine ?:0,1,3,5", "Qu'est-ce qu'un gros muscle qui se trouve sur le devant du bras entre l'épaule et le coude ?:1,0,2,3", "Quel muscle est situé au niveau de la poitrine du corps humain ?:2,3,5,1", "Qu'est-ce qu'un muscle triangulaire situé sur la face postérieure du cou ?:3,1,2,5", "Quel muscle est le plus gros des muscles abdominaux latéraux ?:4,1,2,0", "Quel est le plus gros des 4 muscles de la loge antérieure de la jambe ?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Qu'est-ce qu'un organe musculaire qui pompe le sang dans les vaisseaux sanguins du système circulatoire ?:0,1,3,5", "Quelle est la principale et la plus grande artère du corps humain ?:1,4,3,2", "Quelles sont les veines qui drainent le rein ?:2,5,4,1", "Quelles sont les artères paires qui alimentent les reins en sang ?:3,2,1,5", "Quelles sont les veines qui ramènent le sang désoxygéné de la tête vers le cœur ?:4,2,5,1", "Qu'est-ce qu'une grosse veine située profondément dans la cuisse ?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Qu'est-ce qu'un organe qui sert de centre au système nerveux ?:0,1,2,5", "Quelle est la principale caractéristique du cerveau postérieur de tous les vertébrés ?:1,5,0,2", "Qu'est-ce qu'une structure tubulaire longue et fine constituée de tissu nerveux ?:2,1,3,4", "Qu'est-ce qu'un gros nerf qui longe l'articulation de la hanche ?:3,2,1,5", "Qu'est-ce qu'une branche du nerf sciatique ?:4,5,2,1", "Qu'est-ce qu'un groupe de corps cellulaires neuronaux dans le système nerveux périphérique ?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Quels sont les plis musculaires qui entourent la bouche ?:0,1,4,7", "Qu'est-ce qu'une extension charnue qui pend au-dessus de la gorge ?:1,4,0,7", "Que sont les dents plates à l'arrière de la bouche?:2,3,5,6", "Quelles sont les dents de devant ?:3,2,5,6", "Qu'est-ce qu'un organe musculaire dans la bouche ?:4,5,6,1", "Quels organes jouent un rôle important dans le système immunitaire ?:5,1,4,0", "Qu'est-ce qu'une fine plaque osseuse horizontale constituée de deux os du squelette facial ?:6,7,2,5", "Quel est le tissu mou constituant l'arrière du toit de la bouche ?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Quel est le plus grand des quatre principaux lobes du cerveau ?:0,3,1,4", "Qu'est-ce qui se trouve derrière les oreilles et est le deuxième plus grand lobe ?:1,0,3,2", "Qu'est-ce qui est impliqué dans la perception de la sensation, y compris le toucher, la température, la douleur ?:2,0,3,5", "Quel est le centre de traitement visuel du cerveau ?:3,0,1,4", "Qu'est-ce qui joue un rôle important dans le contrôle de l'équilibre ?:4,5,0,1", "Qu'est-ce qui aide à contrôler la fréquence cardiaque et la fréquence respiratoire ?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Quelle est la partie visible de l'oreille qui se trouve à l'extérieur de la tête ?:0,3,6,2", "Qu'est-ce qu'un chemin allant de l'oreille externe à l'oreille moyenne ?:1,2,3,0", "Qu'est-ce qu'un mince lambeau de peau qui est tendu comme un tambour et qui vibre lorsque le son le frappe ?:2,0,5,3", "Quels sont les trois os de l'oreille moyenne qui comptent parmi les plus petits os du corps humain ?:3,0,6,2", "À quoi ressemble la coquille d'un escargot?:4,2,0,6", "Qu'est-ce qui transporte les informations sensorielles auditives de la cochlée de l'oreille interne directement au cerveau ?:5,2,0,6", "Qu'est-ce qu'on appelle aussi le tube auditif ?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Quelle est la principale et la plus grande artère du corps humain ?:0,3,8,6", "Quelle veine transporte le sang de la tête, du cou, des bras et de la poitrine vers le cœur ?:1,3,0,2", "Quelle veine transporte le sang du bas du corps vers le cœur ?:2,1,0,3", "Quelle est la cavité supérieure par laquelle le sang pénètre dans les ventricules du cœur ?:3,5,6,2", "quelle cavité cardiaque reçoit le sang oxygéné des poumons ?:4,3,6,8", "Quelle valve sépare les deux cavités du côté gauche du cœur ?:5,8,7,3", "Qu'est-ce que la chambre musculaire qui pompe le sang du cœur vers le système circulatoire ?:6,5,8,2", "Quelle est l'une des quatre cavités du cœur ?:7,0,1,2", "Son rôle est d'empêcher le reflux du sang du ventricule droit dans l'oreillette droite.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Qu'est-ce qu'une structure fine dans l'œil, responsable du contrôle du diamètre et de la taille de la pupille ?:0,1,3,2", "Quelle est la partie frontale transparente de l'œil qui recouvre l'iris ?:1,2,3,0", "Qu'est-ce qu'une structure transparente dans l'œil qui aide à réfracter la lumière pour la focaliser sur la rétine ?:2,3,0,1", "Quelle est la couche de tissu la plus interne et sensible à la lumière de l'œil ?:3,1,0,2", "Qu'est-ce qui transmet les informations visuelles de la rétine au cerveau ?:4,6,5,3", "Quelle est la partie avant de l'œil entre la cornée et l'iris ?:5,6,2,3", "Quelle chambre oculaire est située derrière le cristallin et devant le nerf optique ?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Qu'est-ce qui se trouve au milieu de la cellule et qui contient de l'ADN disposé en chromosomes ?:0,1,2,3", "Quelle région de la cellule est concernée par la production des ribosomes cellulaires ?:1,2,3,4", "Qu'est-ce qu'un liquide gélatineux qui remplit l'intérieur d'une cellule ?:2,3,4,5", "Qu'est-ce qui protège la cellule de son environnement extérieur ?:3,4,2,1", "Qu'est-ce qu'une structure cellulaire qui produit des protéines ?:4,3,2,1", "Qu'est-ce qui convertit l'énergie chimique en une forme d'énergie utilisable par la cellule ?:5,4,3,2", "Quel est le système de transport de la cellule eucaryote ?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Qu'est-ce qui sert à oxyder notre nourriture, dans le processus de respiration cellulaire, libérant ainsi de l'énergie ?:0,1,2,3", "Quel est le deuxième élément le plus abondant dans le corps humain ?:1,2,3,4", "Qu'est-ce qui est utilisé pour garder le corps humain hydraté?:2,3,4,5", "Qu'est-ce qui est utilisé pour fabriquer des acides aminés dans notre corps qui à leur tour produisent des protéines ?:3,5,4", "Qu'est-ce qui est utilisé pour construire et maintenir des os solides ?:4,0,1,2", "Qu'est-ce qui est utilisé dans la formation des os et des dents?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Qu'est-ce qu'une maladie dans laquelle votre foie devient enflammé ?:Hépatite::", "Qu'est-ce qu'une maladie dans laquelle un parasite infecte le tractus gastro-intestinal de l'homme ?:Parasite intestinal::", "Qu'est-ce qu'une maladie dans laquelle votre pancréas devient enflammé ?:Pancréatite::", "Qu'est-ce qu'une maladie qui provoque une rupture de la paroi interne de l'estomac ?:Ulcère gastrique::", "Qu'est-ce qu'une maladie dans laquelle votre appendice devient enflammé ?:Appendicite::", "Qu'est-ce qu'une maladie dans laquelle la paroi interne de l'estomac s'enflamme ?:Gastrite::", "Quelle maladie cause le gonflement des veines dans le bas du rectum ?:Pathologie hémorroïdaire::", "Que sont les dépôts durs constitués de minéraux et de sels ?:Calculs rénaux::", "Qu'est-ce que la cicatrisation du foie causée par des lésions hépatiques à long terme ?:Cirrhose::", "Qu'est-ce qu'un type de maladie intestinale inflammatoire?:la maladie de Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Quelle maladie cause de la douleur et de l'inflammation dans une articulation ?:Arthrite::", "Qu'est-ce qu'une rupture dans la continuité d'un os ?:Fracture de l'os::", "Quelle maladie affaiblit les os, les rendant fragiles et plus susceptibles de se casser ?:Ostéoporose::", "Quelle maladie provoque une courbure latérale de la colonne vertébrale ?:Scoliose::", "Quel type d'arthrite provoque des douleurs articulaires soudaines et intenses ?:Goutte::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Quelle maladie provoque une faiblesse progressive et une perte de masse musculaire ?:dystrophie musculaire::", "Quelle maladie est causée par le manque d'activité physique?:atrophie musculaire::", "Quelle maladie provoque l'inflammation ou l'irritation d'un tendon ?:tendinite::", "Qu'est-ce qu'une contraction soudaine et involontaire d'un de vos muscles ?:crampes musculaires::", "Que se passe-t-il lorsque votre muscle est trop étiré ou déchiré ?:rupture musculaire::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Qu'est-ce qu'un type de cancer qui prend naissance dans les cellules qui font partie du système immunitaire de l'organisme ?:Lymphome::", "Qu'est-ce qu'un type de cancer qui débute généralement dans la moelle osseuse ?:Leucémie::", "Qu'est-ce qui est causé par des expositions prolongées à des températures très froides ?:Hypothermie::", "Qu'est-ce qu'un durcissement de vos artères causé par l'accumulation progressive de plaque ?:Athérosclérose::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Qu'est-ce qu'une inflammation aiguë des membranes protectrices recouvrant le cerveau et la moelle épinière ?:Méningite::", "Quelle est une maladie qui peut affecter votre cerveau et votre moelle épinière et causer des problèmes de vision, d'équilibre, de contrôle musculaire ?:Sclérose en plaque::", "Qu'est-ce qu'un trouble cérébral qui entraîne des tremblements, de la raideur et des difficultés de marche, d'équilibre et de coordination ?:la maladie de Parkinson::", "Qu'est-ce qui se caractérise par plusieurs tics de mouvement et au moins un tic vocal ?:syndrome de la Tourette::", "Qu'est-ce qu'un trouble cérébral héréditaire incurable qui endommage les cellules cérébrales ?:La maladie de Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Qu'est-ce qu'une infection grave des gencives qui endommage les tissus mous et qui peut détruire l'os qui soutient vos dents ?:Parodontite::", "Qu'est-ce qu'une forme bénigne de maladie des gencives qui provoque une irritation, une rougeur et un gonflement de la gencive ?:gingivite::", "Quelles sont les zones endommagées de façon permanente sur la surface dure de vos dents ?:Carie::", "Qu'est-ce qu'une infection des amygdales au fond de la gorge ?:Amygdalite::", "Que se passe-t-il si le tissu qui compose la lèvre ne se joint pas complètement avant la naissance ?:Fente labiale::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Quel trouble cérébral détruit la mémoire et les capacités de réflexion et, éventuellement, la capacité d'effectuer les tâches les plus simples ?:La maladie d'Alzheimer::", "Qu'est-ce qu'une affection rare mais grave dans laquelle le cerveau s'enflamme ?:Encéphalite::", "Qu'est-ce qu'un trouble de la céphalée caractérisé par des maux de tête récurrents modérés à sévères ?:Migraine::", "Qu'est-ce qu'une maladie qui affecte le cerveau et provoque des crises fréquentes ?:Épilepsie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Que se passe-t-il lorsqu'un virus ou une bactérie provoque une inflammation de la zone située derrière le tympan ?:Otite::", "Qu'est-ce qui fait référence à l'incapacité totale ou partielle d'entendre les sons ?:Surdité::", "Dans quelle condition entendez-vous des sons lorsqu'il n'y a pas de source extérieure de sons ?:Acouphène::", "Qu'est-ce qu'un trouble de l'oreille interne pouvant entraîner des étourdissements (vertiges) et une perte auditive ?:la maladie de Ménière::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Qu'est-ce qu'une douleur thoracique causée par une réduction du flux sanguin vers les muscles cardiaques ?:Angine::", "Qu'est-ce que la tension artérielle supérieure à la normale ?:Hypertension::", "Que se passe-t-il lorsque le flux sanguin diminue ou s'arrête dans l'artère coronaire du cœur ?:Infarctus du myocarde::", "Qu'est-ce qu'une maladie grave dans laquelle le cœur ne pompe pas le sang aussi efficacement qu'il le devrait ?:Insuffisance cardiaque congestive::", "Qu'est-ce qu'un mot pour un taux élevé de cholestérol dans le sang ?:Hypercholestérolémie::", "Qu'est-ce qu'une anomalie du rythme cardiaque ?:Arythmie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Qu'est-ce qu'une zone trouble dans le cristallin de l'œil qui entraîne une diminution de la vision ?:Cataracte::", "Qu'est-ce qu'une affection oculaire causée par une infection ou des allergies ?:Conjonctivite::", "Qu'est-ce qu'une affection oculaire où le nerf optique, qui relie l'œil au cerveau, est endommagé ?:Glaucome::", "Qu'est-ce qu'un trouble de la vue dans lequel le cerveau ne parvient pas à traiter pleinement les entrées d'un œil et, au fil du temps, favorise l'autre œil ?:Amblyopie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Quel type de cancer peut inclure une grosseur dans le sein ou une modification de la forme des seins ?:Cancer du sein::", "Quel est le type de cancer le plus courant qui touche uniquement les hommes ?:Cancer de la prostate::", "Qu'est-ce qu'un type de cancer dans lequel les cellules du côlon ou du rectum se développent de manière incontrôlable ?:Cancer colorectal::", "Quel type de cancer est causé par le tabagisme à long terme?:Cancer du poumon::", "Quel type de cancer est causé par une surexposition aux rayons ultraviolets du soleil ?:Cancer de la peau::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Comment appelle-t-on un niveau d'oxygène inférieur à la normale dans le sang, en particulier dans les artères ?:Hypoxémie::", "Comment appelle-t-on un taux de calcium inférieur à la normale dans votre sang ?:Hypocalcémie::", "Comment appelle-t-on un taux de calcium supérieur à la normale dans votre sang ?:Hypercalcémie::", "Comment appelle-t-on un taux de phosphate inférieur à la normale dans votre sang ?:hypophosphatémie::", "Comment appelle-t-on un taux de phosphate supérieur à la normale dans votre sang ?:Hyperphosphatémie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Jaunissement de la peau et du blanc des yeux:Hépatite:3,4,5:", "Éruption cutanée ou démangeaisons autour du rectum:Parasite intestinal:2,7,8:", "Douleurs abdominales modérées à sévères pouvant se propager à votre dos:Pancréatite:1,3,4:", "Douleur intense à l'estomac:Ulcère gastrique:6,7,8:", "Douleur soudaine qui commence sur le côté droit du bas-ventre:Appendicite:0,3,7:", "Nausées ou maux d'estomac récurrents:Gastrite:4,2,1:", "Démangeaisons extrêmes autour de l'anus:Pathologie hémorroïdaire:0,2,3:", "Douleur ou sensation de brûlure en urinant:Calculs rénaux:3,9,1:", "Jaunissement de la peau et du blanc des yeux:Cirrhose:7,5,4:", "Sang dans les selles:la maladie de Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["douleur articulaire:Arthrite:1,2,3:", "douleur intense immédiate:Fracture de l'os:2,3:", "Perte de hauteur avec le temps:Ostéoporose:1,3,4:", "une colonne vertébrale visiblement incurvée:Scoliose:0,1,2:", "peau rouge et brillante sur l'articulation touchée:Goutte:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Gros muscles du mollet:dystrophie musculaire:2,3,4:", "Un bras ou une jambe est plus petit que l'autre:atrophie musculaire:2,3,4:", "douleur dans un tendon qui s'aggrave lorsque vous bougez:tendinite:1,3,4:", "Une douleur soudaine et aiguë:crampes musculaires:1,2:", "douleur soudaine qui s'aggrave lors de la contraction du muscle:rupture musculaire:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Gonflement indolore des ganglions lymphatiques du cou, des aisselles ou de l'aine:Lymphome:2,3:", "Ganglions lymphatiques enflés, hypertrophie du foie ou de la rate:Leucémie:2,3:", "Frissons:Hypothermie:0,1:", "Engourdissement ou faiblesse dans les bras ou les jambes:Athérosclérose:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Forte fièvre soudaine, maux de tête sévères qui semblent différents de la normale:Méningite:1,2,3:", "cécité d'un oeil:Sclérose en plaque:0,3,4:", "Tremblement dans les mains:la maladie de Parkinson:0,3,4:", "tics de mouvement:syndrome de la Tourette:0,1,4:", "difficulté à se concentrer et trous de mémoire:La maladie de Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Gencives rouges ou enflées:Parodontite:2,3,4:", "Gencives rouges ou enflées:gingivite:2,3,4:", "Mal aux dents:Carie:0,4,3:", "problèmes de déglutition:Amygdalite:0,2,4:", "Déformations de la mâchoire supérieure:Fente labiale:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["liquide qui s'écoule de l'oreille:Otite:1,2,3:", "Perte d'audition:Surdité:0,2,3:", "un bourdonnement dans les oreilles:Acouphène:0,1,3:", "vertige:la maladie de Ménière:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Vision trouble:Cataracte:1,2,3:", "Couleur rose ou rouge dans le blanc de l'œil:Conjonctivite:0,2,3:", "douleur oculaire intense:Glaucome:0,1,3:", "Mauvaise perception de la profondeur et vision périphérique:Amblyopie:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Une nouvelle masse dans la poitrine ou sous les bras:Cancer du sein:1,2,3:", "Du sang dans les urines:Cancer de la prostate:2,3,4:", "Un changement dans les habitudes intestinales:Cancer colorectal:1,3,4:", "une toux qui ne disparaît pas après 2 ou 3 semaines:Cancer du poumon:1,2,4:", "Un grain de beauté qui change de couleur, de taille ou qui saigne:Cancer de la peau:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Couleur bleuâtre de la peau, des ongles et des lèvres:Hypoxémie:1,2,3:", "Des secousses dans les mains, le visage et les pieds:Hypocalcémie:0,2,4:", "Miction et soif plus fréquentes:Hypercalcémie:0,1:", "affaiblissement des os:hypophosphatémie:0,4:", "crampes ou spasmes musculaires:Hyperphosphatémie:0,1:"]);
  }

  void addHE(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.he;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎כָּבֵד‎‎:‎‎1,2,3‎‎:‎‎29.2,45‎", "‎‎‎‎‎‎פֶּה‎‎:‎‎4,2,9‎‎:‎‎28.1,81.6‎", "‎‎‎‎‎‎וֵשֶׁט‎‎:‎‎1,8,5‎‎:‎‎48.6,58.6‎", "‎‎‎‎‎‎המעי הגס‎‎:‎‎4,2,6‎‎:‎‎20.5,21‎", "‎‎‎‎‎‎מעי דק‎‎:‎‎8,7,1‎‎:‎‎52.4,19‎", "‎‎‎‎‎‎בֶּטֶן‎‎:‎‎4,6,7‎‎:‎‎66,41‎", "‎‎‎‎‎‎לוע‎‎:‎‎5,2,9‎‎:‎‎48.6,81‎", "‎‎‎‎‎‎כיס המרה‎‎:‎‎6,9,4‎‎:‎‎31.3,39.6‎", "‎‎‎‎‎‎לַבלָב‎‎:‎‎2,1,0‎‎:‎‎50,35.1‎", "‎‎‎‎‎‎נתוספתן‎‎:‎‎2,8,3‎‎:‎‎35.1,9.6‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎גולגולת‎‎:‎‎11,8,6‎‎:‎‎48,97‎", "‎‎‎‎‎‎עֶצֶם הַשֶׁכֶם‎‎:‎‎5,4,3‎‎:‎‎61.1,80.2‎", "‎‎‎‎‎‎בית החזה‎‎:‎‎11,7,0‎‎:‎‎56,74.1‎", "‎‎‎‎‎‎עַמוּד הַשִׁדרָה‎‎:‎‎8,10,1‎‎:‎‎45.9,65.2‎", "‎‎‎‎‎‎שׁוּקָה‎‎:‎‎5,9,3‎‎:‎‎51.4,23.6‎", "‎‎‎‎‎‎עֶצֶם הַיָרֵך‎‎:‎‎4,10,7‎‎:‎‎54.9,35.5‎", "‎‎‎‎‎‎עצם הזרוע‎‎:‎‎2,7,9‎‎:‎‎69.1,66.2‎", "‎‎‎‎‎‎עצמות מטקרפל‎‎:‎‎6,0,1‎‎:‎‎81.3,44.8‎", "‎‎‎‎‎‎עצמות קרפל‎‎:‎‎5,4,2‎‎:‎‎77.1,48.7‎", "‎‎‎‎‎‎שׁוֹרֶשׁ הָרֶגֶל‎‎:‎‎4,3,1‎‎:‎‎49.3,6.9‎", "‎‎‎‎‎‎עצמות מטטרסל‎‎:‎‎0,3,5‎‎:‎‎54.2,2.8‎", "‎‎‎‎‎‎קַטלִית‎‎:‎‎0,6,9‎‎:‎‎59,58.3‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎דלטואיד‎‎:‎‎4,1,5‎‎:‎‎65.3,80.2‎", "‎‎‎‎‎‎שריר הזרוע‎‎:‎‎5,0,4‎‎:‎‎67.3,71.5‎", "‎‎‎‎‎‎ששריר החזה הגדול‎‎:‎‎5,0,4‎‎:‎‎52.5,76.4‎", "‎‎‎‎‎‎טרפז‎‎:‎‎1,5,4‎‎:‎‎51.4,85.5‎", "‎‎‎‎‎‎אלכסון חיצוני של הבטן‎‎:‎‎1,5,0‎‎:‎‎54.2,65.9‎", "‎‎‎‎‎‎השריר השוקתי הקדמי‎‎:‎‎1,0,3‎‎:‎‎59.7,21.8‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎לֵב‎‎:‎‎4,2,5‎‎:‎‎65.3,73‎", "‎‎‎‎‎‎אבי העורקים‎‎:‎‎4,2,5‎‎:‎‎62.9,77.6‎", "‎‎‎‎‎‎ורידי כליה‎‎:‎‎0,4,5‎‎:‎‎57.3,59.1‎", "‎‎‎‎‎‎עורק כליה‎‎:‎‎0,5,4‎‎:‎‎61.5,59.1‎", "‎‎‎‎‎‎ורידי צוואר‎‎:‎‎0,2,5‎‎:‎‎60.4,86.1‎", "‎‎‎‎‎‎וריד הירך‎‎:‎‎0,2,4‎‎:‎‎67.4,37‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎מוח‎‎:‎‎5,4,3‎‎:‎‎50.4,96.8‎", "‎‎‎‎‎‎מוֹחַ מְאוּרָך‎‎:‎‎5,4,3‎‎:‎‎56,92.6‎", "‎‎‎‎‎‎עמוד שדרה‎‎:‎‎0,4,3‎‎:‎‎50.7,86.8‎", "‎‎‎‎‎‎עצב סיאטי‎‎:‎‎0,4,5‎‎:‎‎59.4,37.6‎", "‎‎‎‎‎‎עצב השוקה‎‎:‎‎1,5,3‎‎:‎‎61.1,19.4‎", "‎‎‎‎‎‎גנגליון‎‎:‎‎4,3,1‎‎:‎‎49,70‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎שפתיים‎‎:‎‎1,2,4‎‎:‎‎61.4,96.6‎", "‎‎‎‎‎‎עִנבָּל‎‎:‎‎6,2,0‎‎:‎‎48.6,51.8‎", "‎‎‎‎‎‎טוחנות‎‎:‎‎0,6,1‎‎:‎‎76.1,33‎", "‎‎‎‎‎‎שֵׁן חוֹתֶכֶת‎‎:‎‎0,4,1‎‎:‎‎50.4,83‎", "‎‎‎‎‎‎לָשׁוֹן‎‎:‎‎7,2,0‎‎:‎‎48.2,27.6‎", "‎‎‎‎‎‎שָׁקֵד‎‎:‎‎4,0,6‎‎:‎‎69.5,46.8‎", "‎‎‎‎‎‎חיך קשה‎‎:‎‎1,2,0‎‎:‎‎48.6,73.8‎", "‎‎‎‎‎‎חיך רך‎‎:‎‎4,2,0‎‎:‎‎56.3,61‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎אונה קדמית‎‎:‎‎1,2,4‎‎:‎‎25,58.5‎", "‎‎‎‎‎‎האונה הטמפורלית‎‎:‎‎0,2,3‎‎:‎‎51.2,42.2‎", "‎‎‎‎‎‎אונה פריאטלית‎‎:‎‎0,1,3‎‎:‎‎66,69‎", "‎‎‎‎‎‎אונה עורפית‎‎:‎‎0,1,2‎‎:‎‎91,46‎", "‎‎‎‎‎‎מוֹחַ מְאוּרָך‎‎:‎‎1,2,0‎‎:‎‎72.8,26.1‎", "‎‎‎‎‎‎גזע מוח‎‎:‎‎1,2,0‎‎:‎‎63.3,17.6‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎אֲפַרכֶּסֶת‎‎:‎‎1,2,4‎‎:‎‎8,31‎", "‎‎‎‎‎‎תעלת האוזן‎‎:‎‎0,2,6‎‎:‎‎33.5,42.1‎", "‎‎‎‎‎‎עור התוף‎‎:‎‎1,5,6‎‎:‎‎55.6,42‎", "‎‎‎‎‎‎אוססיקלים‎‎:‎‎1,0,6‎‎:‎‎54.3,52.9‎", "‎‎‎‎‎‎שבלול‎‎:‎‎6,1,5‎‎:‎‎75.8,45.7‎", "‎‎‎‎‎‎עצב השמיעה‎‎:‎‎6,2,1‎‎:‎‎91.8,48‎", "‎‎‎‎‎‎צינור אוסטכיאן‎‎:‎‎5,1,3‎‎:‎‎77.3,28.3‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎אבי העורקים‎‎:‎‎8,6,3‎‎:‎‎51.7,84.7‎", "‎‎‎‎‎‎וריד נבוב מעולה‎‎:‎‎6,7,4‎‎:‎‎27.3,92‎", "‎‎‎‎‎‎וריד נבוב תחתון‎‎:‎‎1,4,3‎‎:‎‎27.8,6.8‎", "‎‎‎‎‎‎חדר ימני‎‎:‎‎4,7,0‎‎:‎‎31,54.4‎", "‎‎‎‎‎‎אטריום שמאל‎‎:‎‎7,6,0‎‎:‎‎59.6,55.5‎", "‎‎‎‎‎‎שסתום מיטרלי‎‎:‎‎8,2,0‎‎:‎‎69.5,43.7‎", "‎‎‎‎‎‎חדר ימין‎‎:‎‎0,1,3‎‎:‎‎47.8,38.9‎", "‎‎‎‎‎‎חדר שמאל‎‎:‎‎1,8,3‎‎:‎‎58.1,43‎", "‎‎‎‎‎‎שסתום תלת-צדדי‎‎:‎‎1,0,5‎‎:‎‎41,27‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎קַשׁתִית‎‎:‎‎6,3,4‎‎:‎‎11.3,57‎", "‎‎‎‎‎‎קַרנִית‎‎:‎‎2,6,4‎‎:‎‎1.7,50.5‎", "‎‎‎‎‎‎עֲדָשָׁה‎‎:‎‎1,4,6‎‎:‎‎19,51.3‎", "‎‎‎‎‎‎רִשׁתִית‎‎:‎‎1,6,4‎‎:‎‎64.6,76.8‎", "‎‎‎‎‎‎עצב אופטי‎‎:‎‎0,6,3‎‎:‎‎87.9,36.2‎", "‎‎‎‎‎‎תא קדמי של גלגל העין:‎‎6,4,3‎‎:‎‎7.2,51.4‎", "‎‎‎‎‎‎תא זגוגית‎‎:‎‎1,4,3‎‎:‎‎49.3,65‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎גרעין התא‎‎:‎‎5,3,2‎‎:‎‎57.3,75.5‎", "‎‎‎‎‎‎גרעינון‎‎:‎‎2,6,4‎‎:‎‎44.5,67.9,8‎", "‎‎‎‎‎‎ציטופלזמה‎‎:‎‎1,4,6‎‎:‎‎93.08,50.09,9‎", "‎‎‎‎‎‎קרום תא‎‎:‎‎2,5,1‎‎:‎‎90,24,14‎", "‎‎‎‎‎‎ריבוזום‎‎:‎‎2,1,3‎‎:‎‎80.929,75.844,14‎", "‎‎‎‎‎‎מיטוכונדריון‎‎:‎‎1,2,3‎‎:‎‎51.4,90.35,18‎", "‎‎‎‎‎‎רטיקולום אנדופלזמי‎‎:‎‎2,4,1‎‎:‎‎63.9,25‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["‎‎‎‎‎‎חַמצָן‎‎:‎‎1,2,4‎‎:‎‎74.5,29,25‎", "‎‎‎‎‎‎פַּחמָן‎‎:‎‎2,0,4‎‎:‎‎74.5,57,25‎", "‎‎‎‎‎‎מֵימָן‎‎:‎‎1,0,5‎‎:‎‎74.5,73.2,25‎", "‎‎‎‎‎‎חַנקָן‎‎:‎‎1,0,2‎‎:‎‎74.5,83.5,25‎", "‎‎‎‎‎‎סִידָן‎‎:‎‎0,1,2‎‎:‎‎74.5,91.2,25‎", "‎‎‎‎‎‎זַרחָן‎‎:‎‎1,2,0‎‎:‎‎74.5,96.82,25‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["‎‎‎‎‎איזה איבר מייצר מרה הנחוצה לעיכול?‎‎:‎‎0,7,6,8‎‎‎", "‎‎‎‎‎מהו החלק הראשון של תעלת העיכול שמקבל מזון ומייצר רוק?‎‎:‎‎1,2,6,5‎‎‎", "‎‎‎‎‎דרך איזה מזון עובר מהלוע לקיבה?‎‎:‎‎2,6,9,7‎‎‎", "‎‎‎‎‎איזה איבר הוא החלק האחרון של מערכת העיכול?‎‎:‎‎3,4,7,8‎‎‎", "‎‎‎‎‎היכן מתרחשת הספיגה הגדולה ביותר של חומרים מזינים ומינרלים מהמזון?‎‎:‎‎4,5,3,0‎‎‎", "‎‎‎‎‎איזה איבר מפריש אנזימי עיכול וחומצת קיבה כדי לסייע בעיכול המזון?‎‎:‎‎5,4,7,3‎‎‎", "‎‎‎‎‎איך קוראים לחלק בגרון שמאחורי הפה וחלל האף?‎‎:‎‎6,2,9,8‎‎‎", "‎‎‎‎‎היכן מאוחסנת ומרוכזת המרה לפני שחרורה למעי הדק?‎‎:‎‎7,6,9,8‎‎‎", "‎‎‎‎‎מאיפה מופרש אינסולין?‎‎:‎‎8,0,7,6‎‎‎", "‎‎‎‎‎איזה איבר נמצא בבטן הימנית התחתונה?‎‎:‎‎9,0,7,2‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהו מבנה עצם היוצר את הראש?‎‎:‎‎0,1,9,7‎‎‎", "‎‎‎‎‎מה ידוע גם בשם עצם הכתף?‎‎:‎‎1,9,11,6‎‎‎", "‎‎‎‎‎מהו מבנה גרמי וסחוס חצי קשיח המקיף את חלל בית החזה?‎‎:‎‎2,7,8,11‎‎‎", "‎‎‎‎‎מה המאפיין המגדיר של חולייתן?‎‎:‎‎3,0,11,2‎‎‎", "‎‎‎‎‎מהי העצמות הגדולה מבין שתי העצמות ברגל מתחת לברך?‎‎:‎‎4,6,9,5‎‎‎", "‎‎‎‎‎מהי העצם הארוכה והחזקה ביותר בגופך?‎‎:‎‎5,6,9,1‎‎‎", "‎‎‎‎‎מהי עצם ארוכה בזרוע העוברת מהכתף למרפק?‎‎:‎‎6,5,1,7‎‎‎", "‎‎‎‎‎מהי קבוצה של חמש עצמות יד בין הפלנגות לפרק כף היד?‎‎:‎‎7,5,1,3‎‎‎", "‎‎‎‎‎אילו עצמות מרכיבות את פרק כף היד?‎‎:‎‎8,7,9,10‎‎‎", "‎‎‎‎‎מהו מקבץ של שבע עצמות מפרקות בכל כף רגל?‎‎:‎‎9,7,8,1‎‎‎", "‎‎‎‎‎מהי קבוצה של חמש עצמות ארוכות בכף הרגל?‎‎:‎‎10,8,7,4‎‎‎", "‎‎‎‎‎מהו החלק התחתון של הגו?‎‎:‎‎11,6,3,2‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהו השריר היוצר את קו המתאר המעוגל של הכתף האנושית?‎‎:‎‎0,1,3,5‎‎‎", "‎‎‎‎‎מהו שריר גדול השוכן בחלק הקדמי של הזרוע העליונה בין הכתף למרפק?‎‎:‎‎1,0,2,3‎‎‎", "‎‎‎‎‎איזה שריר ממוקם בחזה של גוף האדם?‎‎:‎‎2,3,5,1‎‎‎", "‎‎‎‎‎מהו שריר משולש הממוקם בחלק האחורי של הצוואר?‎‎:‎‎3,1,2,5‎‎‎", "‎‎‎‎‎איזה שריר הוא הגדול מבין שרירי הבטן הצידיים?‎‎:‎‎4,1,2,0‎‎‎", "‎‎‎‎‎מהו הגדול מבין 4 השרירים בתא הקדמי של הרגל?‎‎:‎‎5,3,0,1‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהו איבר שרירי שמזרים דם דרך כלי הדם של מערכת הדם?‎‎:‎‎0,1,3,5‎‎‎", "‎‎‎‎‎מהו העורק הראשי והגדול ביותר בגוף האדם?‎‎:‎‎1,4,3,2‎‎‎", "‎‎‎‎‎מהם ורידים המנקזים את הכליה?‎‎:‎‎2,5,4,1‎‎‎", "‎‎‎‎‎מהם עורקים מזווגים המספקים דם לכליות?‎‎:‎‎3,2,1,5‎‎‎", "‎‎‎‎‎מהם ורידים שמוציאים דם נטול חמצן מהראש בחזרה ללב?‎‎:‎‎4,2,5,1‎‎‎", "‎‎‎‎‎מהו וריד גדול הממוקם עמוק בתוך הירך?‎‎:‎‎5,2,1,4‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהו איבר המשמש כמרכז מערכת העצבים?‎‎:‎‎0,1,2,5‎‎‎", "‎‎‎‎‎מהי התכונה העיקרית של המוח האחורי של כל החולייתנים?‎‎:‎‎1,5,0,2‎‎‎", "‎‎‎‎‎מהו מבנה ארוך, דק וצינורי המורכב מרקמת עצבים?‎‎:‎‎2,1,3,4‎‎‎", "‎‎‎‎‎מהו עצב גדול העובר לצד מפרק הירך?‎‎:‎‎3,2,1,5‎‎‎", "‎‎‎‎‎מהו ענף של העצב הסיאטי?‎‎:‎‎4,5,2,1‎‎‎", "‎‎‎‎‎מהי קבוצה של גופי תאי נוירון במערכת העצבים ההיקפית?‎‎:‎‎5,1,0,2‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהם קפלי שרירים המקיפים את הפה?‎‎:‎‎0,1,4,7‎‎‎", "‎‎‎‎‎מהי הרחבה בשרנית התלויה מעל הגרון?‎‎:‎‎1,4,0,7‎‎‎", "‎‎‎‎‎מהן שיניים שטוחות בחלק האחורי של הפה?‎‎:‎‎2,3,5,6‎‎‎", "‎‎‎‎‎מהן השיניים הקדמיות?‎‎:‎‎3,2,5,6‎‎‎", "‎‎‎‎‎מהו איבר שרירי בפה?‎‎:‎‎4,5,6,1‎‎‎", "‎‎‎‎‎אילו איברים ממלאים תפקיד חשוב במערכת החיסון?‎‎:‎‎5,1,4,0‎‎‎", "‎‎‎‎‎מהי צלחת גרמית אופקית דקה המורכבת משתי עצמות שלד הפנים?‎‎:‎‎6,7,2,5‎‎‎", "‎‎‎‎‎מהי הרקמה הרכה המהווה את החלק האחורי של גג הפה?‎‎:‎‎7,5,1,0‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהי האונות הגדולות מבין ארבע האונות העיקריות של המוח?‎‎:‎‎0,3,1,4‎‎‎", "‎‎‎‎‎מה יושב מאחורי האוזניים והאם האונה השנייה בגודלה?‎‎:‎‎1,0,3,2‎‎‎", "‎‎‎‎‎מה מעורב בתפיסת התחושה, כולל מגע, טמפרטורה, כאב?‎‎:‎‎2,0,3,5‎‎‎", "‎‎‎‎‎מהו מרכז העיבוד החזותי של המוח?‎‎:‎‎3,0,1,4‎‎‎", "‎‎‎‎‎מה משחק תפקיד חשוב בשליטה באיזון?‎‎:‎‎4,5,0,1‎‎‎", "‎‎‎‎‎מה עוזר לשלוט בקצב הלב ובקצב הנשימה?‎‎:‎‎5,0,4,3‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהו החלק הגלוי של האוזן שנמצא מחוץ לראש?‎‎:‎‎0,3,6,2‎‎‎", "‎‎‎‎‎מהו מסלול העובר מהאוזן החיצונית לאוזן התיכונה?‎‎:‎‎1,2,3,0‎‎‎", "‎‎‎‎‎מהו דש דק של עור שנמתח חזק כמו תוף ורוטט כשקול פוגע בו?‎‎:‎‎2,0,5,3‎‎‎", "‎‎‎‎‎מהן שלוש עצמות באוזן התיכונה שהן בין העצמות הקטנות ביותר בגוף האדם?‎‎:‎‎3,0,6,2‎‎‎", "‎‎‎‎‎מה דומה לקונכייה של חילזון?‎‎:‎‎4,2,0,6‎‎‎", "‎‎‎‎‎מה נושא מידע חושי שמיעתי מהשבלול של האוזן הפנימית ישירות למוח?‎‎:‎‎5,2,0,6‎‎‎", "‎‎‎‎‎מה ידוע גם בשם צינור השמיעה?‎‎:‎‎6,1,4,0‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהו העורק הראשי והגדול ביותר בגוף האדם?‎‎:‎‎0,3,8,6‎‎‎", "‎‎‎‎‎איזה וריד מוביל דם מהראש, הצוואר, הזרועות והחזה בחזרה אל הלב?‎‎:‎‎1,3,0,2‎‎‎", "‎‎‎‎‎איזה וריד מוביל דם מפלג הגוף התחתון חזרה אל הלב?‎‎:‎‎2,1,0,3‎‎‎", "‎‎‎‎‎מהו החדר העליון שדרכו חודר הדם לחדרי הלב?‎‎:‎‎3,5,6,2‎‎‎", "‎‎‎‎‎איזה חדר לב מקבל דם מחומצן מהריאות?‎‎:‎‎4,3,6,8‎‎‎", "‎‎‎‎‎איזה שסתום מפריד בין שני החדרים של הצד השמאלי של הלב?‎‎:‎‎5,8,7,3‎‎‎", "‎‎‎‎‎מהו חדר שרירי השואב דם מהלב ואל מערכת הדם?‎‎:‎‎6,5,8,2‎‎‎", "‎‎‎‎‎איזה אחד מארבעת חדרי הלב?‎‎:‎‎7,0,1,2‎‎‎", "‎‎‎‎‎תפקידו הוא למנוע זרימה אחורית של דם מהחדר הימני לאטריום הימני.‎‎:‎‎8,2,5,4‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מהו מבנה דק בעין, האחראי על השליטה בקוטר וגודל האישון?‎‎:‎‎0,1,3,2‎‎‎", "‎‎‎‎‎מהו החלק הקדמי השקוף של העין המכסה את הקשתית?‎‎:‎‎1,2,3,0‎‎‎", "‎‎‎‎‎מהו מבנה שקוף בעין שעוזר לשבור אור כדי להיות ממוקד ברשתית?‎‎:‎‎2,3,0,1‎‎‎", "‎‎‎‎‎מהי שכבת הרקמה הפנימית והרגישה לאור של העין?‎‎:‎‎3,1,0,2‎‎‎", "‎‎‎‎‎מה מעביר מידע חזותי מהרשתית למוח?‎‎:‎‎4,6,5,3‎‎‎", "‎‎‎‎‎מהו החלק הקדמי של העין בין הקרנית לקשתית העין?‎‎:‎‎5,6,2,3‎‎‎", "‎‎‎‎‎איזה חדר עין ממוקם מאחורי העדשה ומול עצב הראייה?‎‎:‎‎6,5,3,0‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["‎‎‎‎‎מה נמצא באמצע התא והוא מכיל DNA מסודר בכרומוזומים?‎‎:‎‎0,1,2,3‎‎‎", "‎‎‎‎‎איזה אזור בתוך התא עוסק בייצור הריבוזומים של התא?‎‎:‎‎1,2,3,4‎‎‎", "‎‎‎‎‎מהו נוזל ג'לטיני הממלא את פנים התא?‎‎:‎‎2,3,4,5‎‎‎", "‎‎‎‎‎מה מגן על התא מסביבתו החיצונית?‎‎:‎‎3,4,2,1‎‎‎", "‎‎‎‎‎מהו מבנה תא המייצר חלבון?‎‎:‎‎4,3,2,1‎‎‎", "‎‎‎‎‎מה הופך אנרגיה כימית לצורת אנרגיה שהתא יכול להשתמש בה?‎‎:‎‎5,4,3,2‎‎‎", "‎‎‎‎‎מהי מערכת ההובלה של התא האוקריוטי?‎‎:‎‎6,5,0,1‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["‎‎‎‎‎במה משתמשים כדי לחמצן את המזון שלנו, בתהליך הנשימה התאית, ובכך לשחרר אנרגיה?‎‎:‎‎0,1,2,3‎‎‎", "‎‎‎‎‎מהו האלמנט השני בשכיחותו בגוף האדם?‎‎:‎‎1,2,3,4‎‎‎", "‎‎‎‎‎במה משתמשים כדי לשמור על לחות גוף האדם?‎‎:‎‎2,3,4,5‎‎‎", "‎‎‎‎‎מה משמש לייצור חומצות אמינו בגופנו אשר בתורן מייצרות חלבונים?‎‎:‎‎3,5,4‎‎‎", "‎‎‎‎‎מה משמש לבנייה ולתחזוקה של עצמות חזקות?‎‎:‎‎4,0,1,2‎‎‎", "‎‎‎‎‎מה משמש ליצירת עצמות ושיניים?‎‎:‎‎5,1,2,3‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎מהי מחלה שבה הכבד שלך הופך מודלק?‎‎:‎‎דַלֶקֶת הַכָּבֵד‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי מחלה שבה טפיל מדביק את מערכת העיכול של בני אדם?‎‎:‎‎טפילי מעיים‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי מחלה שבה הלבלב שלך הופך דלקתי?‎‎:‎‎דלקת הלבלב‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי מחלה הגורמת לשבירה בדופן הפנימית של הקיבה?‎‎:‎‎כיב קיבה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי מחלה שבה התוספתן שלך הופך מודלק?‎‎:‎‎דַלֶקֶת הַתוֹסֶפתָן‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי מחלה שבה רירית הקיבה הפנימית שלך נדלקת?‎‎:‎‎דַלֶקֶת הַקֵבָה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איזו מחלה גורמת לוורידים נפוחים בפי הטבעת התחתונה שלך?‎‎:‎‎טְחוֹרִים‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהם משקעים קשים העשויים ממינרלים ומלחים?‎‎:‎‎אבנים בכליות‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי צלקות בכבד הנגרמות מנזק לכבד לטווח ארוך?‎‎:‎‎שַׁחֶמֶת‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו סוג של מחלת מעי דלקתית?‎‎:‎‎מחלת קרוהן‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎איזו מחלה גורמת לכאב ודלקת במפרק?‎‎:‎‎דַלֶקֶת פּרָקִים‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו שבר בהמשכיות של עצם?‎‎:‎‎שבר בעצם‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איזו מחלה מחלישה את העצמות, מה שהופך אותן לשבריריות ובעל סיכוי גבוה יותר להישבר?‎‎:‎‎אוסטאופורוזיס‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איזו מחלה גורמת לעקמומיות הצידה של עמוד השדרה?‎‎:‎‎עַקמֶמֶת‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו סוג של דלקת פרקים הגורמת לכאבי פרקים פתאומיים וחמורים?‎‎:‎‎שִׁגָדוֹן‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎איזו מחלה גורמת לחולשה מתקדמת ואיבוד מסת שריר?‎‎:‎‎ניוון שרירים‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איזו מחלה נגרמת מחוסר פעילות גופנית?‎‎:‎‎ניוון שרירים‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איזו מחלה גורמת לדלקת או גירוי של גיד?‎‎:‎‎דַלֶקֶת הַגִיד‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו כיווץ פתאומי ולא רצוני של אחד השרירים שלך?‎‎:‎‎התכווצויות שרירים‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מה קורה כאשר השריר שלך נמתח יתר על המידה או נקרע?‎‎:‎‎קרע בשריר‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎מהו סוג סרטן שמתחיל בתאים המהווים חלק ממערכת החיסון של הגוף?‎‎:‎‎לימפומה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו סוג סרטן שמתחיל בדרך כלל במח העצם?‎‎:‎‎לוקמיה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מה נגרם מחשיפה ממושכת לטמפרטורות קרות מאוד?‎‎:‎‎היפותרמיה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי התקשות העורקים שלך הנגרמת מהצטברות פלאק הדרגתית?‎‎:‎‎טרשת עורקים‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎מהי דלקת חריפה של ממברנות המגן המכסות את המוח וחוט השדרה?‎‎:‎‎דַלֶקֶת קְרוֹם הַמוֹחַ‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי מחלה שיכולה להשפיע על המוח ועל חוט השדרה שלך, ועלולה לגרום לבעיות בראייה, שיווי משקל, שליטה בשרירים?‎‎:‎‎טרשת נפוצה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי הפרעה מוחית שמובילה לרעד, נוקשות וקושי בהליכה, שיווי משקל וקואורדינציה?‎‎:‎‎מחלת פרקינסון‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מה מאופיין בטיקים מרובי תנועה ולפחות טיק קולי אחד?‎‎:‎‎תסמונת טורט‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי הפרעה תורשתית חשוכת מרפא הפוגעת בתאי המוח?‎‎:‎‎מחלת הנטינגטון‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎מהי דלקת חניכיים חמורה הפוגעת ברקמה הרכה ושיכולה להרוס את העצם התומכת בשיניים?‎‎:‎‎פריודונטיטיס‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי צורה קלה של מחלת חניכיים הגורמת לגירוי, אדמומיות ונפיחות בחניכיים שלך?‎‎:‎‎דַלֶקֶת הַחֲנִיכַיִם‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהם אזורים שניזוקו לצמיתות במשטח הקשה של השיניים שלך?‎‎:‎‎עששת‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו זיהום של השקדים בחלק האחורי של הגרון?‎‎:‎‎דַלֶקֶת שְׁקֵדִים‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מה קורה אם הרקמה המרכיבה את השפה לא מתחברת לגמרי לפני הלידה?‎‎:‎‎שפה שסועה‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎איזו הפרעה מוחית הורסת את כישורי הזיכרון והחשיבה, ובסופו של דבר, את היכולת לבצע את המשימות הפשוטות ביותר?‎‎:‎‎מחלת אלצהיימר‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו מצב לא שכיח אך חמור בו המוח הופך דלקתי?‎‎:‎‎דַלֶקֶת הַמוֹחַ‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי הפרעת כאב ראש המאופיינת בכאבי ראש חוזרים ומתונים עד חמורים?‎‎:‎‎מִיגרֶנָה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי מחלה הפוגעת במוח וגורמת להתקפים תכופים?‎‎:‎‎אֶפִּילֶפּסִיָה‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎מה קורה כאשר וירוס או חיידק גורמים לאזור שמאחורי עור התוף להידלק?‎‎:‎‎דלקת אוזניים‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מה מתייחס לחוסר יכולת מוחלט או חלקי לשמוע צלילים?‎‎:‎‎חֵרשׁוּת‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו מצב בו שומעים צלילים כאשר אין מקור חיצוני לצלילים?‎‎:‎‎טינטון‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי הפרעה באוזן הפנימית שעלולה להוביל לסחרחורת (ורטיגו) ואובדן שמיעה?‎‎:‎‎מחלת מנייר‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎מהו כאב בחזה הנגרם כתוצאה מירידה בזרימת הדם לשרירי הלב?‎‎:‎‎אַנגִינָה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו לחץ דם גבוה מהרגיל?‎‎:‎‎לַחַץ יֶתֶר‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מה קורה כאשר זרימת הדם פוחתת או נעצרת לעורק הכלילי של הלב?‎‎:‎‎אוטם שריר הלב‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו מצב חמור בו הלב אינו שואב דם ביעילות כפי שהוא צריך?‎‎:‎‎אי ספיקת לב‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי מילה לרמות גבוהות של כולסטרול בדם?‎‎:‎‎היפרכולסטרולמיה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי חריגה בקצב הלב?‎‎:‎‎הפרעת קצב‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎מהו אזור מעונן בעדשת העין שמוביל לירידה בראייה?‎‎:‎‎קָטָרַקט‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו מצב עיניים הנגרם מזיהום או אלרגיות?‎‎:‎‎דַלֶקֶת הַלַחמִית‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו מצב עין שבו עצב הראייה, המחבר בין העין למוח, ניזוק?‎‎:‎‎בַּרקִית‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהי הפרעת ראייה שבה המוח לא מצליח לעבד באופן מלא תשומות מעין אחת ולאורך זמן מעדיף את העין השנייה?‎‎:‎‎אמבליופיה‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎מהו סוג סרטן שעלול לכלול גוש בשד או שינוי בצורת השד?‎‎:‎‎סרטן השד‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו סוג הסרטן השכיח ביותר שפוגע רק בגברים?‎‎:‎‎סרטן הערמונית‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מהו סוג סרטן שבו תאים במעי הגס או פי הטבעת גדלים ללא שליטה?‎‎:‎‎סרטן מעי גס‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איזה סוג של סרטן נגרם מעישון טבק לטווח ארוך?‎‎:‎‎סרטן ריאות‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איזה סוג סרטן נגרם מחשיפת יתר לקרניים אולטרה סגולות מהשמש?‎‎:‎‎סרטן העור‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["‎‎‎‎‎‎‎‎איך נקראת רמה מתחת לנורמה של חמצן בדם שלך, במיוחד בעורקים?‎‎:‎‎היפוקסמיה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איך נקראת רמה מתחת לנורמה של סידן בדם שלך?‎‎:‎‎היפוקלצמיה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איך נקראת רמה מעל לנורמה של סידן בדם שלך?‎‎:‎‎היפרקלצמיה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איך נקראת רמה מתחת לנורמה של פוספט בדם שלך?‎‎:‎‎היפופוספטמיה‎‎:‎‎‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איך נקראת רמה מעל לנורמה של פוספט בדם שלך?‎‎:‎‎היפרפוספטמיה‎‎:‎‎‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎הצהבה של העור ולובן העיניים שלך‎‎:‎‎דַלֶקֶת הַכָּבֵד‎‎:‎‎3,4,5‎‎:‎‎‎", "‎‎‎‎‎‎‎‎פריחה או גירוד סביב פי הטבעת‎‎:‎‎טפילי מעיים‎‎:‎‎2,7,8‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאבי בטן בינוניים עד קשים שעלולים להתפשט לגב‎‎:‎‎דלקת הלבלב‎‎:‎‎1,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאבי בטן חזקים‎‎:‎‎כיב קיבה‎‎:‎‎6,7,8‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאב פתאומי שמתחיל בצד ימין של הבטן התחתונה‎‎:‎‎דַלֶקֶת הַתוֹסֶפתָן‎‎:‎‎0,3,7‎‎:‎‎‎", "‎‎‎‎‎‎‎‎בחילות או קלקול קיבה חוזר‎‎:‎‎דַלֶקֶת הַקֵבָה‎‎:‎‎4,2,1‎‎:‎‎‎", "‎‎‎‎‎‎‎‎גירוד קיצוני סביב פי הטבעת‎‎:‎‎טְחוֹרִים‎‎:‎‎0,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאב או תחושת צריבה בזמן מתן שתן‎‎:‎‎אבנים בכליות‎‎:‎‎3,9,1‎‎:‎‎‎", "‎‎‎‎‎‎‎‎הצהבה של העור ולובן העיניים שלך‎‎:‎‎שַׁחֶמֶת‎‎:‎‎7,5,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎דם בצואה‎‎:‎‎מחלת קרוהן‎‎:‎‎2,7,8‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎כאב מפרקים‎‎:‎‎דַלֶקֶת פּרָקִים‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאב מיידי, חמור‎‎:‎‎שבר בעצם‎‎:‎‎2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎איבוד גובה לאורך זמן‎‎:‎‎אוסטאופורוזיס‎‎:‎‎1,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎עמוד שדרה מעוקל בעליל‎‎:‎‎עַקמֶמֶת‎‎:‎‎0,1,2‎‎:‎‎‎", "‎‎‎‎‎‎‎‎עור אדום ומבריק מעל המפרק הפגוע‎‎:‎‎שִׁגָדוֹן‎‎:‎‎1,2,3‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎שרירי שוק גדולים‎‎:‎‎ניוון שרירים‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎יד אחת או רגל אחת קטנה מהשנייה‎‎:‎‎ניוון שרירים‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאב בגיד שמתגבר כאשר אתה זז‎‎:‎‎דַלֶקֶת הַגִיד‎‎:‎‎1,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאב פתאומי וחד‎‎:‎‎התכווצויות שרירים‎‎:‎‎1,2‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאב פתאומי שמחמיר בזמן כיווץ השריר‎‎:‎‎קרע בשריר‎‎:‎‎1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎נפיחות ללא כאב של בלוטות הלימפה בצוואר, בבתי השחי או במפשעה‎‎:‎‎לימפומה‎‎:‎‎2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎בלוטות לימפה נפוחות, כבד או טחול מוגדלים‎‎:‎‎לוקמיה‎‎:‎‎2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎רועד‎‎:‎‎היפותרמיה‎‎:‎‎0,1‎‎:‎‎‎", "‎‎‎‎‎‎‎‎חוסר תחושה או חולשה בידיים או ברגליים‎‎:‎‎טרשת עורקים‎‎:‎‎0,1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎חום גבוה פתאומי, כאב ראש חזק שנראה שונה מהרגיל‎‎:‎‎דַלֶקֶת קְרוֹם הַמוֹחַ‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎עיוורון בעין אחת‎‎:‎‎טרשת נפוצה‎‎:‎‎0,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎רעד בידיים‎‎:‎‎מחלת פרקינסון‎‎:‎‎0,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎טיקים תנועתיים‎‎:‎‎תסמונת טורט‎‎:‎‎0,1,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎קשיי ריכוז וזיכרון פגום‎‎:‎‎מחלת הנטינגטון‎‎:‎‎0,1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎חניכיים אדומות או נפוחות‎‎:‎‎פריודונטיטיס‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎חניכיים אדומות או נפוחות‎‎:‎‎דַלֶקֶת הַחֲנִיכַיִם‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כְּאֵב שִׁנַיִם‎‎:‎‎עששת‎‎:‎‎0,4,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎בעיות בליעה‎‎:‎‎דַלֶקֶת שְׁקֵדִים‎‎:‎‎0,2,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎עיוותים של הלסת העליונה‎‎:‎‎שפה שסועה‎‎:‎‎0,2,3‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎נוזל שמתנקז מהאוזן‎‎:‎‎דלקת אוזניים‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎אובדן שמיעה‎‎:‎‎חֵרשׁוּת‎‎:‎‎0,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎רעש צלצול באוזניים‎‎:‎‎טינטון‎‎:‎‎0,1,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎סְחַרחוֹרֶת‎‎:‎‎מחלת מנייר‎‎:‎‎0,1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎ראייה מעוננת‎‎:‎‎קָטָרַקט‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎צבע ורוד או אדום בלבן של העין‎‎:‎‎דַלֶקֶת הַלַחמִית‎‎:‎‎0,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎כאבי עיניים עזים‎‎:‎‎בַּרקִית‎‎:‎‎0,1,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎תפיסת עומק ירודה וראייה היקפית‎‎:‎‎אמבליופיה‎‎:‎‎0,1,2‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎גוש חדש בשד או בבית השחי‎‎:‎‎סרטן השד‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎דם בשתן‎‎:‎‎סרטן הערמונית‎‎:‎‎2,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎שינוי בהרגלי היציאות‎‎:‎‎סרטן מעי גס‎‎:‎‎1,3,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎שיעול שלא חולף לאחר שבועיים או שלושה‎‎:‎‎סרטן ריאות‎‎:‎‎1,2,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎שומה המשתנה בצבעה, בגודלה או שמדממת‎‎:‎‎סרטן העור‎‎:‎‎0,1,3‎‎:‎‎‎"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["‎‎‎‎‎‎‎‎צבע כחלחל בעור, בציפורניים ובשפתיים‎‎:‎‎היפוקסמיה‎‎:‎‎1,2,3‎‎:‎‎‎", "‎‎‎‎‎‎‎‎עוויתות בידיים, בפנים וברגליים‎‎:‎‎היפוקלצמיה‎‎:‎‎0,2,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎מתן שתן וצמא תכופים יותר‎‎:‎‎היפרקלצמיה‎‎:‎‎0,1‎‎:‎‎‎", "‎‎‎‎‎‎‎‎היחלשות של עצמות‎‎:‎‎היפופוספטמיה‎‎:‎‎0,4‎‎:‎‎‎", "‎‎‎‎‎‎‎‎התכווצויות שרירים או עוויתות‎‎:‎‎היפרפוספטמיה‎‎:‎‎0,1‎‎:‎‎‎"]);
  }

  void addHI(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.hi;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["लिवर:1,2,3:29.2,45", "मुंह:4,2,9:28.1,81.6", "घुटकी:1,8,5:48.6,58.6", "बड़ी आंत:4,2,6:20.5,21", "छोटी आंत:8,7,1:52.4,19", "पेट:4,6,7:66,41", "ग्रसनी:5,2,9:48.6,81", "पित्ताशय की थैली:6,9,4:31.3,39.6", "अग्न्याशय:2,1,0:50,35.1", "परिशिष्ट:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["खोपड़ी:11,8,6:48,97", "कंधे की हड्डी:5,4,3:61.1,80.2", "पसलियों:11,7,0:56,74.1", "स्पाइन:8,10,1:45.9,65.2", "टिबिअ:5,9,3:51.4,23.6", "जांध:4,10,7:54.9,35.5", "प्रगंडिका:2,7,9:69.1,66.2", "मेटाकार्पल हड्डियां:6,0,1:81.3,44.8", "कार्पल हड्डियां:5,4,2:77.1,48.7", "टैसास:4,3,1:49.3,6.9", "मेटाटार्सल हड्डियां:0,3,5:54.2,2.8", "श्रोणि:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["डेल्टा मांसपेशी:4,1,5:65.3,80.2", "बाइसेप्स की मांसपेशी:5,0,4:67.3,71.5", "छाती पर का कवच:5,0,4:52.5,76.4", "त्रपेजियस:1,5,4:51.4,85.5", "उदर बाहरी तिरछा:1,5,0:54.2,65.9", "टिबिअलिस पूर्वकाल:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["हार्ट:4,2,5:65.3,73", "महाधमनी:4,2,5:62.9,77.6", "गुर्दे की नसें:0,4,5:57.3,59.1", "गुर्दे की धमनी:0,5,4:61.5,59.1", "जुगुलर नसें:0,2,5:60.4,86.1", "फेमोरल वेन:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["मस्तिष्क:5,4,3:50.4,96.8", "सेरिबैलम:5,4,3:56,92.6", "रीढ़ की हड्डी:0,4,3:50.7,86.8", "आसन तंत्रिका:0,4,5:59.4,37.6", "टिबिअल तंत्रिका:1,5,3:61.1,19.4", "नाड़ीग्रन्थि:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["होंठ:1,2,4:61.4,96.6", "अलिजिह्वा:6,2,0:48.6,51.8", "दाढ़:0,6,1:76.1,33", "कृन्तक दाँत:0,4,1:50.4,83", "जीभ:7,2,0:48.2,27.6", "गलतुंडिका:4,0,6:69.5,46.8", "हार्ड तालु:1,2,0:48.6,73.8", "नरम ताल:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["ललाट पालि:1,2,4:25,58.5", "टेम्पोरल लोब:0,2,3:51.2,42.2", "पेरिएटल लोब:0,1,3:66,69", "पश्चकपाल पालि:0,1,2:91,46", "सेरिबैलम:1,2,0:72.8,26.1", "ब्रेन स्टेम:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["कर्ण-शष्कुल्ली:1,2,4:8,31", "कान नहर:0,2,6:33.5,42.1", "कान का ड्रम:1,5,6:55.6,42", "औसिक्ल्स:1,0,6:54.3,52.9", "कोक्लीअ:6,1,5:75.8,45.7", "श्रवण तंत्रिका:6,2,1:91.8,48", "यूस्टेशियन ट्यूब:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["महाधमनी:8,6,3:51.7,84.7", "सुपीरियर वेना कावा:6,7,4:27.3,92", "अवर वेना कावा:1,4,3:27.8,6.8", "सही एट्रियम:4,7,0:31,54.4", "बायाँ अलिंद:7,6,0:59.6,55.5", "माइट्रल वाल्व:8,2,0:69.5,43.7", "सही वेंट्रिकल:0,1,3:47.8,38.9", "बाएं वेंट्रिकल:1,8,3:58.1,43", "त्रिकपर्दी वाल्व:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["रोशनी खो बैठते:6,3,4:11.3,57", "स्वच्छमण्डल:2,6,4:1.7,50.5", "लैंस:1,4,6:19,51.3", "रेटिना:1,6,4:64.6,76.8", "ऑप्टिक तंत्रिका:0,6,3:87.9,36.2", "पूर्वकाल कक्ष:6,4,3:7.2,51.4", "नेत्रकाचाभ द्रव:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["कोशिका केन्द्रक:5,3,2:57.3,75.5", "केन्द्रिका:2,6,4:44.5,67.9,8", "साइटोप्लाज्म:1,4,6:93.08,50.09,9", "कोशिका झिल्ली:2,5,1:90,24,14", "राइबोसोम:2,1,3:80.929,75.844,14", "माइटोकॉन्ड्रियन:1,2,3:51.4,90.35,18", "एंडोप्लाज्मिक रेटिकुलम:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["ऑक्सीजन:1,2,4:74.5,29,25", "कार्बन:2,0,4:74.5,57,25", "हाइड्रोजन:1,0,5:74.5,73.2,25", "नाइट्रोजन:1,0,2:74.5,83.5,25", "कैल्शियम:0,1,2:74.5,91.2,25", "फॉस्फोरस:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["कौन सा अंग पाचन के लिए आवश्यक पित्त उत्पन्न करता है?:0,7,6,8", "आहार नाल का पहला भाग कौन सा है जो भोजन ग्रहण करता है और लार बनाता है?:1,2,6,5", "भोजन ग्रसनी से पेट में किस अंग से होकर गुजरता है?:2,6,9,7", "पाचन तंत्र का अंतिम भाग कौन सा अंग है?:3,4,7,8", "भोजन से पोषक तत्वों और खनिजों का सर्वाधिक अवशोषण कहाँ होता है?:4,5,3,0", "भोजन के पाचन में सहायता के लिए कौन सा अंग पाचक एंजाइम और गैस्ट्रिक एसिड स्रावित करता है?:5,4,7,3", "मुंह और नाक गुहा के पीछे गले के हिस्से को क्या नाम दिया गया है?:6,2,9,8", "पित्त को छोटी आंत में छोड़ने से पहले कहाँ संग्रहीत और केंद्रित किया जाता है?:7,6,9,8", "इंसुलिन कहाँ से स्रावित होता है?:8,0,7,6", "निचले दाहिने पेट में कौन सा अंग स्थित है?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["हड्डी की संरचना क्या है जो सिर बनाती है?:0,1,9,7", "कंधे की हड्डी के रूप में भी क्या जाना जाता है?:1,9,11,6", "वक्ष गुहा को घेरने वाली अर्ध-कठोर बोनी और कार्टिलाजिनस संरचना क्या है?:2,7,8,11", "कशेरुक की परिभाषित विशेषता क्या है?:3,0,11,2", "घुटने के नीचे पैर की दो हड्डियों में से बड़ी क्या है?:4,6,9,5", "आपके शरीर की सबसे लंबी और सबसे मजबूत हड्डी कौन सी है?:5,6,9,1", "कंधे से कोहनी तक चलने वाली बांह की लंबी हड्डी कौन सी है?:6,5,1,7", "फालंजेस और कलाई के बीच हाथ की पांच हड्डियों का समूह क्या है?:7,5,1,3", "कलाई को कौन सी हड्डियाँ बनाती हैं?:8,7,9,10", "प्रत्येक पैर में सात जोड़ वाली हड्डियों का समूह क्या है?:9,7,8,1", "पैर में पांच लंबी हड्डियों का समूह क्या है?:10,8,7,4", "धड़ का निचला भाग क्या है?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["मानव कंधे के गोलाकार समोच्च को बनाने वाली मांसपेशी क्या है?:0,1,3,5", "कंधे और कोहनी के बीच ऊपरी बांह के सामने स्थित एक बड़ी पेशी क्या है?:1,0,2,3", "मानव शरीर की छाती में कौन सी पेशी स्थित होती है?:2,3,5,1", "गर्दन के पिछले भाग पर स्थित त्रिकोणीय पेशी क्या है?:3,1,2,5", "पेट की पार्श्व मांसपेशियों में सबसे बड़ी मांसपेशी कौन सी है?:4,1,2,0", "टांग के अग्र भाग में 4 पेशियों में से सबसे बड़ी कौन सी है?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["एक पेशीय अंग क्या है जो संचार प्रणाली की रक्त वाहिकाओं के माध्यम से रक्त पंप करता है?:0,1,3,5", "मानव शरीर में मुख्य और सबसे बड़ी धमनी कौन सी है?:1,4,3,2", "वे कौन सी नसें हैं जो किडनी को बाहर निकालती हैं?:2,5,4,1", "युग्मित धमनियां क्या हैं जो गुर्दे को रक्त की आपूर्ति करती हैं?:3,2,1,5", "वे कौन सी नसें हैं जो विऑक्सीजनित रक्त को सिर से वापस हृदय तक ले जाती हैं?:4,2,5,1", "जाँघ के भीतर गहरी स्थित बड़ी शिरा क्या होती है?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["तंत्रिका तंत्र के केंद्र के रूप में कार्य करने वाला अंग कौन सा है?:0,1,2,5", "सभी कशेरुकी जंतुओं के पश्च मस्तिष्क की एक प्रमुख विशेषता क्या है?:1,5,0,2", "तंत्रिका ऊतक से बनी लंबी, पतली, ट्यूबलर संरचना क्या है?:2,1,3,4", "कूल्हे के जोड़ के साथ चलने वाली बड़ी तंत्रिका क्या है?:3,2,1,5", "साइटिक तंत्रिका की एक शाखा क्या है?:4,5,2,1", "परिधीय तंत्रिका तंत्र में न्यूरॉन कोशिका निकायों का एक समूह क्या है?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["मुंह को घेरने वाली पेशीय सिलवटें क्या हैं?:0,1,4,7", "एक मांसल विस्तार क्या है जो गले के ऊपर लटकता है?:1,4,0,7", "मुंह के पीछे सपाट दांत क्या होते हैं?:2,3,5,6", "सामने के दांत क्या हैं?:3,2,5,6", "मुंह में पेशीय अंग क्या है?:4,5,6,1", "प्रतिरक्षा प्रणाली में कौन से अंग महत्वपूर्ण भूमिका निभाते हैं?:5,1,4,0", "चेहरे के कंकाल की दो हड्डियों से बनी एक पतली क्षैतिज बोनी प्लेट क्या है?:6,7,2,5", "मुंह की छत के पिछले भाग का निर्माण करने वाला कोमल ऊतक कौन सा है?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["मस्तिष्क के चार प्रमुख लोबों में सबसे बड़ा क्या है?:0,3,1,4", "कान के पीछे क्या बैठता है और दूसरा सबसे बड़ा लोब है?:1,0,3,2", "स्पर्श, तापमान, दर्द सहित संवेदना की धारणा में क्या शामिल है?:2,0,3,5", "मस्तिष्क का दृश्य प्रसंस्करण केंद्र क्या है?:3,0,1,4", "संतुलन नियंत्रण में क्या महत्वपूर्ण भूमिका निभाता है?:4,5,0,1", "हृदय गति और श्वास दर को नियंत्रित करने में क्या मदद करता है?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["कान का कौन सा भाग सिर के बाहर दिखाई देता है?:0,3,6,2", "बाहरी कान से मध्य कान तक जाने वाला मार्ग क्या है?:1,2,3,0", "त्वचा का एक पतला प्रालंब क्या है जो ड्रम की तरह कसकर फैला होता है और ध्वनि के हिट होने पर कंपन करता है?:2,0,5,3", "मध्य कान में तीन हड्डियां कौन सी हैं जो मानव शरीर की सबसे छोटी हड्डियों में से हैं?:3,0,6,2", "घोंघे के खोल जैसा क्या होता है?:4,2,0,6", "आंतरिक कान के कोक्लीअ से श्रवण संवेदी सूचना को सीधे मस्तिष्क तक कौन ले जाता है?:5,2,0,6", "श्रवण नली के रूप में भी क्या जाना जाता है?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["मानव शरीर में मुख्य और सबसे बड़ी धमनी कौन सी है?:0,3,8,6", "कौन सी नस आपके सिर, गर्दन, हाथ और छाती से रक्त वापस आपके हृदय तक ले जाती है?:1,3,0,2", "कौन सी नस आपके निचले शरीर से रक्त को वापस आपके हृदय तक ले जाती है?:2,1,0,3", "ऊपरी कक्ष कौन सा है जिसके माध्यम से रक्त हृदय के निलय में प्रवेश करता है?:3,5,6,2", "कौन सा हृदय कक्ष फेफड़ों से ऑक्सीजन युक्त रक्त प्राप्त करता है?:4,3,6,8", "कौन सा वाल्व हृदय के बाईं ओर के दो कक्षों को अलग करता है?:5,8,7,3", "पेशीय कक्ष क्या है जो हृदय से रक्त को परिसंचरण तंत्र में पंप करता है?:6,5,8,2", "हृदय के चार कक्षों में से कौन सा है?:7,0,1,2", "इसका कार्य दाएं वेंट्रिकल से दाएं आलिंद में रक्त के वापस प्रवाह को रोकना है।:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["आंख में पतली संरचना क्या है, जो पुतली के व्यास और आकार को नियंत्रित करने के लिए जिम्मेदार है?:0,1,3,2", "आँख का पारदर्शी अग्र भाग कौन सा है जो परितारिका को ढकता है?:1,2,3,0", "आंख में एक पारदर्शी संरचना क्या है जो रेटिना पर केंद्रित होने के लिए प्रकाश को अपवर्तित करने में मदद करती है?:2,3,0,1", "आँख के ऊतक की अंतरतम, प्रकाश-संवेदी परत कौन सी है?:3,1,0,2", "दृश्य सूचना को रेटिना से मस्तिष्क तक कौन पहुंचाता है?:4,6,5,3", "कॉर्निया और परितारिका के बीच आँख का अगला भाग क्या होता है?:5,6,2,3", "लेंस के पीछे और ऑप्टिक तंत्रिका के सामने कौन सा नेत्र कक्ष स्थित है?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["कोशिका के मध्य में क्या पाया जाता है और इसमें गुणसूत्रों में व्यवस्थित डीएनए होता है?:0,1,2,3", "कोशिका के भीतर कौन सा क्षेत्र कोशिका राइबोसोम के उत्पादन से संबंधित है?:1,2,3,4", "एक जेलैटिनस तरल क्या है जो एक सेल के अंदर भरता है?:2,3,4,5", "कोशिका को उसके बाहरी वातावरण से कौन बचाता है?:3,4,2,1", "एक कोशिका संरचना क्या है जो प्रोटीन का उत्पादन करती है?:4,3,2,1", "क्या रासायनिक ऊर्जा को ऊर्जा के रूप में परिवर्तित करता है जिसका उपयोग कोशिका कर सकती है?:5,4,3,2", "यूकेरियोटिक कोशिका की परिवहन प्रणाली क्या है?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["कोशिकीय श्वसन की प्रक्रिया में हमारे भोजन को ऑक्सीकृत करने के लिए किसका उपयोग किया जाता है, जिससे ऊर्जा निकलती है?:0,1,2,3", "मानव शरीर में दूसरा सबसे प्रचुर मात्रा में पाया जाने वाला तत्व कौन सा है?:1,2,3,4", "मानव शरीर को हाइड्रेट रखने के लिए किसका उपयोग किया जाता है?:2,3,4,5", "हमारे शरीर में अमीनो एसिड बनाने के लिए किसका उपयोग किया जाता है जो बदले में प्रोटीन बनाता है?:3,5,4", "हड्डियों को मजबूत बनाने और बनाए रखने के लिए किसका उपयोग किया जाता है?:4,0,1,2", "हड्डियों और दांतों के निर्माण में किसका उपयोग किया जाता है?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["ऐसा कौन सा रोग है जिसमें आपका लीवर फूल जाता है?:हेपेटाइटिस::", "वह कौन सी बीमारी है जिसमें एक परजीवी मनुष्य के जठरांत्र संबंधी मार्ग को संक्रमित करता है?:आंत्र परजीवी::", "ऐसी कौन सी बीमारी है जिसमें आपके अग्न्याशय में सूजन आ जाती है?:अग्नाशयशोथ::", "ऐसा कौन सा रोग है जिसके कारण पेट की अंदरूनी परत टूट जाती है?:आमाशय छाला::", "ऐसी कौन सी बीमारी है जिसमें आपके अपेंडिक्स में सूजन आ जाती है?:पथरी::", "ऐसी कौन सी बीमारी है जिसमें आपके पेट की अंदरूनी परत में सूजन आ जाती है?:आमाशयार्ति::", "आपके निचले मलाशय की नसों में सूजन किस बीमारी के कारण होती है?:बवासीर::", "खनिजों और लवणों से बने कठोर निक्षेप क्या हैं?:गुर्दे की पथरी::", "लंबे समय तक जिगर की क्षति के कारण जिगर का निशान क्या है?:सिरोसिस::", "सूजन आंत्र रोग का एक प्रकार क्या है?:क्रोहन रोग::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["कौन सा रोग जोड़ों में दर्द और सूजन का कारण बनता है?:गठिया::", "हड्डी की निरंतरता में विराम क्या है?:हड्डी फ्रैक्चर::", "कौन सा रोग हड्डियों को कमजोर कर देता है, जिससे वे नाजुक हो जाते हैं और उनके टूटने की संभावना अधिक हो जाती है?:ऑस्टियोपोरोसिस::", "किस रोग के कारण रीढ़ की हड्डी में एक तरफ वक्रता हो जाती है?:पार्श्वकुब्जता::", "गठिया का एक प्रकार क्या है जो अचानक, गंभीर जोड़ों के दर्द का कारण बनता है?:गाउट::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["कौन सा रोग प्रगतिशील कमजोरी और मांसपेशियों के नुकसान का कारण बनता है?:मांसपेशीय दुर्विकास::", "शारीरिक गतिविधि की कमी से कौन सा रोग होता है?:पेशीय शोष::", "कण्डरा में सूजन या जलन किस रोग के कारण होती है?:टेंडिनिटिस::", "आपकी मांसपेशियों में से एक का अचानक और अनैच्छिक संकुचन क्या है?:पेशीय ऐंठन::", "क्या होता है जब आपकी मांसपेशियां अधिक खिंच जाती हैं या फट जाती हैं?:मांसपेशी टूटना::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["एक प्रकार का कैंसर क्या है जो कोशिकाओं में शुरू होता है जो शरीर की प्रतिरक्षा प्रणाली का हिस्सा होते हैं?:लिंफोमा::", "एक प्रकार का कैंसर जो आमतौर पर अस्थि मज्जा में शुरू होता है?:लेकिमिया::", "अत्यधिक ठंडे तापमान में लंबे समय तक रहने के कारण क्या होता है?:अल्प तपावस्था::", "धीरे-धीरे पट्टिका निर्माण के कारण आपकी धमनियों का सख्त होना क्या है?:धमनीकलाकाठिन्य::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["मस्तिष्क और रीढ़ की हड्डी को ढकने वाली सुरक्षात्मक झिल्लियों की तीव्र सूजन क्या है?:मस्तिष्कावरण शोथ::", "ऐसी कौन सी बीमारी है जो आपके मस्तिष्क और रीढ़ की हड्डी को प्रभावित कर सकती है और दृष्टि, संतुलन, मांसपेशियों पर नियंत्रण की समस्या पैदा कर सकती है?:मल्टीपल स्क्लेरोसिस::", "एक मस्तिष्क विकार क्या है जिसके कारण हिलना, अकड़न और चलने, संतुलन और समन्वय में कठिनाई होती है?:पार्किंसंस रोग::", "मल्टीपल मूवमेंट टिक्स और कम से कम एक वोकल टिक की विशेषता क्या है?:टॉरेट सिंड्रोम::", "एक लाइलाज, वंशानुगत मस्तिष्क विकार क्या है जो मस्तिष्क की कोशिकाओं को नुकसान पहुंचाता है?:हनटिंग्टन रोग::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["एक गंभीर मसूड़े का संक्रमण क्या है जो नरम ऊतक को नुकसान पहुंचाता है और जो आपके दांतों को सहारा देने वाली हड्डी को नष्ट कर सकता है?:मसूढ़ की बीमारी::", "मसूड़े की बीमारी का हल्का रूप क्या है जो आपके मसूड़े की जलन, लालिमा और सूजन का कारण बनता है?:मसूड़े की सूजन::", "आपके दांतों की सख्त सतह में स्थायी रूप से क्षतिग्रस्त क्षेत्र कौन से हैं?:दांत की सड़न::", "आपके गले के पीछे टॉन्सिल का संक्रमण क्या है?:टॉन्सिल्लितिस::", "क्या होगा यदि होठ को बनाने वाला ऊतक जन्म से पहले पूरी तरह से नहीं जुड़ता है?:कटा होंठ::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["कौन सा मस्तिष्क विकार स्मृति और सोच कौशल को नष्ट कर देता है और अंत में, सबसे सरल कार्यों को करने की क्षमता को नष्ट कर देता है?:अल्जाइमर रोग::", "एक असामान्य लेकिन गंभीर स्थिति क्या है जिसमें मस्तिष्क में सूजन आ जाती है?:इंसेफेलाइटिस::", "मध्यम से गंभीर होने वाले बार-बार होने वाले सिरदर्द से होने वाला सिरदर्द विकार क्या है?:माइग्रेन::", "वह कौन सी बीमारी है जो मस्तिष्क को प्रभावित करती है और बार-बार दौरे का कारण बनती है?:मिरगी::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["क्या होता है जब कोई वायरस या बैक्टीरिया ईयरड्रम के पीछे के क्षेत्र में सूजन पैदा कर देता है?:मध्यकर्णशोथ::", "ध्वनियों को सुनने में पूर्ण या आंशिक अक्षमता का क्या अर्थ है?:बहरापन::", "वह कौन सी स्थिति है जिसमें जब ध्वनि का कोई बाहरी स्रोत नहीं होता है तो आपको ध्वनियाँ सुनाई देती हैं?:टिनिटस::", "आंतरिक कान का एक विकार क्या है जिससे चक्कर आना (चक्कर) और सुनवाई हानि हो सकती है?:मेनियार्स का रोग::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["हृदय की मांसपेशियों में रक्त के प्रवाह में कमी के कारण सीने में दर्द क्या होता है?:एनजाइना::", "रक्तचाप क्या है जो सामान्य से अधिक है?:उच्च रक्तचाप::", "क्या होता है जब हृदय की कोरोनरी धमनी में रक्त का प्रवाह कम हो जाता है या रुक जाता है?:रोधगलन::", "ऐसी कौन सी गंभीर स्थिति है जिसमें हृदय उतनी कुशलता से रक्त पंप नहीं कर पाता जितना उसे करना चाहिए?:कोंजेस्टिव दिल विफलता::", "रक्त में कोलेस्ट्रॉल के उच्च स्तर के लिए एक शब्द क्या है?:हाइपरकोलेस्ट्रोलेमिया::", "हृदय की लय की असामान्यता क्या है?:अतालता::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["आंख के लेंस में बादल वाला क्षेत्र क्या है जिससे दृष्टि में कमी आती है?:मोतियाबिंद::", "संक्रमण या एलर्जी के कारण होने वाली आंख की स्थिति क्या है?:आँख आना::", "आंख की वह स्थिति क्या है जहां आंख को मस्तिष्क से जोड़ने वाली ऑप्टिक तंत्रिका क्षतिग्रस्त हो जाती है?:आंख का रोग::", "दृष्टि का एक विकार क्या है जिसमें मस्तिष्क एक आंख से इनपुट को पूरी तरह से संसाधित करने में विफल रहता है और समय के साथ दूसरी आंख का पक्ष लेता है?:मंददृष्टि::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["एक प्रकार का कैंसर क्या है जिसमें स्तन में गांठ या स्तन के आकार में परिवर्तन शामिल हो सकता है?:स्तन कैंसर::", "सबसे आम प्रकार का कैंसर कौन सा है जो केवल पुरुषों को प्रभावित करता है?:प्रोस्टेट कैंसर::", "किस प्रकार का कैंसर है जिसमें बृहदान्त्र या मलाशय में कोशिकाएं नियंत्रण से बाहर हो जाती हैं?:कोलोरेक्टल कैंसर::", "लंबे समय तक धूम्रपान करने से किस प्रकार का कैंसर होता है?:फेफड़े का कैंसर::", "सूर्य से आने वाली पराबैंगनी किरणों के अत्यधिक संपर्क में आने से किस प्रकार का कैंसर होता है?:त्वचा कैंसर::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["आपके रक्त में सामान्य से कम ऑक्सीजन के स्तर को क्या कहा जाता है, विशेष रूप से धमनियों में?:हाइपोजेमिया::", "आपके रक्त में कैल्शियम के सामान्य से कम स्तर को क्या कहा जाता है?:कैल्शियम की कमी::", "आपके रक्त में कैल्शियम के सामान्य से अधिक स्तर को क्या कहा जाता है?:अतिकैल्शियमरक्तता::", "आपके रक्त में फॉस्फेट का सामान्य से कम स्तर क्या कहलाता है?:हाइपोफॉस्फेटेमिया::", "आपके रक्त में फॉस्फेट के सामान्य से ऊपर के स्तर को क्या कहते हैं?:हाइपरफॉस्फेटेमिया::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["त्वचा का पीला पड़ना और आपकी आंखों का सफेद होना:हेपेटाइटिस:3,4,5:", "मलाशय के आसपास दाने या खुजली:आंत्र परजीवी:2,7,8:", "मध्यम से गंभीर पेट दर्द जो आपकी पीठ तक फैल सकता है:अग्नाशयशोथ:1,3,4:", "गंभीर पेट दर्द:आमाशय छाला:6,7,8:", "अचानक दर्द जो पेट के निचले हिस्से में दाहिनी ओर से शुरू होता है:पथरी:0,3,7:", "जी मिचलाना या बार-बार पेट खराब होना:आमाशयार्ति:4,2,1:", "गुदा के आसपास अत्यधिक खुजली:बवासीर:0,2,3:", "पेशाब करते समय दर्द या जलन महसूस होना:गुर्दे की पथरी:3,9,1:", "त्वचा का पीला पड़ना और आपकी आंखों का सफेद होना:सिरोसिस:7,5,4:", "मल में खून:क्रोहन रोग:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["जोड़ों का दर्द:गठिया:1,2,3:", "तत्काल, गंभीर दर्द:हड्डी फ्रैक्चर:2,3:", "समय के साथ ऊंचाई का नुकसान:ऑस्टियोपोरोसिस:1,3,4:", "एक स्पष्ट रूप से घुमावदार रीढ़:पार्श्वकुब्जता:0,1,2:", "प्रभावित जोड़ के ऊपर लाल, चमकदार त्वचा:गाउट:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["बछड़े की बड़ी मांसपेशियां:मांसपेशीय दुर्विकास:2,3,4:", "एक हाथ या एक पैर दूसरे से छोटा होता है:पेशीय शोष:2,3,4:", "कण्डरा में दर्द जो आपके हिलने-डुलने पर बढ़ जाता है:टेंडिनिटिस:1,3,4:", "अचानक, तेज दर्द:पेशीय ऐंठन:1,2:", "अचानक दर्द जो मांसपेशियों को सिकोड़ते समय बिगड़ जाता है:मांसपेशी टूटना:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["आपकी गर्दन, बगल या कमर में लिम्फ नोड्स की दर्द रहित सूजन:लिंफोमा:2,3:", "सूजे हुए लिम्फ नोड्स, बढ़े हुए यकृत या प्लीहा:लेकिमिया:2,3:", "कांपना:अल्प तपावस्था:0,1:", "आपके हाथ या पैर में सुन्नता या कमजोरी:धमनीकलाकाठिन्य:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["अचानक तेज बुखार, तेज सिरदर्द जो सामान्य से अलग लगता है:मस्तिष्कावरण शोथ:1,2,3:", "एक आंख में अंधापन:मल्टीपल स्क्लेरोसिस:0,3,4:", "हाथों में कंपन:पार्किंसंस रोग:0,3,4:", "आंदोलन tics:टॉरेट सिंड्रोम:0,1,4:", "ध्यान केंद्रित करने में कठिनाई और याददाश्त कम हो जाती है:हनटिंग्टन रोग:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["लाल या सूजे हुए मसूड़े:मसूढ़ की बीमारी:2,3,4:", "लाल या सूजे हुए मसूड़े:मसूड़े की सूजन:2,3,4:", "दांत दर्द:दांत की सड़न:0,4,3:", "निगलने में समस्या:टॉन्सिल्लितिस:0,2,4:", "ऊपरी जबड़े की विकृति:कटा होंठ:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["तरल पदार्थ जो कान से निकलता है:मध्यकर्णशोथ:1,2,3:", "सुनवाई हानि:बहरापन:0,2,3:", "कानों में बजने वाला शोर:टिनिटस:0,1,3:", "सिर का चक्कर:मेनियार्स का रोग:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["मेघयुक्त दृष्टि:मोतियाबिंद:1,2,3:", "आँख के सफेद भाग में गुलाबी या लाल रंग:आँख आना:0,2,3:", "आंखों में तेज दर्द:आंख का रोग:0,1,3:", "खराब गहराई की धारणा और परिधीय दृष्टि:मंददृष्टि:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["स्तन या बगल में एक नई गांठ:स्तन कैंसर:1,2,3:", "पेशाब में खून:प्रोस्टेट कैंसर:2,3,4:", "आंत्र आदतों में बदलाव:कोलोरेक्टल कैंसर:1,3,4:", "एक खांसी जो 2 या 3 सप्ताह के बाद दूर नहीं होती है:फेफड़े का कैंसर:1,2,4:", "एक तिल जो रंग, आकार या खून में बदल जाता है:त्वचा कैंसर:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["त्वचा, नाखूनों और होठों में नीला रंग:हाइपोजेमिया:1,2,3:", "अपने हाथों, चेहरे और पैरों में फड़कना:कैल्शियम की कमी:0,2,4:", "अधिक बार पेशाब आना और प्यास लगना:अतिकैल्शियमरक्तता:0,1:", "हड्डियों का कमजोर होना:हाइपोफॉस्फेटेमिया:0,4:", "मांसपेशियों में ऐंठन या ऐंठन:हाइपरफॉस्फेटेमिया:0,1:"]);
  }

  void addHR(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.hr;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Jetra:1,2,3:29.2,45", "Usta:4,2,9:28.1,81.6", "jednjak:1,8,5:48.6,58.6", "Debelo crijevo:4,2,6:20.5,21", "tanko crijevo:8,7,1:52.4,19", "Želudac:4,6,7:66,41", "Ždrijelo:5,2,9:48.6,81", "Žuč:6,9,4:31.3,39.6", "Gušterača:2,1,0:50,35.1", "Crvuljak:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Lubanja:11,8,6:48,97", "lopatica:5,4,3:61.1,80.2", "Rebra:11,7,0:56,74.1", "Kralježnica:8,10,1:45.9,65.2", "Goljenična kost:5,9,3:51.4,23.6", "Bedrena kost:4,10,7:54.9,35.5", "rame:2,7,9:69.1,66.2", "Metakarpalne kosti:6,0,1:81.3,44.8", "Karpalne kosti:5,4,2:77.1,48.7", "Kosti nožja:4,3,1:49.3,6.9", "Kosti donožja:0,3,5:54.2,2.8", "zdjelice:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltoidni mišić:4,1,5:65.3,80.2", "biceps:5,0,4:67.3,71.5", "Prsni:5,0,4:52.5,76.4", "trapez:1,5,4:51.4,85.5", "Trbušni vanjski kosi:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["srce:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Bubrežne vene:0,4,5:57.3,59.1", "Bubrežna arterija:0,5,4:61.5,59.1", "Jugularne vene:0,2,5:60.4,86.1", "Femoralna vena:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["mozak:5,4,3:50.4,96.8", "cerebelum:5,4,3:56,92.6", "Leđna moždina:0,4,3:50.7,86.8", "Išijatični živac:0,4,5:59.4,37.6", "Tibialni živac:1,5,3:61.1,19.4", "Ganglij:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Usne:1,2,4:61.4,96.6", "Uvula:6,2,0:48.6,51.8", "kutnjaci:0,6,1:76.1,33", "sjekutića:0,4,1:50.4,83", "Jezik:7,2,0:48.2,27.6", "Tonzile:4,0,6:69.5,46.8", "Tvrdo nepce:1,2,0:48.6,73.8", "Meko nepce:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Prednji režanj:1,2,4:25,58.5", "Vremenski režanj:0,2,3:51.2,42.2", "Parietalni režanj:0,1,3:66,69", "okcipitalni režanj:0,1,2:91,46", "cerebelum:1,2,0:72.8,26.1", "moždano deblo:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Uška:1,2,4:8,31", "Ušni kanal:0,2,6:33.5,42.1", "bubanj za uho:1,5,6:55.6,42", "Ossicles:1,0,6:54.3,52.9", "pužnica:6,1,5:75.8,45.7", "Slušni živac:6,2,1:91.8,48", "Eustahijeva cijev:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Superiorna vena kava:6,7,4:27.3,92", "Inferior vena kava:1,4,3:27.8,6.8", "Desni atrij:4,7,0:31,54.4", "Lijevi atrij:7,6,0:59.6,55.5", "Mitralni ventil:8,2,0:69.5,43.7", "desnu komoru:0,1,3:47.8,38.9", "Lijevu klijetka:1,8,3:58.1,43", "Trikuspidalni ventil:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["šarenica:6,3,4:11.3,57", "Rožnica:2,6,4:1.7,50.5", "leća:1,4,6:19,51.3", "mrežnice:1,6,4:64.6,76.8", "optički živac:0,6,3:87.9,36.2", "Prednja komora:6,4,3:7.2,51.4", "Staklasto tijelo:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Stanična jezgra:5,3,2:57.3,75.5", "Stanična jezgrica:2,6,4:44.5,67.9,8", "Citoplazma:1,4,6:93.08,50.09,9", "Stanična membrana:2,5,1:90,24,14", "Ribosom:2,1,3:80.929,75.844,14", "Mitohondrija:1,2,3:51.4,90.35,18", "Endoplazmatski retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Kisik:1,2,4:74.5,29,25", "Ugljik:2,0,4:74.5,57,25", "Vodik:1,0,5:74.5,73.2,25", "Dušik:1,0,2:74.5,83.5,25", "Kalcij:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Koji organ proizvodi žuč potrebnu za probavu?:0,7,6,8", "Koji je prvi dio probavnog sustava koji prima hranu i proizvodi slinu?:1,2,6,5", "Kroz koji organ hrana prelazi iz ždrijela u želudac?:2,6,9,7", "Koji je organ posljednji dio probavnog sustava?:3,4,7,8", "Gdje se odvija najveća apsorpcija hranjivih tvari i minerala iz hrane?:4,5,3,0", "Koji organ luči probavne enzime i želučanu kiselinu za pomoć pri probavi hrane?:5,4,7,3", "Kako se zove dio grla iza usne i nosne šupljine?:6,2,9,8", "Gdje se žuč pohranjuje i koncentrira prije nego što se otpusti u tanko crijevo?:7,6,9,8", "Odakle se luči inzulin?:8,0,7,6", "Koji se organ nalazi u donjem desnom dijelu trbuha?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Koja je struktura kosti koja tvori glavu?:0,1,9,7", "Što je također poznato kao ramena kost?:1,9,11,6", "Što je polukruta koštana i hrskavična struktura koja okružuje torakalnu šupljinu?:2,7,8,11", "Koja je glavna karakteristika kralježnjaka?:3,0,11,2", "Koja je veća od dvije kosti u nozi ispod koljena?:4,6,9,5", "Koja je najduža i najjača kost u vašem tijelu?:5,6,9,1", "Što je duga kost u ruci koja se proteže od ramena do lakta?:6,5,1,7", "Što je skupina od pet kostiju šake između falangi i zapešća?:7,5,1,3", "Koje kosti čine zapešće?:8,7,9,10", "Što je skup od sedam zglobnih kostiju u svakom stopalu?:9,7,8,1", "Što je skupina od pet dugih kostiju u stopalu?:10,8,7,4", "Koji je donji dio trupa?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Koji je mišić koji tvori zaobljenu konturu ljudskog ramena?:0,1,3,5", "Što je veliki mišić koji leži na prednjoj strani nadlaktice između ramena i lakta?:1,0,2,3", "Koji se mišić nalazi na prsnom košu ljudskog tijela?:2,3,5,1", "Što je trokutasti mišić koji se nalazi na stražnjoj strani vrata?:3,1,2,5", "Koji je mišić najveći od bočnih trbušnih mišića?:4,1,2,0", "Koji je najveći od 4 mišića u prednjem dijelu noge?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Što je mišićni organ koji pumpa krv kroz krvne žile krvožilnog sustava?:0,1,3,5", "Koja je glavna i najveća arterija u ljudskom tijelu?:1,4,3,2", "Što su vene koje dreniraju bubreg?:2,5,4,1", "Što su uparene arterije koje opskrbljuju bubrege krvlju?:3,2,1,5", "Koje su to vene koje odvode deoksigeniranu krv iz glave natrag u srce?:4,2,5,1", "Što je velika vena koja se nalazi duboko unutar bedra?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Što je organ koji služi kao središte živčanog sustava?:0,1,2,5", "Koja je glavna značajka stražnjeg mozga svih kralježnjaka?:1,5,0,2", "Što je duga, tanka, cjevasta struktura sastavljena od živčanog tkiva?:2,1,3,4", "Što je veliki živac koji prolazi uz zglob kuka?:3,2,1,5", "Što je grana išijadičnog živca?:4,5,2,1", "Što je skupina neuronskih stanica u perifernom živčanom sustavu?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Što su mišićni nabori koji okružuju usta?:0,1,4,7", "Što je mesnati nastavak koji visi iznad grla?:1,4,0,7", "Što su ravni zubi na stražnjoj strani usta?:2,3,5,6", "Koji su prednji zubi?:3,2,5,6", "Što je mišićni organ u ustima?:4,5,6,1", "Koji organi igraju važnu ulogu u imunološkom sustavu?:5,1,4,0", "Što je tanka horizontalna koštana ploča koju čine dvije kosti kostura lica?:6,7,2,5", "Što je meko tkivo koje čini stražnji dio usnog krova?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Koji je najveći od četiri glavna režnja mozga?:0,3,1,4", "Što se nalazi iza ušiju i je li drugi najveći režanj?:1,0,3,2", "Što je uključeno u percepciju osjeta, uključujući dodir, temperaturu, bol?:2,0,3,5", "Što je centar za vizualnu obradu mozga?:3,0,1,4", "Što igra važnu ulogu u kontroli ravnoteže?:4,5,0,1", "Što pomaže u kontroli otkucaja srca i disanja?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Koji je vidljivi dio uha koji je izvan glave?:0,3,6,2", "Što je put koji ide od vanjskog uha do srednjeg uha?:1,2,3,0", "Što je tanak režanj kože koji je čvrsto zategnut poput bubnja i vibrira kada ga udari zvuk?:2,0,5,3", "Koje su tri kosti u srednjem uhu koje su među najmanjim kostima u ljudskom tijelu?:3,0,6,2", "Što podsjeća na ljusku puža?:4,2,0,6", "Što prenosi slušne senzorne informacije iz pužnice unutarnjeg uha izravno u mozak?:5,2,0,6", "Što je također poznato kao slušna cijev?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Koja je glavna i najveća arterija u ljudskom tijelu?:0,3,8,6", "Koja vena nosi krv iz glave, vrata, ruku i prsa natrag u srce?:1,3,0,2", "Koja vena nosi krv iz donjeg dijela tijela natrag u srce?:2,1,0,3", "Koja je gornja komora kroz koju krv ulazi u ventrikule srca?:3,5,6,2", "koja srčana komora prima krv zasićenu kisikom iz pluća?:4,3,6,8", "Koji ventil razdvaja dvije komore na lijevoj strani srca?:5,8,7,3", "Što je mišićna komora koja pumpa krv iz srca u krvožilni sustav?:6,5,8,2", "Koja je jedna od četiri komore srca?:7,0,1,2", "Njegova je uloga spriječiti povratni protok krvi iz desne klijetke u desni atrij.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Što je tanka struktura u oku, odgovorna za kontrolu promjera i veličine zjenice?:0,1,3,2", "Koji je prozirni prednji dio oka koji prekriva šarenicu?:1,2,3,0", "Što je to prozirna struktura u oku koja pomaže lomiti svjetlost da bi se fokusirala na mrežnicu?:2,3,0,1", "Koji je najnutarnji sloj tkiva oka osjetljiv na svjetlost?:3,1,0,2", "Što prenosi vizualne informacije od mrežnice do mozga?:4,6,5,3", "Koji je prednji dio oka između rožnice i šarenice?:5,6,2,3", "Koja se očna komora nalazi iza leće i ispred vidnog živca?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Što se nalazi u sredini stanice i sadrži DNK raspoređenu u kromosome?:0,1,2,3", "Koja se regija unutar stanice bavi proizvodnjom staničnih ribosoma?:1,2,3,4", "Što je želatinasta tekućina koja ispunjava unutrašnjost stanice?:2,3,4,5", "Što štiti stanicu od vanjskog okruženja?:3,4,2,1", "Koja je stanična struktura koja proizvodi protein?:4,3,2,1", "Što pretvara kemijsku energiju u oblik energije koji stanica može koristiti?:5,4,3,2", "Koji je transportni sustav eukariotske stanice?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Što se koristi za oksidaciju naše hrane, u procesu staničnog disanja, čime se oslobađa energija?:0,1,2,3", "Koji je drugi najzastupljeniji element u ljudskom tijelu?:1,2,3,4", "Što se koristi za održavanje hidratacije ljudskog tijela?:2,3,4,5", "Što se koristi za stvaranje aminokiselina u našem tijelu koje zauzvrat stvaraju proteine?:3,5,4", "Što se koristi za izgradnju i održavanje jakih kostiju?:4,0,1,2", "Što se koristi u formiranju kostiju i zuba?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Koja je bolest u kojoj se vaša jetra upali?:Hepatitis::", "Koja je bolest u kojoj parazit inficira gastrointestinalni trakt ljudi?:Crijevni paraziti::", "Koja je bolest u kojoj se vaša gušterača upali?:Pankreatitis::", "Koja je bolest koja uzrokuje prekid unutarnje sluznice želuca?:Čir na želucu::", "Koja je bolest u kojoj se vaše slijepo crijevo upali?:Upala slijepog crijeva::", "Koja je bolest u kojoj se vaša unutarnja sluznica želuca upali?:Gastritis::", "Koja bolest uzrokuje natečene vene u donjem dijelu rektuma?:Hemoroidi::", "Što su tvrde naslage minerala i soli?:Bubrežni kamenci::", "Što su ožiljci na jetri uzrokovani dugotrajnim oštećenjem jetre?:Ciroza::", "Koja je vrsta upalne bolesti crijeva?:Crohnova bolest::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Koja bolest uzrokuje bol i upalu u zglobu?:Artritis::", "Što je prekid kontinuiteta kosti?:Prijelom kostiju::", "Koja bolest slabi kosti, čineći ih krhkim i vjerojatnijim da će se slomiti?:Osteoporoza::", "Koja bolest uzrokuje bočnu zakrivljenost kralježnice?:Skolioza::", "Koja je vrsta artritisa koja uzrokuje iznenadnu, jaku bol u zglobovima?:Giht::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Koja bolest uzrokuje progresivnu slabost i gubitak mišićne mase?:mišićna distrofija::", "Koju bolest uzrokuje nedostatak tjelesne aktivnosti?:mišićna atrofija::", "Koja bolest uzrokuje upalu ili iritaciju tetive?:tendinitis::", "Što je iznenadna i nevoljna kontrakcija jednog od vaših mišića?:mišićni grčevi::", "Što se događa kada vam je mišić prenategnut ili potrgan?:ruptura mišića::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Koja je vrsta raka koja počinje u stanicama koje su dio imunološkog sustava tijela?:Limfom::", "Koja je vrsta raka koja obično počinje u koštanoj srži?:Leukemija::", "Što uzrokuje dugotrajno izlaganje vrlo niskim temperaturama?:Hipotermija::", "Što je otvrdnuće vaših arterija uzrokovano postupnim nakupljanjem plaka?:Ateroskleroza::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Što je akutna upala zaštitnih membrana koje prekrivaju mozak i leđnu moždinu?:Meningitis::", "Koja je to bolest koja može utjecati na vaš mozak i leđnu moždinu, a može uzrokovati probleme s vidom, ravnotežom, kontrolom mišića?:Multipla skleroza::", "Što je moždani poremećaj koji dovodi do drhtanja, ukočenosti i poteškoća s hodanjem, ravnotežom i koordinacijom?:Parkinsonova bolest::", "Što karakteriziraju višestruki tikovi pokreta i barem jedan vokalni tik?:Touretteov sindrom::", "Što je neizlječivi, nasljedni poremećaj mozga koji oštećuje moždane stanice?:Huntingtonova bolest::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Što je ozbiljna infekcija desni koja oštećuje meko tkivo i koja može uništiti kost koja podupire vaše zube?:Parodontitis::", "Koji je blagi oblik bolesti desni koji uzrokuje iritaciju, crvenilo i oticanje gingive?:gingivitis::", "Koja su trajno oštećena područja na tvrdoj površini vaših zuba?:Karijes::", "Što je infekcija krajnika u stražnjem dijelu grla?:Tonzilitis::", "Što se događa ako se tkivo koje čini usnicu ne spoji u potpunosti prije rođenja?:Napuknuta usna::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Koji poremećaj mozga uništava pamćenje i vještine razmišljanja te, na kraju, sposobnost izvršavanja najjednostavnijih zadataka?:Alzheimerova bolest::", "Koje je neuobičajeno, ali ozbiljno stanje u kojem se mozak upali?:Encefalitis::", "Što je poremećaj glavobolje karakteriziran ponavljajućim glavoboljama koje su umjerene do teške?:Migrena::", "Koja je bolest koja zahvaća mozak i uzrokuje česte napadaje?:Epilepsija::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Što se događa kada virus ili bakterija uzrokuju upalu područja iza bubnjića?:Otitis::", "Što se odnosi na potpunu ili djelomičnu nemogućnost čuti zvukove?:Gluhoća::", "U kojem stanju čujete zvukove kada ne postoji vanjski izvor zvukova?:Zujanje u ušima::", "Koji je to poremećaj unutarnjeg uha koji može dovesti do vrtoglavice (vrtoglavice) i gubitka sluha?:Meniereova bolest::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Što je bol u prsima uzrokovana smanjenim dotokom krvi u srčane mišiće?:Angina::", "Koji je krvni tlak viši od normalnog?:Hipertenzija::", "Što se događa kada se protok krvi smanji ili zaustavi u koronarnoj arteriji srca?:Infarkt miokarda::", "Koje je ozbiljno stanje u kojem srce ne pumpa krv onoliko učinkovito koliko bi trebalo?:Kongestivno zatajenje srca::", "Koja je riječ za visoku razinu kolesterola u krvi?:Hiperkolesterolemija::", "Što je abnormalnost srčanog ritma?:Aritmija::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Što je zamućeno područje očne leće koje dovodi do smanjenja vida?:Katarakta::", "Koje je stanje oka uzrokovano infekcijom ili alergijom?:Konjunktivitis::", "Koje je stanje oka u kojem se ošteti optički živac, koji povezuje oko s mozgom?:Glaukom::", "Što je poremećaj vida u kojem mozak ne uspijeva u potpunosti obraditi unose s jednog oka i s vremenom daje prednost drugom oku?:Ambliopija::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Koja je vrsta raka koja može uključivati ​​kvržicu u dojci ili promjenu oblika dojke?:Rak dojke::", "Koji je najčešći tip raka koji pogađa samo muškarce?:Rak prostate::", "Koja je vrsta raka u kojoj stanice u debelom crijevu ili rektumu rastu nekontrolirano?:Rak debelog crijeva::", "Koju vrstu raka uzrokuje dugotrajno pušenje duhana?:Rak pluća::", "Koju vrstu raka uzrokuje prekomjerno izlaganje ultraljubičastim zrakama sunca?:Rak kože::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Kako se zove razina kisika ispod normalne u vašoj krvi, točnije u arterijama?:Hipoksemija::", "Kako se zove razina kalcija u krvi ispod normale?:Hipokalcemija::", "Kako se zove natnormalna razina kalcija u krvi?:Hiperkalcemija::", "Kako se zove razina fosfata u krvi ispod normale?:hipofosfatemija::", "Kako se zove iznad normalne razine fosfata u krvi?:Hiperfosfatemija::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Žutilo kože i bjeloočnica:Hepatitis:3,4,5:", "Osip ili svrbež oko rektuma:Crijevni paraziti:2,7,8:", "Umjerena do jaka bol u trbuhu koja se može proširiti na leđa:Pankreatitis:1,3,4:", "Jaka bol u želucu:Čir na želucu:6,7,8:", "Iznenadna bol koja počinje s desne strane donjeg dijela trbuha:Upala slijepog crijeva:0,3,7:", "Mučnina ili ponavljajuća smetnja u želucu:Gastritis:4,2,1:", "Ekstremni svrbež oko anusa:Hemoroidi:0,2,3:", "Bol ili peckanje tijekom mokrenja:Bubrežni kamenci:3,9,1:", "Žutilo kože i bjeloočnica:Ciroza:7,5,4:", "Krv u stolici:Crohnova bolest:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["bol u zglobovima:Artritis:1,2,3:", "trenutna, jaka bol:Prijelom kostiju:2,3:", "Gubitak visine tijekom vremena:Osteoporoza:1,3,4:", "vidljivo zakrivljenu kralježnicu:Skolioza:0,1,2:", "crvena, sjajna koža preko zahvaćenog zgloba:Giht:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Veliki mišići potkoljenice:mišićna distrofija:2,3,4:", "Jedna ruka ili jedna noga je manja od druge:mišićna atrofija:2,3,4:", "bol u tetivi koja se pogoršava kada se krećete:tendinitis:1,3,4:", "Iznenadna, oštra bol:mišićni grčevi:1,2:", "iznenadna bol koja se pogoršava tijekom kontrakcije mišića:ruptura mišića:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Bezbolno oticanje limfnih čvorova na vratu, pazuhu ili preponama:Limfom:2,3:", "Natečeni limfni čvorovi, povećana jetra ili slezena:Leukemija:2,3:", "Drhtanje:Hipotermija:0,1:", "Utrnulost ili slabost u rukama ili nogama:Ateroskleroza:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Iznenadna visoka temperatura, jaka glavobolja koja se čini drukčijom od normalne:Meningitis:1,2,3:", "sljepoća na jedno oko:Multipla skleroza:0,3,4:", "Tremor u rukama:Parkinsonova bolest:0,3,4:", "tikovi pokreta:Touretteov sindrom:0,1,4:", "poteškoće s koncentracijom i propuste u pamćenju:Huntingtonova bolest:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Crvene ili natečene desni:Parodontitis:2,3,4:", "Crvene ili natečene desni:gingivitis:2,3,4:", "Zubobolja:Karijes:0,4,3:", "problemi s gutanjem:Tonzilitis:0,2,4:", "Deformacije gornje čeljusti:Napuknuta usna:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["tekućina koja curi iz uha:Otitis:1,2,3:", "Gubitak sluha:Gluhoća:0,2,3:", "zujanje u ušima:Zujanje u ušima:0,1,3:", "vrtoglavica:Meniereova bolest:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Zamagljen vid:Katarakta:1,2,3:", "Ružičasta ili crvena boja u bjelini oka:Konjunktivitis:0,2,3:", "intenzivna bol u oku:Glaukom:0,1,3:", "Loša percepcija dubine i periferni vid:Ambliopija:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Nova kvržica u dojci ili ispod pazuha:Rak dojke:1,2,3:", "Krv u mokraći:Rak prostate:2,3,4:", "Promjena navika crijeva:Rak debelog crijeva:1,3,4:", "kašalj koji ne prolazi nakon 2 ili 3 tjedna:Rak pluća:1,2,4:", "Madež koji mijenja boju, veličinu ili krvari:Rak kože:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Plavkasta boja kože, noktiju i usana:Hipoksemija:1,2,3:", "Trzanje u rukama, licu i stopalima:Hipokalcemija:0,2,4:", "Češće mokrenje i žeđ:Hiperkalcemija:0,1:", "slabljenje kostiju:hipofosfatemija:0,4:", "grčevi ili grčevi u mišićima:Hiperfosfatemija:0,1:"]);
  }

  void addHU(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.hu;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Máj:1,2,3:29.2,45", "Száj:4,2,9:28.1,81.6", "Nyelőcső:1,8,5:48.6,58.6", "vastagbél:4,2,6:20.5,21", "vékonybél:8,7,1:52.4,19", "Gyomor:4,6,7:66,41", "Garat:5,2,9:48.6,81", "epehólyag:6,9,4:31.3,39.6", "Hasnyálmirigyre:2,1,0:50,35.1", "Féregnyúlvány:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Koponya:11,8,6:48,97", "Lapocka:5,4,3:61.1,80.2", "bordák:11,7,0:56,74.1", "Gerinc:8,10,1:45.9,65.2", "Sípcsont:5,9,3:51.4,23.6", "combcsont:4,10,7:54.9,35.5", "Felkarcsont:2,7,9:69.1,66.2", "Metakarbális csontok:6,0,1:81.3,44.8", "pontycsontok:5,4,2:77.1,48.7", "cérnacsontok:4,3,1:49.3,6.9", "Lábközépcsont:0,3,5:54.2,2.8", "Csontos medence:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltaizom:4,1,5:65.3,80.2", "biceps:5,0,4:67.3,71.5", "A mellizom:5,0,4:52.5,76.4", "Trapézizom:1,5,4:51.4,85.5", "Hasi külső ferde izom:1,5,0:54.2,65.9", "Tibialis elülső:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Szív:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Vesevénák:0,4,5:57.3,59.1", "Vese artéria:0,5,4:61.5,59.1", "Nyaki véna:0,2,5:60.4,86.1", "Femorális véna:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Agy:5,4,3:50.4,96.8", "Kisagy:5,4,3:56,92.6", "gerincvelő:0,4,3:50.7,86.8", "Ülőideg:0,4,5:59.4,37.6", "Tibiális ideg:1,5,3:61.1,19.4", "Idegdúc:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Ajkak:1,2,4:61.4,96.6", "nyelvcsap:6,2,0:48.6,51.8", "zápfogak:0,6,1:76.1,33", "metszőfog:0,4,1:50.4,83", "Nyelv:7,2,0:48.2,27.6", "Mandula:4,0,6:69.5,46.8", "Kemény szájpad:1,2,0:48.6,73.8", "lágy szájpad:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Elülső lebeny:1,2,4:25,58.5", "Időbeli lebeny:0,2,3:51.2,42.2", "Parietális lebeny:0,1,3:66,69", "Occipitalis lebeny:0,1,2:91,46", "Kisagy:1,2,0:72.8,26.1", "agytörzsi:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Fülkagyló:1,2,4:8,31", "Fülcsatorna:0,2,6:33.5,42.1", "Füldob:1,5,6:55.6,42", "ossicles:1,0,6:54.3,52.9", "Csiga:6,1,5:75.8,45.7", "Hallóideg:6,2,1:91.8,48", "fülkürt:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Vena cava superior:6,7,4:27.3,92", "Vena cava inferior:1,4,3:27.8,6.8", "Jobb pitvar:4,7,0:31,54.4", "Bal oldali átrium:7,6,0:59.6,55.5", "Mitrális szelep:8,2,0:69.5,43.7", "Jobb kamra:0,1,3:47.8,38.9", "bal kamra:1,8,3:58.1,43", "Tricuspid szelep:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["írisz:6,3,4:11.3,57", "szaruhártya:2,6,4:1.7,50.5", "szemlencse:1,4,6:19,51.3", "recehártya:1,6,4:64.6,76.8", "látóideg:0,6,3:87.9,36.2", "Elülső kamra:6,4,3:7.2,51.4", "üvegtest:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Sejtmag:5,3,2:57.3,75.5", "Sejtmagvacska:2,6,4:44.5,67.9,8", "Citoplazma:1,4,6:93.08,50.09,9", "Sejthártya:2,5,1:90,24,14", "Riboszóma:2,1,3:80.929,75.844,14", "Mitokondrium:1,2,3:51.4,90.35,18", "Endoplazmatikus retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oxigén:1,2,4:74.5,29,25", "Szén:2,0,4:74.5,57,25", "Hidrogén:1,0,5:74.5,73.2,25", "Nitrogén:1,0,2:74.5,83.5,25", "Kalcium:0,1,2:74.5,91.2,25", "Foszfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Melyik szerv termeli az emésztéshez szükséges epét?:0,7,6,8", "Mi az emésztőcsatorna első része, amely táplálékot kap és nyálat termel?:1,2,6,5", "Melyik szerven keresztül jut el a táplálék a garatból a gyomorba?:2,6,9,7", "Melyik szerv az emésztőrendszer utolsó része?:3,4,7,8", "Hol szívódnak fel a legtöbb tápanyag és ásványi anyag az élelmiszerekből?:4,5,3,0", "Melyik szerv választja ki az emésztőenzimeket és a gyomorsavat, hogy segítse az emésztést?:5,4,7,3", "Hogyan nevezik a torok száj és orrüreg mögötti részét?:6,2,9,8", "Hol tárolódik és koncentrálódik az epe, mielőtt a vékonybélbe kerül?:7,6,9,8", "Honnan választódik ki az inzulin?:8,0,7,6", "Melyik szerv található a jobb alsó hasban?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Mi az a csontszerkezet, amely a fejet alkotja?:0,1,9,7", "Mit neveznek vállcsontnak?:1,9,11,6", "Mi az a félmerev csontos és porcos szerkezet, amely körülveszi a mellüreget?:2,7,8,11", "Mi a gerinces állat meghatározó tulajdonsága?:3,0,11,2", "Melyik a nagyobb a térd alatti láb két csontja közül?:4,6,9,5", "Melyik a leghosszabb és legerősebb csont a testedben?:5,6,9,1", "Mi az a hosszú csont a karban, amely a válltól a könyökig tart?:6,5,1,7", "Mi az a kéz öt csontból álló csoportja a phalangusok és a csukló között?:7,5,1,3", "Milyen csontok alkotják a csuklót?:8,7,9,10", "Mi az a hét ízületi csontból álló csoport minden lábfejben?:9,7,8,1", "Mit jelent az öt hosszú csontból álló csoport a lábfejben?:10,8,7,4", "Mi a törzs alsó része?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Mi az az izom, amely az emberi váll lekerekített kontúrját alkotja?:0,1,3,5", "Mi az a nagy izom, amely a felkar elején, a váll és a könyök között fekszik?:1,0,2,3", "Milyen izom található az emberi test mellkasán?:2,3,5,1", "Mi az a háromszög alakú izom, amely a nyak hátsó részén található?:3,1,2,5", "Melyik izom a legnagyobb az oldalsó hasizmok közül?:4,1,2,0", "Mi a legnagyobb a láb elülső részében lévő 4 izom közül?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Mi az az izmos szerv, amely a vért a keringési rendszer ereiben pumpálja?:0,1,3,5", "Mi az emberi test fő és legnagyobb artériája?:1,4,3,2", "Mik azok a vénák, amelyek kiürítik a vesét?:2,5,4,1", "Mik azok a páros artériák, amelyek a veséket vérrel látják el?:3,2,1,5", "Melyek azok a vénák, amelyek oxigéntelenített vért visznek vissza a fejből a szívbe?:4,2,5,1", "Mi az a nagy véna, amely mélyen a combban található?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Mi az a szerv, amely az idegrendszer központjaként szolgál?:0,1,2,5", "Mi az összes gerinces hátsó agyának fő jellemzője?:1,5,0,2", "Mi az a hosszú, vékony, csőszerű idegszövetből álló szerkezet?:2,1,3,4", "Mi az a nagy ideg, amely a csípőízület mellett fut?:3,2,1,5", "Mi az ülőideg egyik ága?:4,5,2,1", "Mi az idegsejttestek csoportja a perifériás idegrendszerben?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Mik azok az izmos redők, amelyek körülölelik a szájat?:0,1,4,7", "Mi az a húsos nyúlvány, amely a torok fölött lóg?:1,4,0,7", "Mik azok a lapos fogak a száj hátsó részén?:2,3,5,6", "Mik az első fogak?:3,2,5,6", "Mi az az izmos szerv a szájban?:4,5,6,1", "Milyen szervek játszanak fontos szerepet az immunrendszerben?:5,1,4,0", "Mi az a vékony vízszintes csontlemez, amely az arcváz két csontjából áll?:6,7,2,5", "Mi az a lágyszövet, amely a szájtető hátsó részét alkotja?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Melyik a legnagyobb az agy négy fő lebenye közül?:0,3,1,4", "Mi ül a fülek mögött, és a második legnagyobb lebeny?:1,0,3,2", "Mi vesz részt az érzékelés észlelésében, beleértve az érintést, a hőmérsékletet, a fájdalmat?:2,0,3,5", "Mi az agy vizuális feldolgozó központja?:3,0,1,4", "Mi játszik fontos szerepet az egyensúlyszabályozásban?:4,5,0,1", "Mi segít a pulzusszám és a légzés szabályozásában?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Mi az a fül látható része, amely a fejen kívül van?:0,3,6,2", "Milyen út vezet a külső fültől a középfülig?:1,2,3,0", "Mi az a vékony bőrleben, amely szorosan megfeszül, mint egy dob, és rezeg, amikor hang éri?:2,0,5,3", "Melyik az a három csont a középfülben, amelyek az emberi test legkisebb csontjai közé tartoznak?:3,0,6,2", "Mi hasonlít egy csiga héjához?:4,2,0,6", "Mi szállítja a hallási szenzoros információt a belső fül fülcsigából közvetlenül az agyba?:5,2,0,6", "Mit is neveznek hallócsőnek?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Mi az emberi test fő és legnagyobb artériája?:0,3,8,6", "Melyik véna viszi vissza a vért a fejedből, a nyakadból, a karjaidból és a mellkasodból a szívedbe?:1,3,0,2", "Melyik ér viszi vissza a vért az alsótestedből a szívedbe?:2,1,0,3", "Mi az a felső kamra, amelyen keresztül a vér belép a szívkamrákba?:3,5,6,2", "melyik szívkamra kapja az oxigéndús vért a tüdőből?:4,3,6,8", "Milyen szelep választja el a szív bal oldalán lévő két kamrát?:5,8,7,3", "Mi az az izmos kamra, amely kipumpálja a vért a szívből a keringési rendszerbe?:6,5,8,2", "Melyik a szív négy kamrája közül az egyik?:7,0,1,2", "Feladata, hogy megakadályozza a vér visszaáramlását a jobb kamrából a jobb pitvarba.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Mi az a vékony szerkezet a szemben, amely a pupilla átmérőjének és méretének szabályozásáért felelős?:0,1,3,2", "Mi a szem átlátszó elülső része, amely az íriszt takarja?:1,2,3,0", "Mi az az átlátszó szerkezet a szemben, amely segít megtörni a fényt, hogy a retinára fókuszáljon?:2,3,0,1", "Mi a szem legbelső, fényérzékeny szövetrétege?:3,1,0,2", "Mi továbbítja a vizuális információt a retinából az agyba?:4,6,5,3", "Mi a szem elülső része a szaruhártya és az írisz között?:5,6,2,3", "Milyen szemkamra található a lencse mögött és a látóideg előtt?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Mi található a sejt közepén, és kromoszómákba rendezett DNS-t tartalmaz?:0,1,2,3", "A sejten belül melyik régió foglalkozik a sejt riboszómák termelésével?:1,2,3,4", "Mi az a kocsonyás folyadék, amely kitölti a sejt belsejét?:2,3,4,5", "Mi védi a sejtet a külső környezettől?:3,4,2,1", "Mi az a sejtszerkezet, amely fehérjét termel?:4,3,2,1", "Mi alakítja át a kémiai energiát olyan energiaformává, amelyet a sejt felhasználhat?:5,4,3,2", "Mi az eukarióta sejt szállítási rendszere?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Mit használunk táplálékunk oxidálására, a sejtlégzés folyamatában, így energia szabadul fel?:0,1,2,3", "Mi a második legnagyobb mennyiségben előforduló elem az emberi szervezetben?:1,2,3,4", "Mit használnak az emberi test hidratáltságának megőrzésére?:2,3,4,5", "Mit használnak a szervezetünkben aminosavak előállítására, amelyek viszont fehérjéket termelnek?:3,5,4", "Mit használnak az erős csontok építésére és fenntartására?:4,0,1,2", "Mit használnak a csontok és a fogak kialakításában?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Milyen betegség esetén begyullad a máj?:Májgyulladás::", "Mi az a betegség, amelyben egy parazita megfertőzi az ember gyomor-bélrendszerét?:Bélparaziták::", "Milyen betegség esetén begyullad a hasnyálmirigye?:Hasnyálmirigy-gyulladás::", "Mi az a betegség, amely a gyomor belső nyálkahártyájának törést okoz?:Gyomorfekély::", "Milyen betegség esetén begyullad a vakbéled?:Vakbélgyulladás::", "Mi az a betegség, amelyben a gyomor belső nyálkahártyája begyullad?:Gyomorhurut::", "Milyen betegség okozza a vénák duzzadását az alsó végbélben?:Aranyér::", "Mik azok az ásványi anyagokból és sókból álló kemény lerakódások?:Vesekövek::", "Mi a máj hegesedése, amelyet hosszú távú májkárosodás okoz?:Cirrózis::", "Mi a gyulladásos bélbetegség egyik fajtája?:Crohn-betegség::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Milyen betegség okoz fájdalmat és gyulladást az ízületekben?:Ízületi gyulladás::", "Mit jelent a csont folytonosságának megszakadása?:Csonttörés::", "Milyen betegség gyengíti a csontokat, ami törékennyé és nagyobb valószínűséggel törik el?:Csontritkulás::", "Milyen betegség okozza a gerinc oldalirányú görbületét?:Gerincferdülés::", "Milyen típusú ízületi gyulladás okoz hirtelen, súlyos ízületi fájdalmat?:Köszvény::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Milyen betegség okoz progresszív gyengeséget és izomtömeg-veszteséget?:izomsorvadás::", "Milyen betegségeket okozhat a fizikai aktivitás hiánya?:izomsorvadás::", "Milyen betegség okozza az íngyulladást vagy irritációt?:ínhüvelygyulladás::", "Mi az egyik izom hirtelen és akaratlan összehúzódása?:izomgörcsök::", "Mi történik, ha az izom túlfeszül vagy elszakad?:izomszakadás::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Mi az a ráktípus, amely a szervezet immunrendszerének részét képező sejtekben kezdődik?:Limfóma::", "Mi az a ráktípus, amely általában a csontvelőben kezdődik?:Leukémia::", "Mit okoz a nagyon hideg hőmérsékletnek való hosszan tartó kitettség?:Hypothermia::", "Mi okozza az artériák megkeményedését a fokozatos plakk felhalmozódása?:Érelmeszesedés::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Mi az agyat és a gerincvelőt borító védőhártyák akut gyulladása?:Agyhártyagyulladás::", "Milyen betegség érintheti az agyat és a gerincvelőt, és problémákat okozhat a látásban, az egyensúlyban, az izomszabályozásban?:Sclerosis multiplex::", "Mi az az agyi rendellenesség, amely remegéshez, merevséghez és járás-, egyensúly- és koordinációs nehézségekhez vezet?:Parkinson kór::", "Mire jellemző a többszörös mozgásos tic és legalább egy vokális tic?:Tourette-szindróma::", "Mi az a gyógyíthatatlan, örökletes agyi rendellenesség, amely károsítja az agysejteket?:Huntington-kór::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Mi az a súlyos ínyfertőzés, amely károsítja a lágyszöveteket, és tönkreteheti a fogakat tartó csontot?:Parodontitis::", "Mi az ínybetegség enyhe formája, amely irritációt, bőrpírt és ínyduzzanatot okoz?:fogínygyulladás::", "Melyek a tartósan károsodott területek a fogak kemény felületén?:Fogszuvasodás::", "Mi a torka hátsó részén lévő mandulák fertőzése?:Mandulagyulladás::", "Mi történik, ha az ajkakat alkotó szövet nem kapcsolódik össze teljesen a születés előtt?:Ajkahasadék::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Milyen agyi rendellenesség teszi tönkre a memóriát és a gondolkodási készségeket, és végül a legegyszerűbb feladatok elvégzésének képességét?:Alzheimer kór::", "Mi az a nem gyakori, de súlyos állapot, amelyben az agy begyullad?:Agyvelőgyulladás::", "Mi az a fejfájás, amelyet visszatérő, közepesen súlyos vagy súlyos fejfájás jellemez?:Migrén::", "Mi az az agyat érintő és gyakori görcsrohamokat okozó betegség?:Epilepszia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Mi történik, ha egy vírus vagy baktérium okozza a dobhártya mögötti terület gyulladását?:Otitis::", "Mit jelent a hangok teljes vagy részleges hallásának képtelensége?:Süketség::", "Milyen állapotban hallasz hangokat, ha nincs külső hangforrás?:Fülzúgás::", "Mi az a belső fül rendellenesség, amely szédüléshez (szédüléshez) és halláskárosodáshoz vezethet?:Meniere-kór::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Mi az a mellkasi fájdalom, amelyet a szívizmok csökkent véráramlása okoz?:Angina::", "Mi az a vérnyomás, amely magasabb a normálnál?:Magas vérnyomás::", "Mi történik, ha a szív koszorúérében csökken vagy leáll a véráramlás?:Miokardiális infarktus::", "Mi az a súlyos állapot, amelyben a szív nem pumpálja a vért olyan hatékonyan, mint kellene?:Pangásos szívelégtelenség::", "Mit jelent a magas koleszterinszint a vérben?:Hiperkoleszterinémia::", "Mi a szívritmuszavar?:Szívritmuszavar::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Mi az a felhős terület a szemlencsében, amely a látás romlásához vezet?:Szürkehályog::", "Mi az a szembetegség, amelyet fertőzés vagy allergia okoz?:Kötőhártya-gyulladás::", "Mi az a szembetegség, amikor a szemet az agyvel összekötő látóideg megsérül?:Glaukóma::", "Mi az a látászavar, amelyben az agy nem tudja teljesen feldolgozni az egyik szemről érkező bemeneteket, és idővel a másik szemnek kedvez?:Amblyopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Mi az a ráktípus, amely magában foglalhat egy csomót a mellben vagy a mell alakjának megváltozását?:Mellrák::", "Mi a rák leggyakoribb típusa, amely csak férfiakat érint?:Prosztata rák::", "Mi az a ráktípus, amelyben a vastag- vagy végbél sejtjei ellenőrizetlenül növekednek?:Colorectalis rák::", "Milyen típusú rákot okozhat a tartós dohányzás?:Tüdőrák::", "Milyen típusú rákot okoz a nap ultraibolya sugárzásának túlzott kitettsége?:Bőr rák::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Hogyan nevezik a vérben a normál alatti oxigénszintet, különösen az artériákban?:Hipoxémia::", "Hogyan nevezzük a vérben a normál alatti kalciumszintet?:Hipokalcémia::", "Hogyan nevezzük a vérben a normálisnál magasabb kalciumszintet?:Hiperkalcémia::", "Hogyan nevezik a vérben a normál alatti foszfátszintet?:hipofoszfatémia::", "Hogyan nevezzük a vérben a normál feletti foszfátszintet?:Hiperfoszfatémia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["A bőr és a szemfehérje besárgulása:Májgyulladás:3,4,5:", "Kiütés vagy viszketés a végbél körül:Bélparaziták:2,7,8:", "Mérsékelt vagy súlyos hasi fájdalom, amely átterjedhet a hátára:Hasnyálmirigy-gyulladás:1,3,4:", "Súlyos gyomorfájdalom:Gyomorfekély:6,7,8:", "Hirtelen fájdalom, amely az alsó has jobb oldalán kezdődik:Vakbélgyulladás:0,3,7:", "Hányinger vagy visszatérő gyomorpanaszok:Gyomorhurut:4,2,1:", "Erős viszketés a végbélnyílás körül:Aranyér:0,2,3:", "Fájdalom vagy égő érzés vizelés közben:Vesekövek:3,9,1:", "A bőr és a szemfehérje besárgulása:Cirrózis:7,5,4:", "Vér a székletben:Crohn-betegség:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["ízületi fájdalom:Ízületi gyulladás:1,2,3:", "azonnali, erős fájdalom:Csonttörés:2,3:", "Magasságvesztés az idő múlásával:Csontritkulás:1,3,4:", "láthatóan ívelt gerinc:Gerincferdülés:0,1,2:", "vörös, fényes bőr az érintett ízületen:Köszvény:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Nagy vádli izmok:izomsorvadás:2,3,4:", "Az egyik kar vagy láb kisebb, mint a másik:izomsorvadás:2,3,4:", "ínfájdalom, amely mozgás közben fokozódik:ínhüvelygyulladás:1,3,4:", "Hirtelen, éles fájdalom:izomgörcsök:1,2:", "hirtelen fájdalom, amely az izomösszehúzódás során fokozódik:izomszakadás:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Nyirokcsomók fájdalommentes duzzanata a nyakban, a hónaljban vagy az ágyékban:Limfóma:2,3:", "Duzzadt nyirokcsomók, megnagyobbodott máj vagy lép:Leukémia:2,3:", "Reszketés:Hypothermia:0,1:", "Zsibbadás vagy gyengeség a karokban vagy a lábakban:Érelmeszesedés:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Hirtelen magas láz, erős fejfájás, ami a szokásostól eltérőnek tűnik:Agyhártyagyulladás:1,2,3:", "vakság az egyik szemében:Sclerosis multiplex:0,3,4:", "Remegés a kezekben:Parkinson kór:0,3,4:", "mozgás tics:Tourette-szindróma:0,1,4:", "koncentrációs nehézségek és memóriazavarok:Huntington-kór:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Vörös vagy duzzadt íny:Parodontitis:2,3,4:", "Vörös vagy duzzadt íny:fogínygyulladás:2,3,4:", "Fogfájás:Fogszuvasodás:0,4,3:", "nyelési problémák:Mandulagyulladás:0,2,4:", "A felső állkapocs deformitásai:Ajkahasadék:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["a fülből kifolyó folyadék:Otitis:1,2,3:", "Hallásvesztés:Süketség:0,2,3:", "csengő hang a fülben:Fülzúgás:0,1,3:", "szédülés:Meniere-kór:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Felhős látás:Szürkehályog:1,2,3:", "Rózsaszín vagy vörös szín a szem fehérjében:Kötőhártya-gyulladás:0,2,3:", "intenzív szemfájdalom:Glaukóma:0,1,3:", "Rossz mélységérzékelés és perifériás látás:Amblyopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Új csomó a mellben vagy a hónaljban:Mellrák:1,2,3:", "Vér a vizeletben:Prosztata rák:2,3,4:", "A székelési szokások megváltozása:Colorectalis rák:1,3,4:", "köhögés, amely 2-3 hét után sem múlik el:Tüdőrák:1,2,4:", "Anyajegy, amelynek színe, mérete megváltozik vagy vérzik:Bőr rák:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Kékes színű a bőr, a köröm és az ajkak:Hipoxémia:1,2,3:", "Rángat a kezedben, az arcodban és a lábadban:Hipokalcémia:0,2,4:", "Gyakoribb vizelés és szomjúság:Hiperkalcémia:0,1:", "a csontok gyengülése:hipofoszfatémia:0,4:", "izomgörcsök vagy görcsök:Hiperfoszfatémia:0,1:"]);
  }

  void addID(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.id;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Hati:1,2,3:29.2,45", "Mulut:4,2,9:28.1,81.6", "Esofagus:1,8,5:48.6,58.6", "Usus besar:4,2,6:20.5,21", "Usus kecil:8,7,1:52.4,19", "Perut:4,6,7:66,41", "Faring:5,2,9:48.6,81", "Kantung empedu:6,9,4:31.3,39.6", "Pankreas:2,1,0:50,35.1", "Umbai cacing:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Tengkorak:11,8,6:48,97", "Skapula:5,4,3:61.1,80.2", "Tulang rusuk:11,7,0:56,74.1", "Tulang Belakang:8,10,1:45.9,65.2", "Tulang kering:5,9,3:51.4,23.6", "Tulang paha:4,10,7:54.9,35.5", "Tulang lengan atas:2,7,9:69.1,66.2", "Metakarpus:6,0,1:81.3,44.8", "Karpus:5,4,2:77.1,48.7", "tulang tarsal:4,3,1:49.3,6.9", "Tulang metatarsal:0,3,5:54.2,2.8", "Pelvis:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Otot deltoideus:4,1,5:65.3,80.2", "Bisep:5,0,4:67.3,71.5", "Pektoral:5,0,4:52.5,76.4", "Otot trapezius:1,5,4:51.4,85.5", "Miring eksternal abdomen:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Jantung:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Vena ginjal:0,4,5:57.3,59.1", "Arteri ginjal:0,5,4:61.5,59.1", "Vena jugularis:0,2,5:60.4,86.1", "Vena femoralis:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Otak:5,4,3:50.4,96.8", "Otak kecil:5,4,3:56,92.6", "sumsum tulang belakang:0,4,3:50.7,86.8", "Saraf siatik:0,4,5:59.4,37.6", "Saraf Tibial:1,5,3:61.1,19.4", "Ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Bibir:1,2,4:61.4,96.6", "anak lidah:6,2,0:48.6,51.8", "Molar:0,6,1:76.1,33", "Gigi seri:0,4,1:50.4,83", "Lidah:7,2,0:48.2,27.6", "Mandel:4,0,6:69.5,46.8", "langit-langit keras:1,2,0:48.6,73.8", "Langit-langit lunak:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Lobus frontalis:1,2,4:25,58.5", "Lobus temporalis:0,2,3:51.2,42.2", "Lobus parietal:0,1,3:66,69", "Lobus oksipital:0,1,2:91,46", "Otak kecil:1,2,0:72.8,26.1", "Batang otak:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Daun telinga:1,2,4:8,31", "Kanal telinga:0,2,6:33.5,42.1", "Gendang telinga:1,5,6:55.6,42", "Osikel:1,0,6:54.3,52.9", "koklea:6,1,5:75.8,45.7", "Saraf pendengaran:6,2,1:91.8,48", "Eustachio tube:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Vena kava superior:6,7,4:27.3,92", "Vena cava inferior:1,4,3:27.8,6.8", "Atrium kanan:4,7,0:31,54.4", "Atrium kiri:7,6,0:59.6,55.5", "Katup mitral:8,2,0:69.5,43.7", "Ventrikel kanan:0,1,3:47.8,38.9", "Ventrikel kiri:1,8,3:58.1,43", "katup trikuspid:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Selaput pelangi:6,3,4:11.3,57", "Kornea:2,6,4:1.7,50.5", "Lensa:1,4,6:19,51.3", "Retina:1,6,4:64.6,76.8", "Saraf optik:0,6,3:87.9,36.2", "bilik anterior:6,4,3:7.2,51.4", "Badan bening:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Inti:5,3,2:57.3,75.5", "Nukleolus:2,6,4:44.5,67.9,8", "Sitoplasma:1,4,6:93.08,50.09,9", "Membran sel:2,5,1:90,24,14", "Ribosom:2,1,3:80.929,75.844,14", "Mitokondria:1,2,3:51.4,90.35,18", "Retikulum endoplasma:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oksigen:1,2,4:74.5,29,25", "Karbon:2,0,4:74.5,57,25", "Hidrogen:1,0,5:74.5,73.2,25", "Nitrogen:1,0,2:74.5,83.5,25", "Kalsium:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Organ apa yang menghasilkan empedu yang diperlukan untuk pencernaan?:0,7,6,8", "Apa bagian pertama dari saluran pencernaan yang menerima makanan dan menghasilkan air liur?:1,2,6,5", "Melalui organ mana makanan melewati dari faring ke lambung?:2,6,9,7", "Organ apa yang merupakan bagian terakhir dari sistem pencernaan?:3,4,7,8", "Di manakah penyerapan zat gizi dan mineral dari makanan paling banyak terjadi?:4,5,3,0", "Organ apa yang mengeluarkan enzim pencernaan dan asam lambung untuk membantu pencernaan makanan?:5,4,7,3", "Apa nama bagian tenggorokan di belakang mulut dan rongga hidung?:6,2,9,8", "Di mana empedu disimpan dan dipekatkan sebelum dilepaskan ke usus kecil?:7,6,9,8", "Dari mana insulin disekresi?:8,0,7,6", "Organ apa yang terletak di perut kanan bawah?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Apa struktur tulang yang membentuk kepala?:0,1,9,7", "Apa yang disebut juga sebagai tulang bahu?:1,9,11,6", "Apa yang dimaksud dengan struktur tulang dan tulang rawan semi-kaku yang mengelilingi rongga dada?:2,7,8,11", "Apa ciri khas dari vertebrata?:3,0,11,2", "Apa yang lebih besar dari dua tulang di kaki di bawah lutut?:4,6,9,5", "Apa tulang terpanjang dan terkuat di tubuh Anda?:5,6,9,1", "Apa tulang panjang di lengan yang membentang dari bahu ke siku?:6,5,1,7", "Apa kelompok lima tulang tangan antara falang dan pergelangan tangan?:7,5,1,3", "Tulang apa yang menyusun pergelangan tangan?:8,7,9,10", "Apa yang dimaksud dengan kelompok tujuh tulang artikulasi di setiap kaki?:9,7,8,1", "Apa yang dimaksud dengan kelompok lima tulang panjang di kaki?:10,8,7,4", "Apa bagian bawah batang tubuh?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Apa otot yang membentuk kontur bulat bahu manusia?:0,1,3,5", "Apa otot besar yang terletak di bagian depan lengan atas antara bahu dan siku?:1,0,2,3", "Otot apa yang terletak di dada tubuh manusia?:2,3,5,1", "Apa yang dimaksud dengan otot segitiga yang terletak di aspek posterior leher?:3,1,2,5", "Otot apa yang terbesar dari otot perut lateral?:4,1,2,0", "Apa yang terbesar dari 4 otot di kompartemen anterior kaki?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Apa organ berotot yang memompa darah melalui pembuluh darah sistem peredaran darah?:0,1,3,5", "Apa arteri utama dan terbesar dalam tubuh manusia?:1,4,3,2", "Apa pembuluh darah yang mengalirkan ginjal?:2,5,4,1", "Apa pasangan arteri yang memasok darah ke ginjal?:3,2,1,5", "Apa vena yang membawa darah terdeoksigenasi dari kepala kembali ke jantung?:4,2,5,1", "Apa itu vena besar yang terletak jauh di dalam paha?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Apa organ yang berfungsi sebagai pusat sistem saraf?:0,1,2,5", "Apa ciri utama otak belakang semua vertebrata?:1,5,0,2", "Apa yang dimaksud dengan struktur tubular panjang, tipis, yang terdiri dari jaringan saraf?:2,1,3,4", "Apa saraf besar yang berjalan di sepanjang sendi panggul?:3,2,1,5", "Apa cabang dari saraf sciatic?:4,5,2,1", "Apa yang dimaksud dengan kumpulan badan sel neuron pada sistem saraf tepi?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Apa lipatan otot yang mengelilingi mulut?:0,1,4,7", "Apa ekstensi berdaging yang menggantung di atas tenggorokan?:1,4,0,7", "Apa itu gigi rata di bagian belakang mulut?:2,3,5,6", "Apa gigi depan?:3,2,5,6", "Apa yang dimaksud dengan organ otot pada mulut?:4,5,6,1", "Organ apa yang berperan penting dalam sistem imun?:5,1,4,0", "Apa yang dimaksud dengan lempeng tulang horizontal tipis yang terdiri dari dua tulang kerangka wajah?:6,7,2,5", "Apa jaringan lunak yang membentuk bagian belakang atap mulut?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Apa yang terbesar dari empat lobus utama otak?:0,3,1,4", "Apa yang ada di belakang telinga dan merupakan lobus terbesar kedua?:1,0,3,2", "Apa yang terlibat dalam persepsi sensasi, termasuk sentuhan, suhu, nyeri?:2,0,3,5", "Apa pusat pemrosesan visual otak?:3,0,1,4", "Apa yang memainkan peran penting dalam kontrol keseimbangan?:4,5,0,1", "Apa yang membantu mengendalikan detak jantung dan laju pernapasan?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Apa bagian telinga yang terlihat di luar kepala?:0,3,6,2", "Apa yang dimaksud dengan jalur dari telinga luar ke telinga tengah?:1,2,3,0", "Apa yang dimaksud dengan lipatan kulit tipis yang diregangkan ketat seperti drum dan bergetar ketika suara mengenainya?:2,0,5,3", "Apa tiga tulang di telinga tengah yang termasuk tulang terkecil di tubuh manusia?:3,0,6,2", "Apa yang menyerupai cangkang siput?:4,2,0,6", "Apa yang membawa informasi sensorik pendengaran dari koklea telinga bagian dalam langsung ke otak?:5,2,0,6", "Apa yang disebut juga sebagai tabung pendengaran?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Apa arteri utama dan terbesar dalam tubuh manusia?:0,3,8,6", "Vena mana yang membawa darah dari kepala, leher, lengan, dan dada kembali ke jantung Anda?:1,3,0,2", "Vena mana yang membawa darah dari tubuh bagian bawah kembali ke jantung?:2,1,0,3", "Apa ruang atas melalui mana darah memasuki ventrikel jantung?:3,5,6,2", "ruang jantung apa yang menerima darah beroksigen dari paru-paru?:4,3,6,8", "Katup apa yang memisahkan dua bilik di sisi kiri jantung?:5,8,7,3", "Apa ruang otot yang memompa darah keluar dari jantung dan masuk ke sistem peredaran darah?:6,5,8,2", "Manakah yang merupakan salah satu dari empat ruang jantung?:7,0,1,2", "Perannya adalah untuk mencegah aliran balik darah dari ventrikel kanan ke atrium kanan.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Apa struktur tipis di mata, yang bertanggung jawab untuk mengontrol diameter dan ukuran pupil?:0,1,3,2", "Apa bagian depan mata transparan yang menutupi iris?:1,2,3,0", "Apa struktur transparan di mata yang membantu untuk membiaskan cahaya agar difokuskan pada retina?:2,3,0,1", "Apa lapisan jaringan mata yang paling dalam dan peka cahaya?:3,1,0,2", "Apa yang mengirimkan informasi visual dari retina ke otak?:4,6,5,3", "Apa bagian depan mata antara kornea dan iris?:5,6,2,3", "Apa ruang mata yang terletak di belakang lensa dan di depan saraf optik?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Apa yang terdapat di tengah sel dan mengandung DNA yang tersusun dalam kromosom?:0,1,2,3", "Daerah apa di dalam sel yang berkaitan dengan produksi ribosom sel?:1,2,3,4", "Apa yang dimaksud dengan cairan agar-agar yang mengisi bagian dalam sel?:2,3,4,5", "Apa yang melindungi sel dari lingkungan luarnya?:3,4,2,1", "Apa struktur sel yang menghasilkan protein?:4,3,2,1", "Apa yang mengubah energi kimia menjadi bentuk energi yang dapat digunakan sel?:5,4,3,2", "Bagaimana sistem transportasi sel eukariotik?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Apa yang digunakan untuk mengoksidasi makanan kita, dalam proses respirasi sel, sehingga melepaskan energi?:0,1,2,3", "Apa unsur paling melimpah kedua dalam tubuh manusia?:1,2,3,4", "Apa yang digunakan untuk menjaga tubuh manusia tetap terhidrasi?:2,3,4,5", "Apa yang digunakan untuk membuat asam amino dalam tubuh kita yang pada gilirannya membuat protein?:3,5,4", "Apa yang digunakan untuk membangun dan memelihara tulang yang kuat?:4,0,1,2", "Apa yang digunakan dalam pembentukan tulang dan gigi?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Apa penyakit di mana hati Anda menjadi meradang?:Hepatitis::", "Apa penyakit di mana parasit menginfeksi saluran pencernaan manusia?:Parasit usus::", "Apa penyakit di mana pankreas Anda menjadi meradang?:Pankreatitis::", "Apa penyakit yang menyebabkan pecahnya lapisan dalam lambung?:Ulkus lambung::", "Apa penyakit di mana usus buntu Anda meradang?:Radang usus buntu::", "Apa penyakit di mana lapisan dalam perut Anda menjadi meradang?:Radang perut::", "Penyakit apa yang menyebabkan pembengkakan pembuluh darah di rektum bagian bawah?:Wasir::", "Apa yang dimaksud dengan endapan keras yang terbuat dari mineral dan garam?:Batu ginjal::", "Apa jaringan parut pada hati yang disebabkan oleh kerusakan hati jangka panjang?:Sirosis::", "Apa jenis penyakit radang usus?:Penyakit Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Penyakit apa yang menyebabkan nyeri dan peradangan pada persendian?:Radang sendi::", "Apa yang dimaksud dengan terputusnya kontinuitas tulang?:Patah tulang::", "Penyakit apa yang melemahkan tulang, membuatnya rapuh dan lebih mudah patah?:Osteoporosis::", "Penyakit apa yang menyebabkan tulang belakang melengkung ke samping?:Skoliosis::", "Apa jenis radang sendi yang menyebabkan nyeri sendi yang tiba-tiba dan parah?:Encok::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Penyakit apa yang menyebabkan kelemahan progresif dan hilangnya massa otot?:distrofi otot::", "Penyakit apa yang disebabkan oleh kurangnya aktivitas fisik?:atrofi otot::", "Penyakit apa yang menyebabkan peradangan atau iritasi pada tendon?:tendinitis::", "Apa yang dimaksud dengan kontraksi tiba-tiba dan tidak disengaja dari salah satu otot Anda?:kram otot::", "Apa yang terjadi ketika otot Anda terlalu teregang atau robek?:ruptur otot::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Apa jenis kanker yang dimulai pada sel yang merupakan bagian dari sistem kekebalan tubuh?:Limfoma::", "Apa jenis kanker yang biasanya dimulai di sumsum tulang?:Leukemia::", "Apa yang disebabkan oleh kontak yang terlalu lama dengan suhu yang sangat dingin?:Hipotermia::", "Apa pengerasan arteri Anda yang disebabkan oleh penumpukan plak bertahap?:Aterosklerosis::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Apa yang dimaksud dengan peradangan akut pada selaput pelindung yang menutupi otak dan sumsum tulang belakang?:meningitis::", "Penyakit apa yang dapat mempengaruhi otak dan sumsum tulang belakang Anda, dan dapat menyebabkan masalah dengan penglihatan, keseimbangan, kontrol otot?:Sklerosis ganda::", "Apa gangguan otak yang menyebabkan gemetar, kaku, dan kesulitan berjalan, keseimbangan, dan koordinasi?:penyakit Parkinson::", "Apa yang dicirikan oleh beberapa gerakan tics dan setidaknya satu tic vokal?:Sindrom Tourette::", "Apa yang dimaksud dengan kelainan otak herediter yang tidak dapat disembuhkan yang merusak sel-sel otak?:penyakit Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Apa itu infeksi gusi serius yang merusak jaringan lunak dan dapat merusak tulang penyangga gigi?:Penyakit periodontal::", "Apa bentuk penyakit gusi ringan yang menyebabkan iritasi, kemerahan dan pembengkakan pada gusi Anda?:radang gusi::", "Apa saja area yang rusak permanen di permukaan keras gigi Anda?:Kerusakan gigi::", "Apa infeksi amandel di bagian belakang tenggorokan Anda?:Radang amandel::", "Apa yang terjadi jika jaringan yang membentuk bibir tidak menyatu sempurna sebelum lahir?:Bibir sumbing::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Gangguan otak apa yang merusak ingatan dan keterampilan berpikir dan, pada akhirnya, kemampuan untuk melakukan tugas yang paling sederhana?:penyakit alzheimer::", "Apa kondisi yang tidak biasa tetapi serius di mana otak menjadi meradang?:Radang otak::", "Apa gangguan sakit kepala yang ditandai dengan sakit kepala berulang yang sedang hingga berat?:Migrain::", "Apa penyakit yang menyerang otak dan sering menyebabkan kejang?:Epilepsi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Apa yang terjadi ketika virus atau bakteri menyebabkan area di belakang gendang telinga meradang?:Otitis‎::", "Apa yang dimaksud dengan ketidakmampuan total atau sebagian untuk mendengar suara?:Ketulian::", "Apa kondisi di mana Anda mendengar suara ketika tidak ada sumber suara di luar?:tinitus::", "Apa gangguan pada telinga bagian dalam yang dapat menyebabkan pusing (vertigo) dan gangguan pendengaran?:penyakit Meniere::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Apa nyeri dada yang disebabkan oleh berkurangnya aliran darah ke otot jantung?:Angina::", "Berapa tekanan darah yang lebih tinggi dari biasanya?:Hipertensi::", "Apa yang terjadi ketika aliran darah menurun atau berhenti ke arteri koroner jantung?:Infark miokard::", "Apa kondisi serius di mana jantung tidak memompa darah seefisien yang seharusnya?:Gagal jantung kongestif::", "Apa sebutan untuk kadar kolesterol tinggi dalam darah?:Hiperkolesterolemia::", "Apa yang dimaksud dengan kelainan irama jantung?:Aritmia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Apa area keruh di lensa mata yang menyebabkan penurunan penglihatan?:Katarak::", "Apa penyakit mata yang disebabkan oleh infeksi atau alergi?:Konjungtivitis::", "Apa yang dimaksud dengan kondisi mata di mana saraf optik yang menghubungkan mata dengan otak menjadi rusak?:Glaukoma::", "Apa gangguan penglihatan di mana otak gagal sepenuhnya memproses input dari satu mata dan dari waktu ke waktu mendukung mata yang lain?:ambliopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Apa jenis kanker yang mungkin termasuk benjolan di payudara atau perubahan bentuk payudara?:Kanker payudara::", "Apa jenis kanker paling umum yang hanya menyerang pria?:Kanker prostat::", "Apa jenis kanker di mana sel-sel di usus besar atau rektum tumbuh di luar kendali?:Kanker kolorektal::", "Jenis kanker apa yang disebabkan oleh merokok tembakau dalam jangka panjang?:Kanker paru-paru::", "Jenis kanker apa yang disebabkan oleh paparan sinar ultraviolet yang berlebihan dari matahari?:Kanker kulit::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Disebut apakah tingkat oksigen di bawah normal dalam darah Anda, khususnya di arteri?:Hipoksemia::", "Apa yang disebut tingkat kalsium di bawah normal dalam darah Anda?:Hipokalsemia::", "Apa yang disebut tingkat kalsium di atas normal dalam darah Anda?:Hiperkalsemia::", "Apa yang disebut tingkat fosfat di bawah normal dalam darah Anda?:hipofosfatemia::", "Disebut apakah tingkat fosfat di atas normal dalam darah Anda?:Hiperfosfatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Menguningnya kulit dan bagian putih mata Anda:Hepatitis:3,4,5:", "Ruam atau gatal di sekitar dubur:Parasit usus:2,7,8:", "Sakit perut sedang hingga parah yang dapat menyebar ke punggung Anda:Pankreatitis:1,3,4:", "Sakit perut parah:Ulkus lambung:6,7,8:", "Nyeri tiba-tiba yang dimulai di sisi kanan perut bagian bawah:Radang usus buntu:0,3,7:", "Mual atau sakit perut berulang:Radang perut:4,2,1:", "Gatal luar biasa di sekitar anus:Wasir:0,2,3:", "Nyeri atau sensasi terbakar saat buang air kecil:Batu ginjal:3,9,1:", "Menguningnya kulit dan bagian putih mata Anda:Sirosis:7,5,4:", "Darah dalam tinja:Penyakit Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["nyeri sendi:Radang sendi:1,2,3:", "sakit parah segera:Patah tulang:2,3:", "Kehilangan tinggi badan dari waktu ke waktu:Osteoporosis:1,3,4:", "tulang belakang yang terlihat melengkung:Skoliosis:0,1,2:", "merah, kulit mengkilap di atas sendi yang terkena:Encok:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Otot betis besar:distrofi otot:2,3,4:", "Satu lengan atau satu kaki lebih kecil dari yang lain:atrofi otot:2,3,4:", "rasa sakit di tendon yang memburuk saat Anda bergerak:tendinitis:1,3,4:", "Rasa sakit yang tiba-tiba dan tajam:kram otot:1,2:", "nyeri tiba-tiba yang memburuk saat otot berkontraksi:ruptur otot:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Pembengkakan kelenjar getah bening tanpa rasa sakit di leher, ketiak, atau selangkangan Anda:Limfoma:2,3:", "Pembengkakan kelenjar getah bening, pembesaran hati atau limpa:Leukemia:2,3:", "Gemetaran:Hipotermia:0,1:", "Mati rasa atau kelemahan di lengan atau kaki Anda:Aterosklerosis:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Demam tinggi tiba-tiba, sakit kepala parah yang tampak berbeda dari biasanya:meningitis:1,2,3:", "kebutaan pada satu mata:Sklerosis ganda:0,3,4:", "Gemetar di tangan:penyakit Parkinson:0,3,4:", "gerakan tics:Sindrom Tourette:0,1,4:", "kesulitan berkonsentrasi dan kehilangan ingatan:penyakit Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Gusi merah atau bengkak:Penyakit periodontal:2,3,4:", "Gusi merah atau bengkak:radang gusi:2,3,4:", "Sakit gigi:Kerusakan gigi:0,4,3:", "masalah menelan:Radang amandel:0,2,4:", "Deformitas rahang atas:Bibir sumbing:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["cairan yang keluar dari telinga:Otitis‎:1,2,3:", "Kehilangan pendengaran:Ketulian:0,2,3:", "suara mendenging di telinga:tinitus:0,1,3:", "vertigo:penyakit Meniere:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Penglihatan mendung:Katarak:1,2,3:", "Warna pink atau merah di bagian putih mata:Konjungtivitis:0,2,3:", "sakit mata yang intens:Glaukoma:0,1,3:", "Persepsi kedalaman dan penglihatan tepi yang buruk:ambliopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Benjolan baru di payudara atau ketiak:Kanker payudara:1,2,3:", "Darah dalam urin:Kanker prostat:2,3,4:", "Perubahan kebiasaan buang air besar:Kanker kolorektal:1,3,4:", "batuk yang tidak hilang setelah 2 atau 3 minggu:Kanker paru-paru:1,2,4:", "Tahi lalat yang berubah warna, ukuran, atau berdarah:Kanker kulit:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Warna kebiruan pada kulit, kuku, dan bibir:Hipoksemia:1,2,3:", "Kedutan di tangan, wajah, dan kaki Anda:Hipokalsemia:0,2,4:", "Lebih sering buang air kecil dan haus:Hiperkalsemia:0,1:", "melemahnya tulang:hipofosfatemia:0,4:", "kram atau kejang otot:Hiperfosfatemia:0,1:"]);
  }

  void addIT(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.it;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Fegato:1,2,3:29.2,45", "Bocca:4,2,9:28.1,81.6", "Esofago:1,8,5:48.6,58.6", "Intestino crasso:4,2,6:20.5,21", "Intestino tenue:8,7,1:52.4,19", "Stomaco:4,6,7:66,41", "Faringe:5,2,9:48.6,81", "colecisti:6,9,4:31.3,39.6", "Pancreas:2,1,0:50,35.1", "Appendice:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Cranio:11,8,6:48,97", "scapola:5,4,3:61.1,80.2", "Costole:11,7,0:56,74.1", "Colonna vertebrale:8,10,1:45.9,65.2", "Tibia:5,9,3:51.4,23.6", "Femore:4,10,7:54.9,35.5", "Omero:2,7,9:69.1,66.2", "Metacarpo:6,0,1:81.3,44.8", "Carpo:5,4,2:77.1,48.7", "Tarso:4,3,1:49.3,6.9", "Ossa metatarso:0,3,5:54.2,2.8", "Pelvi:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltoide:4,1,5:65.3,80.2", "Bicipiti:5,0,4:67.3,71.5", "Pettorale:5,0,4:52.5,76.4", "Trapezio:1,5,4:51.4,85.5", "Muscolo obliquo esterno:1,5,0:54.2,65.9", "Muscolo tibiale anteriore:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Cuore:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Vene renali:0,4,5:57.3,59.1", "Arteria renale:0,5,4:61.5,59.1", "Vena giugulare:0,2,5:60.4,86.1", "Vena femorale:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Cervello:5,4,3:50.4,96.8", "cervelletto:5,4,3:56,92.6", "Midollo spinale:0,4,3:50.7,86.8", "Nervo sciatico:0,4,5:59.4,37.6", "Nervo tibiale:1,5,3:61.1,19.4", "Ganglio:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Labbra:1,2,4:61.4,96.6", "Ugola:6,2,0:48.6,51.8", "Molari:0,6,1:76.1,33", "Incisivo:0,4,1:50.4,83", "Lingua:7,2,0:48.2,27.6", "Tonsilla:4,0,6:69.5,46.8", "Palato duro:1,2,0:48.6,73.8", "Palato molle:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Lobo frontale:1,2,4:25,58.5", "Lobo temporale:0,2,3:51.2,42.2", "Lobo parietale:0,1,3:66,69", "Lobo occipitale:0,1,2:91,46", "cervelletto:1,2,0:72.8,26.1", "Tronco encefalico:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Padiglione auricolare:1,2,4:8,31", "Canale uditivo:0,2,6:33.5,42.1", "Timpano:1,5,6:55.6,42", "Ossicini:1,0,6:54.3,52.9", "Coclea:6,1,5:75.8,45.7", "Nervo uditivo:6,2,1:91.8,48", "Tromba di Eustachio:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Vena cava superiore:6,7,4:27.3,92", "Vena cava inferiore:1,4,3:27.8,6.8", "Atrio destro:4,7,0:31,54.4", "Atrio sinistro:7,6,0:59.6,55.5", "Valvola mitrale:8,2,0:69.5,43.7", "Ventricolo destro:0,1,3:47.8,38.9", "Ventricolo sinistro:1,8,3:58.1,43", "Valvola tricuspide:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "Cornea:2,6,4:1.7,50.5", "cristallino:1,4,6:19,51.3", "Retina:1,6,4:64.6,76.8", "Nervo ottico:0,6,3:87.9,36.2", "Camera anteriore:6,4,3:7.2,51.4", "Corpo vitreo:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Nucleo:5,3,2:57.3,75.5", "Nucleolo:2,6,4:44.5,67.9,8", "Citoplasma:1,4,6:93.08,50.09,9", "Membrana cellulare:2,5,1:90,24,14", "Ribosoma:2,1,3:80.929,75.844,14", "Mitocondrio:1,2,3:51.4,90.35,18", "Reticolo endoplasmatico:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Ossigeno:1,2,4:74.5,29,25", "Carbon:2,0,4:74.5,57,25", "Idrogeno:1,0,5:74.5,73.2,25", "Azoto:1,0,2:74.5,83.5,25", "Calcio:0,1,2:74.5,91.2,25", "Fosforo:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Quale organo produce la bile necessaria per la digestione?:0,7,6,8", "Qual è la prima porzione del canale alimentare che riceve cibo e produce saliva?:1,2,6,5", "Attraverso quale organo il cibo passa dalla faringe allo stomaco?:2,6,9,7", "Quale organo è l'ultima parte dell'apparato digerente?:3,4,7,8", "Dove avviene il maggior assorbimento di nutrienti e minerali dal cibo?:4,5,3,0", "Quale organo secerne gli enzimi digestivi e l'acido gastrico per favorire la digestione del cibo?:5,4,7,3", "Come si chiama la parte della gola dietro la bocca e la cavità nasale?:6,2,9,8", "Dove viene immagazzinata e concentrata la bile prima che venga rilasciata nell'intestino tenue?:7,6,9,8", "Da dove viene secreta l'insulina?:8,0,7,6", "Quale organo si trova nell'addome inferiore destro?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Che cos'è una struttura ossea che forma la testa?:0,1,9,7", "Ciò che è noto anche come osso della spalla?:1,9,11,6", "Cos'è una struttura ossea e cartilaginea semirigida che circonda la cavità toracica?:2,7,8,11", "Qual è la caratteristica distintiva di un vertebrato?:3,0,11,2", "Qual è la più grande delle due ossa della gamba sotto il ginocchio?:4,6,9,5", "Qual è l'osso più lungo e più forte del tuo corpo?:5,6,9,1", "Cos'è un osso lungo del braccio che va dalla spalla al gomito?:6,5,1,7", "Cos'è un gruppo di cinque ossa della mano tra le falangi e il polso?:7,5,1,3", "Quali ossa compongono il polso?:8,7,9,10", "Cos'è un gruppo di sette ossa articolate in ogni piede?:9,7,8,1", "Che cos'è un gruppo di cinque ossa lunghe nel piede?:10,8,7,4", "Qual è la parte inferiore del busto?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Qual è il muscolo che forma il contorno arrotondato della spalla umana?:0,1,3,5", "Cos'è un grosso muscolo che si trova nella parte anteriore del braccio tra la spalla e il gomito?:1,0,2,3", "Quale muscolo si trova nel torace del corpo umano?:2,3,5,1", "Cos'è un muscolo triangolare situato nella parte posteriore del collo?:3,1,2,5", "Qual è il muscolo più grande dei muscoli addominali laterali?:4,1,2,0", "Qual è il più grande dei 4 muscoli nel compartimento anteriore della gamba?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Cos'è un organo muscolare che pompa il sangue attraverso i vasi sanguigni del sistema circolatorio?:0,1,3,5", "Qual è l'arteria principale e più grande del corpo umano?:1,4,3,2", "Quali sono le vene che drenano il rene?:2,5,4,1", "Quali sono le arterie accoppiate che forniscono sangue ai reni?:3,2,1,5", "Quali sono le vene che portano il sangue deossigenato dalla testa al cuore?:4,2,5,1", "Cos'è una grande vena situata in profondità all'interno della coscia?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Cos'è un organo che funge da centro del sistema nervoso?:0,1,2,5", "Qual è una caratteristica importante del romboencefalo di tutti i vertebrati?:1,5,0,2", "Che cos'è una struttura tubolare lunga, sottile e costituita da tessuto nervoso?:2,1,3,4", "Cos'è un grande nervo che corre lungo l'articolazione dell'anca?:3,2,1,5", "Cos'è un ramo del nervo sciatico?:4,5,2,1", "Che cos'è un gruppo di corpi cellulari neuronali nel sistema nervoso periferico?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Quali sono le pieghe muscolari che circondano la bocca?:0,1,4,7", "Cos'è un'estensione carnosa che pende sopra la gola?:1,4,0,7", "Cosa sono i denti piatti nella parte posteriore della bocca?:2,3,5,6", "Quali sono i denti anteriori?:3,2,5,6", "Che cos'è un organo muscolare nella bocca?:4,5,6,1", "Quali organi svolgono un ruolo importante nel sistema immunitario?:5,1,4,0", "Cos'è una sottile placca ossea orizzontale composta da due ossa dello scheletro facciale?:6,7,2,5", "Qual è il tessuto molle che costituisce la parte posteriore del palato?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Qual è il più grande dei quattro lobi principali del cervello?:0,3,1,4", "Cosa si trova dietro le orecchie ed è il secondo lobo più grande?:1,0,3,2", "Che cosa è coinvolto nella percezione della sensazione, incluso il tatto, la temperatura, il dolore?:2,0,3,5", "Qual è il centro di elaborazione visiva del cervello?:3,0,1,4", "Cosa gioca un ruolo importante nel controllo dell'equilibrio?:4,5,0,1", "Cosa aiuta a controllare la frequenza cardiaca e la frequenza respiratoria?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Qual è la parte visibile dell'orecchio che si trova al di fuori della testa?:0,3,6,2", "Qual è un percorso che va dall'orecchio esterno all'orecchio medio?:1,2,3,0", "Cos'è un sottile lembo di pelle che è teso come un tamburo e vibra quando il suono lo colpisce?:2,0,5,3", "Quali sono le tre ossa dell'orecchio medio che sono tra le ossa più piccole del corpo umano?:3,0,6,2", "Cosa assomiglia al guscio di una lumaca?:4,2,0,6", "Cosa trasporta le informazioni sensoriali uditive dalla coclea dell'orecchio interno direttamente al cervello?:5,2,0,6", "Ciò che è anche noto come tubo uditivo?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Qual è l'arteria principale e più grande del corpo umano?:0,3,8,6", "Quale vena porta il sangue dalla testa, dal collo, dalle braccia e dal petto al cuore?:1,3,0,2", "Quale vena trasporta il sangue dalla parte inferiore del corpo al cuore?:2,1,0,3", "Qual è la camera superiore attraverso la quale il sangue entra nei ventricoli del cuore?:3,5,6,2", "quale camera cardiaca riceve sangue ossigenato dai polmoni?:4,3,6,8", "Quale valvola separa le due camere del lato sinistro del cuore?:5,8,7,3", "Qual è la camera muscolare che pompa il sangue fuori dal cuore e nel sistema circolatorio?:6,5,8,2", "Qual è una delle quattro camere del cuore?:7,0,1,2", "Il suo ruolo è prevenire il riflusso di sangue dal ventricolo destro nell'atrio destro.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Che cos'è una struttura sottile nell'occhio, responsabile del controllo del diametro e delle dimensioni della pupilla?:0,1,3,2", "Qual è la parte anteriore trasparente dell'occhio che copre l'iride?:1,2,3,0", "Che cos'è una struttura trasparente nell'occhio che aiuta a rifrangere la luce per essere focalizzata sulla retina?:2,3,0,1", "Qual è lo strato di tessuto dell'occhio più interno e sensibile alla luce?:3,1,0,2", "Cosa trasmette le informazioni visive dalla retina al cervello?:4,6,5,3", "Qual è la parte anteriore dell'occhio tra la cornea e l'iride?:5,6,2,3", "Quale camera oculare si trova dietro la lente e davanti al nervo ottico?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Cosa si trova al centro della cellula e contiene DNA organizzato nei cromosomi?:0,1,2,3", "Quale regione all'interno della cellula si occupa della produzione dei ribosomi cellulari?:1,2,3,4", "Cos'è un liquido gelatinoso che riempie l'interno di una cellula?:2,3,4,5", "Cosa protegge la cellula dal suo ambiente esterno?:3,4,2,1", "Che cos'è una struttura cellulare che produce proteine?:4,3,2,1", "Cosa converte l'energia chimica in una forma di energia utilizzabile dalla cellula?:5,4,3,2", "Qual è il sistema di trasporto della cellula eucariotica?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["A cosa serve ossidare il nostro cibo, nel processo di respirazione cellulare, liberando così energia?:0,1,2,3", "Qual è il secondo elemento più abbondante nel corpo umano?:1,2,3,4", "Cosa serve per mantenere idratato il corpo umano?:2,3,4,5", "Cosa viene utilizzato per produrre amminoacidi nel nostro corpo che a loro volta producono proteine?:3,5,4", "Cosa viene utilizzato per costruire e mantenere le ossa forti?:4,0,1,2", "Cosa viene utilizzato nella formazione di ossa e denti?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Qual è una malattia in cui il tuo fegato si infiamma?:Epatite::", "Che cos'è una malattia in cui un parassita infetta il tratto gastrointestinale dell'uomo?:Parassiti intestinali::", "Qual è una malattia in cui il tuo pancreas si infiamma?:Pancreatite::", "Qual è una malattia che provoca una rottura nel rivestimento interno dello stomaco?:Ulcera gastrica::", "Qual è una malattia in cui la tua appendice si infiamma?:Appendicite::", "Qual è una malattia in cui il rivestimento interno dello stomaco si infiamma?:Gastrite::", "Quale malattia causa le vene gonfie nel retto inferiore?:Emorroidi::", "Cosa sono i depositi duri fatti di minerali e sali?:Calcoli renali::", "Che cosa sono le cicatrici del fegato causate da un danno epatico a lungo termine?:Cirrosi::", "Qual è un tipo di malattia infiammatoria intestinale?:Morbo di Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Quale malattia provoca dolore e infiammazione a un'articolazione?:Artrite::", "Che cos'è un'interruzione nella continuità di un osso?:Frattura dell'osso::", "Quale malattia indebolisce le ossa, rendendole fragili e con maggiori probabilità di rompersi?:Osteoporosi::", "Quale malattia provoca una curvatura laterale della colonna vertebrale?:Scoliosi::", "Qual è un tipo di artrite che provoca dolore articolare improvviso e grave?:Gotta::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Quale malattia causa progressiva debolezza e perdita di massa muscolare?:distrofia muscolare::", "Quale malattia è causata dalla mancanza di attività fisica?:atrofia muscolare::", "Quale malattia provoca l'infiammazione o l'irritazione di un tendine?:tendinite::", "Cos'è una contrazione improvvisa e involontaria di uno dei tuoi muscoli?:crampi muscolari::", "Cosa succede quando il tuo muscolo è teso o strappato?:rottura muscolare::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Qual è un tipo di cancro che inizia nelle cellule che fanno parte del sistema immunitario del corpo?:Linfoma::", "Qual è un tipo di cancro che di solito inizia nel midollo osseo?:Leucemia::", "Che cosa è causato da esposizioni prolungate a temperature molto basse?:Ipotermia::", "Che cos'è un indurimento delle arterie causato dal graduale accumulo di placca?:Aterosclerosi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Che cos'è un'infiammazione acuta delle membrane protettive che ricoprono il cervello e il midollo spinale?:Meningite::", "Qual è una malattia che può colpire il cervello e il midollo spinale e può causare problemi alla vista, all'equilibrio e al controllo muscolare?:Sclerosi multipla::", "Qual è un disturbo cerebrale che porta a tremore, rigidità e difficoltà nel camminare, nell'equilibrio e nella coordinazione?:morbo di Parkinson::", "Che cosa è caratterizzato da più tic di movimento e almeno un tic vocale?:sindrome di Tourette::", "Che cos'è un disturbo cerebrale ereditario incurabile che danneggia le cellule cerebrali?:malattia di Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Qual è una grave infezione gengivale che danneggia i tessuti molli e che può distruggere l'osso che sostiene i denti?:Parodontite::", "Qual è una forma lieve di malattia gengivale che provoca irritazione, arrossamento e gonfiore della gengiva?:gengivite::", "Quali sono le aree permanentemente danneggiate sulla superficie dura dei tuoi denti?:Carie::", "Che cos'è un'infezione delle tonsille nella parte posteriore della gola?:Tonsillite::", "Cosa succede se il tessuto che compone il labbro non si unisce completamente prima della nascita?:Labbro leporino::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Quale disturbo cerebrale distrugge la memoria e le capacità di pensiero e, infine, la capacità di svolgere i compiti più semplici?:Il morbo di Alzheimer::", "Qual è una condizione rara ma grave in cui il cervello si infiamma?:Encefalite::", "Che cos'è un disturbo del mal di testa caratterizzato da mal di testa ricorrenti da moderati a gravi?:Emicrania::", "Qual è una malattia che colpisce il cervello e provoca frequenti convulsioni?:Epilessia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Cosa succede quando un virus o un batterio provoca l'infiammazione dell'area dietro il timpano?:Otite::", "Cosa si riferisce all'incapacità totale o parziale di sentire i suoni?:Sordità::", "Qual è una condizione in cui si sentono i suoni quando non c'è una fonte esterna dei suoni?:Tinnito::", "Qual è un disturbo dell'orecchio interno che può portare a vertigini (vertigini) e perdita dell'udito?:la malattia di Meniere::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Che cos'è un dolore toracico causato dalla riduzione del flusso sanguigno ai muscoli cardiaci?:Angina::", "Qual è la pressione sanguigna più alta del normale?:Ipertensione::", "Cosa succede quando il flusso sanguigno diminuisce o si ferma all'arteria coronaria del cuore?:Infarto miocardico::", "Qual è una condizione grave in cui il cuore non pompa il sangue in modo efficiente come dovrebbe?:Insufficienza cardiaca congestizia::", "Qual è una parola per alti livelli di colesterolo nel sangue?:Ipercolesterolemia::", "Qual è un'anomalia del ritmo cardiaco?:Aritmia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Cos'è un'area torbida nel cristallino dell'occhio che porta a una diminuzione della vista?:Cataratta::", "Qual è una condizione oculare causata da infezioni o allergie?:Congiuntivite::", "Qual è una condizione dell'occhio in cui il nervo ottico, che collega l'occhio al cervello, viene danneggiato?:Glaucoma::", "Che cos'è un disturbo della vista in cui il cervello non riesce a elaborare completamente gli input da un occhio e nel tempo favorisce l'altro occhio?:Ambliopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Qual è un tipo di cancro che può includere un nodulo al seno o un cambiamento nella forma del seno?:Cancro al seno::", "Qual è il tipo più comune di cancro che colpisce solo gli uomini?:Cancro alla prostata::", "Qual è un tipo di cancro in cui le cellule del colon o del retto crescono senza controllo?:Cancro colorettale::", "Che tipo di cancro è causato dal fumo di tabacco a lungo termine?:Cancro ai polmoni::", "Che tipo di cancro è causato dalla sovraesposizione ai raggi ultravioletti del sole?:Cancro della pelle::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Come si chiama un livello di ossigeno nel sangue al di sotto del normale, in particolare nelle arterie?:Ipossiemia::", "Come si chiama un livello inferiore al normale di calcio nel sangue?:Ipocalcemia::", "Come si chiama un livello di calcio nel sangue superiore al normale?:Ipercalcemia::", "Come si chiama un livello di fosfato nel sangue al di sotto del normale?:ipofosfatemia::", "Come si chiama un livello di fosfato nel sangue superiore al normale?:Iperfosfatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Ingiallimento della pelle e del bianco degli occhi:Epatite:3,4,5:", "Eruzione cutanea o prurito intorno al retto:Parassiti intestinali:2,7,8:", "Dolore addominale da moderato a grave che può diffondersi alla schiena:Pancreatite:1,3,4:", "Forte mal di stomaco:Ulcera gastrica:6,7,8:", "Dolore improvviso che inizia sul lato destro del basso addome:Appendicite:0,3,7:", "Nausea o mal di stomaco ricorrente:Gastrite:4,2,1:", "Prurito estremo intorno all'ano:Emorroidi:0,2,3:", "Dolore o sensazione di bruciore durante la minzione:Calcoli renali:3,9,1:", "Ingiallimento della pelle e del bianco degli occhi:Cirrosi:7,5,4:", "Sangue nelle feci:Morbo di Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["dolori articolari:Artrite:1,2,3:", "dolore immediato e intenso:Frattura dell'osso:2,3:", "Perdita di altezza nel tempo:Osteoporosi:1,3,4:", "una spina dorsale visibilmente curva:Scoliosi:0,1,2:", "pelle rossa e lucida sopra l'articolazione colpita:Gotta:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Grandi muscoli del polpaccio:distrofia muscolare:2,3,4:", "Un braccio o una gamba è più piccola dell'altra:atrofia muscolare:2,3,4:", "dolore a un tendine che peggiora quando ti muovi:tendinite:1,3,4:", "Un dolore improvviso e acuto:crampi muscolari:1,2:", "dolore improvviso che peggiora mentre si contrae il muscolo:rottura muscolare:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Gonfiore indolore dei linfonodi del collo, delle ascelle o dell'inguine:Linfoma:2,3:", "Linfonodi ingrossati, fegato o milza ingrossati:Leucemia:2,3:", "tremante:Ipotermia:0,1:", "Intorpidimento o debolezza alle braccia o alle gambe:Aterosclerosi:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Febbre alta improvvisa, forte mal di testa che sembra diverso dal normale:Meningite:1,2,3:", "cecità da un occhio:Sclerosi multipla:0,3,4:", "Tremore alle mani:morbo di Parkinson:0,3,4:", "tic di movimento:sindrome di Tourette:0,1,4:", "difficoltà di concentrazione e vuoti di memoria:malattia di Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Gengive rosse o gonfie:Parodontite:2,3,4:", "Gengive rosse o gonfie:gengivite:2,3,4:", "Mal di denti:Carie:0,4,3:", "problemi di deglutizione:Tonsillite:0,2,4:", "Deformità della mascella superiore:Labbro leporino:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["liquido che fuoriesce dall'orecchio:Otite:1,2,3:", "Perdita dell'udito:Sordità:0,2,3:", "uno squillo nelle orecchie:Tinnito:0,1,3:", "vertigine:la malattia di Meniere:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Visione offuscata:Cataratta:1,2,3:", "Colore rosa o rosso nel bianco dell'occhio:Congiuntivite:0,2,3:", "dolore oculare intenso:Glaucoma:0,1,3:", "Percezione della profondità e visione periferica scarsa:Ambliopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Un nuovo nodulo al seno o alle ascelle:Cancro al seno:1,2,3:", "Sangue nelle urine:Cancro alla prostata:2,3,4:", "Un cambiamento nelle abitudini intestinali:Cancro colorettale:1,3,4:", "una tosse che non scompare dopo 2 o 3 settimane:Cancro ai polmoni:1,2,4:", "Un neo che cambia colore, dimensione o che sanguina:Cancro della pelle:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Colore bluastro della pelle, delle unghie e delle labbra:Ipossiemia:1,2,3:", "Contrazioni alle mani, al viso e ai piedi:Ipocalcemia:0,2,4:", "Minzione e sete più frequenti:Ipercalcemia:0,1:", "indebolimento delle ossa:ipofosfatemia:0,4:", "crampi o spasmi muscolari:Iperfosfatemia:0,1:"]);
  }

  void addJA(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.ja;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["肝臓:1,2,3:29.2,45", "口:4,2,9:28.1,81.6", "食道:1,8,5:48.6,58.6", "大腸:4,2,6:20.5,21", "小腸:8,7,1:52.4,19", "胃:4,6,7:66,41", "咽頭:5,2,9:48.6,81", "胆嚢:6,9,4:31.3,39.6", "膵臓:2,1,0:50,35.1", "虫垂:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["頭蓋骨:11,8,6:48,97", "肩甲骨:5,4,3:61.1,80.2", "肋骨:11,7,0:56,74.1", "脊椎:8,10,1:45.9,65.2", "脛骨:5,9,3:51.4,23.6", "大腿骨:4,10,7:54.9,35.5", "上腕骨:2,7,9:69.1,66.2", "中手骨:6,0,1:81.3,44.8", "手根骨:5,4,2:77.1,48.7", "足根骨:4,3,1:49.3,6.9", "中足骨:0,3,5:54.2,2.8", "骨盤:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["三角筋:4,1,5:65.3,80.2", "上腕二頭筋:5,0,4:67.3,71.5", "胸筋:5,0,4:52.5,76.4", "僧帽筋:1,5,4:51.4,85.5", "腹部外側斜め:1,5,0:54.2,65.9", "前脛骨筋:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["心臓:4,2,5:65.3,73", "大動脈:4,2,5:62.9,77.6", "腎静脈:0,4,5:57.3,59.1", "腎動脈:0,5,4:61.5,59.1", "頸静脈:0,2,5:60.4,86.1", "大腿静脈:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["脳:5,4,3:50.4,96.8", "小脳:5,4,3:56,92.6", "脊髄:0,4,3:50.7,86.8", "坐骨神経:0,4,5:59.4,37.6", "脛骨神経:1,5,3:61.1,19.4", "神経節:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["唇:1,2,4:61.4,96.6", "口蓋垂:6,2,0:48.6,51.8", "臼歯:0,6,1:76.1,33", "切歯:0,4,1:50.4,83", "舌:7,2,0:48.2,27.6", "扁桃:4,0,6:69.5,46.8", "硬口蓋:1,2,0:48.6,73.8", "軟口蓋:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["前頭葉:1,2,4:25,58.5", "側頭葉:0,2,3:51.2,42.2", "頭頂葉:0,1,3:66,69", "後頭葉:0,1,2:91,46", "小脳:1,2,0:72.8,26.1", "脳幹:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["耳介:1,2,4:8,31", "外耳道:0,2,6:33.5,42.1", "鼓膜:1,5,6:55.6,42", "耳小骨:1,0,6:54.3,52.9", "蝸牛:6,1,5:75.8,45.7", "聴覚神経:6,2,1:91.8,48", "耳管:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["大動脈:8,6,3:51.7,84.7", "上大静脈:6,7,4:27.3,92", "下大静脈:1,4,3:27.8,6.8", "右心房:4,7,0:31,54.4", "左心房:7,6,0:59.6,55.5", "僧帽弁:8,2,0:69.5,43.7", "右心室:0,1,3:47.8,38.9", "左心室:1,8,3:58.1,43", "三尖弁:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["虹彩:6,3,4:11.3,57", "角膜:2,6,4:1.7,50.5", "水晶体:1,4,6:19,51.3", "網膜:1,6,4:64.6,76.8", "視神経:0,6,3:87.9,36.2", "前房:6,4,3:7.2,51.4", "硝子体腔:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["核:5,3,2:57.3,75.5", "核小体:2,6,4:44.5,67.9,8", "細胞質:1,4,6:93.08,50.09,9", "細胞膜:2,5,1:90,24,14", "リボソーム:2,1,3:80.929,75.844,14", "ミトコンドリア:1,2,3:51.4,90.35,18", "小胞体:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["酸素:1,2,4:74.5,29,25", "炭素:2,0,4:74.5,57,25", "水素:1,0,5:74.5,73.2,25", "窒素:1,0,2:74.5,83.5,25", "カルシウム:0,1,2:74.5,91.2,25", "リン:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["どの器官が消化に必要な胆汁を生成しますか？:0,7,6,8", "食物を受け取り唾液を生成する消化管の最初の部分は何ですか？:1,2,6,5", "どの臓器を介して食物が咽頭から胃に通過しますか？:2,6,9,7", "消化器系の最後の部分はどの器官ですか？:3,4,7,8", "食物からの栄養素とミネラルの最も多くの吸収はどこで起こりますか？:4,5,3,0", "食物の消化を助けるために消化酵素と胃酸を分泌する器官は何ですか？:5,4,7,3", "口と鼻腔の後ろの喉の部分は何と呼ばれていますか？:6,2,9,8", "小腸に放出される前に、胆汁はどこに保存され濃縮されますか？:7,6,9,8", "インスリンはどこから分泌されますか？:8,0,7,6", "右下腹部にはどの臓器がありますか？:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["頭を形成する骨の構造とは何ですか？:0,1,9,7", "肩の骨としても知られていますか？:1,9,11,6", "胸腔を取り囲む半剛性の骨と軟骨の構造とは何ですか？:2,7,8,11", "脊椎動物の特徴は何ですか？:3,0,11,2", "膝の下の脚にある2つの骨のうち大きい方は何ですか？:4,6,9,5", "あなたの体の中で最も長くて最も強い骨は何ですか？:5,6,9,1", "肩から肘まで伸びる腕の長骨とは何ですか？:6,5,1,7", "指骨と手首の間の手の5つの骨のグループは何ですか？:7,5,1,3", "手首を構成する骨は何ですか？:8,7,9,10", "各足の7つの関節骨のクラスターとは何ですか？:9,7,8,1", "足の5つの長骨のグループは何ですか？:10,8,7,4", "胴体の下部は何ですか？:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["人間の肩の丸みを帯びた輪郭を形成する筋肉は何ですか？:0,1,3,5", "上腕の前部の肩と肘の間にある大きな筋肉とは何ですか？:1,0,2,3", "人体の胸にはどの筋肉がありますか？:2,3,5,1", "首の後面にある三角形の筋肉とは何ですか？:3,1,2,5", "腹直筋の中で最も大きい筋肉はどれですか？:4,1,2,0", "脚の前部コンパートメントにある4つの筋肉のうち最大のものは何ですか？:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["循環器系の血管を通して血液を送り出す筋肉器官とは何ですか？:0,1,3,5", "人体の主要で最大の動脈は何ですか？:1,4,3,2", "腎臓を排出する静脈とは何ですか？:2,5,4,1", "腎臓に血液を供給する対の動脈とは何ですか？:3,2,1,5", "脱酸素化された血液を頭から心臓に戻す静脈とは何ですか？:4,2,5,1", "太ももの奥深くにある大きな静脈とは何ですか？:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["神経系の中心となる器官とは何ですか？:0,1,2,5", "すべての脊椎動物の後脳の主な特徴は何ですか？:1,5,0,2", "神経組織でできた長くて細い管状の構造とは何ですか？:2,1,3,4", "股関節に沿って走る大きな神経とは何ですか？:3,2,1,5", "坐骨神経の枝とは何ですか？:4,5,2,1", "末梢神経系のニューロン細胞体のグループは何ですか？:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["口を囲む筋肉のひだとは何ですか？:0,1,4,7", "喉の上にぶら下がっている肉質のエクステンションとは何ですか？:1,4,0,7", "口の後ろの平らな歯とは何ですか？:2,3,5,6", "前歯は何ですか？:3,2,5,6", "口の中の筋肉器官とは何ですか？:4,5,6,1", "免疫系で重要な役割を果たす臓器は何ですか？:5,1,4,0", "顔面頭蓋の2つの骨で構成された薄い水平の骨プレートとは何ですか？:6,7,2,5", "口蓋の裏側を構成する軟部組織とは何ですか？:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["脳の4つの主要な葉の中で最大のものは何ですか？:0,3,1,4", "耳の後ろに何があり、2番目に大きい葉ですか？:1,0,3,2", "触覚、体温、痛みなど、感覚の知覚には何が関係していますか？:2,0,3,5", "脳の視覚処理センターとは何ですか？:3,0,1,4", "バランスコントロールで重要な役割を果たすものは何ですか？:4,5,0,1", "心拍数と呼吸数を制御するのに何が役立ちますか？:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["頭の外側にある耳の目に見える部分は何ですか？:0,3,6,2", "外耳から中耳までの経路とは何ですか？:1,2,3,0", "太鼓のように引き伸ばされ、音が当たると振動する薄い皮膚のフラップとは何ですか？:2,0,5,3", "人体で最も小さい骨の1つである中耳の3つの骨は何ですか？:3,0,6,2", "カタツムリの殻に似ているものは何ですか？:4,2,0,6", "内耳の蝸牛から直接脳に聴覚感覚情報を運ぶものは何ですか？:5,2,0,6", "耳管としても知られていますか？:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["人体の主要で最大の動脈は何ですか？:0,3,8,6", "頭、首、腕、胸から心臓に血液を運ぶ静脈はどれですか？:1,3,0,2", "下半身から心臓に血液を戻す静脈はどれですか？:2,1,0,3", "血液が心臓の心室に入る上部チャンバーは何ですか？:3,5,6,2", "どの心腔が肺から酸素化された血液を受け取りますか？:4,3,6,8", "心臓の左側の2つのチャンバーを分離するバルブはどれですか？:5,8,7,3", "心臓から循環器系に血液を送り出す筋肉室とは何ですか？:6,5,8,2", "心臓の4つの部屋の1つはどれですか？:7,0,1,2", "その役割は、右心室から右心房への血液の逆流を防ぐことです。:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["瞳孔の直径とサイズを制御する役割を担う、目の薄い構造とは何ですか？:0,1,3,2", "虹彩を覆う目の透明な前部は何ですか？:1,2,3,0", "網膜に焦点を合わせるために光を屈折させるのに役立つ目の透明な構造とは何ですか？:2,3,0,1", "目の組織の最も内側の、光に敏感な層は何ですか？:3,1,0,2", "網膜から脳に視覚情報を伝達するものは何ですか？:4,6,5,3", "角膜と虹彩の間の目の前部は何ですか？:5,6,2,3", "レンズの後ろと視神経の前にある眼房は何ですか？:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["細胞の真ん中に何があり、染色体に配置されたDNAが含まれていますか？:0,1,2,3", "細胞内のどの領域が細胞リボソームの生成に関係していますか？:1,2,3,4", "セルの内部を満たすゼラチン状の液体とは何ですか？:2,3,4,5", "細胞を外部環境から保護するものは何ですか？:3,4,2,1", "タンパク質を生成する細胞構造とは何ですか？:4,3,2,1", "化学エネルギーを細胞が使用できるエネルギー形態に変換するものは何ですか？:5,4,3,2", "真核細胞の輸送システムは何ですか？:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["細胞呼吸の過程で私たちの食物を酸化し、それによってエネルギーを放出するために何が使われますか？:0,1,2,3", "人体で2番目に豊富な元素は何ですか？:1,2,3,4", "人体を水分補給するために何が使われていますか？:2,3,4,5", "私たちの体でアミノ酸を作り、それがタンパク質を作るために何が使われていますか？:3,5,4", "強い骨を作り、維持するために何が使われていますか？:4,0,1,2", "骨や歯の形成には何が使われていますか？:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["肝臓が炎症を起こす病気とは何ですか？:肝炎::", "寄生虫が人間の胃腸管に感染する病気とは何ですか？:腸内寄生虫::", "膵臓が炎症を起こす病気とは何ですか？:膵炎::", "胃の内壁を壊す病気とは何ですか？:胃潰瘍::", "虫垂が炎症を起こす病気とは何ですか？:虫垂炎::", "胃の内壁が炎症を起こす病気とは何ですか？:胃炎::", "直腸下部の静脈が腫れる原因となる病気は何ですか？:痔核::", "鉱物や塩でできた硬い堆積物とは何ですか？:腎臓結石::", "長期的な肝臓の損傷によって引き起こされる肝臓の瘢痕化とは何ですか？:肝硬変::", "炎症性腸疾患の種類は何ですか？:クローン病::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["関節の痛みや炎症を引き起こす病気は何ですか？:関節炎::", "骨の連続性の中断とは何ですか？:骨折::", "どのような病気が骨を弱め、骨をもろくし、壊しやすくしますか？:骨粗鬆症::", "どのような病気が脊椎の横方向の湾曲を引き起こしますか？:脊柱側弯症::", "突然の重度の関節痛を引き起こす関節炎の種類は何ですか？:痛風::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["どのような病気が進行性の衰弱と筋肉量の減少を引き起こしますか？:筋ジストロフィー::", "身体活動の欠如によって引き起こされる病気は何ですか？:筋萎縮::", "腱の炎症や炎症を引き起こす病気は何ですか？:腱炎::", "あなたの筋肉の1つの突然の不随意の収縮は何ですか？:筋肉のけいれん::", "筋肉が伸びすぎたり裂けたりするとどうなりますか？:筋肉の破裂::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["体の免疫系の一部である細胞から発生するがんの種類は何ですか？:リンパ腫::", "通常骨髄で発生するがんの種類は何ですか？:白血病::", "非常に低温に長時間さらされると何が起こりますか？:低体温症::", "徐々にプラークが蓄積することによって引き起こされる動脈の硬化は何ですか？:アテローム性動脈硬化症::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["脳と脊髄を覆う保護膜の急性炎症とは何ですか？:髄膜炎::", "脳や脊髄に影響を及ぼし、視力、バランス、筋肉の制御に問題を引き起こす可能性のある病気とは何ですか？:多発性硬化症::", "震え、こわばり、歩行、バランス、協調の困難につながる脳障害とは何ですか？:パーキンソン病::", "複数の動きのチックと少なくとも1つの声のチックの特徴は何ですか？:トウレット症候群::", "脳細胞に損傷を与える不治の遺伝性脳障害とは何ですか？:ハンチントン病::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["軟部組織に損​​傷を与え、歯を支える骨を破壊する可能性のある深刻な歯周病とは何ですか？:歯周炎::", "歯肉の炎症、発赤、腫れを引き起こす軽度の歯周病とは何ですか？:歯肉炎::", "あなたの歯の硬い表面の永久に損傷した領域は何ですか？:虫歯::", "喉の奥の扁桃腺の感染症とは何ですか？:扁桃腺炎::", "唇を構成する組織が出生前に完全に結合しない場合はどうなりますか？:口唇裂::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["どの脳障害が記憶と思考スキルを破壊し、最終的には最も単純なタスクを実行する能力を破壊しますか？:アルツハイマー病::", "脳が炎症を起こす珍しいが深刻な状態は何ですか？:脳炎::", "中等度から重度の再発性頭痛を特徴とする頭痛障害とは何ですか？:片頭痛::", "脳に影響を及ぼし、頻繁な発作を引き起こす病気とは何ですか？:てんかん::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["ウイルスやバクテリアが鼓膜の後ろの領域を炎症させるとどうなりますか？:中耳炎::", "音が完全にまたは部分的に聞こえないこととは何ですか？:難聴::", "外部の音源がないときに音が聞こえる状態とは？:耳鳴り::", "めまい（めまい）や難聴につながる可能性のある内耳の障害とは何ですか？:メニエール病::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["心筋への血流の減少によって引き起こされる胸痛とは何ですか？:狭心症::", "通常より高い血圧とは何ですか？:高血圧::", "心臓の冠状動脈への血流が減少または停止するとどうなりますか？:心筋梗塞::", "心臓が必要なほど効率的に血液を送り出さない深刻な状態とは何ですか？:うっ血性心不全::", "血中の高レベルのコレステロールの言葉は何ですか？:高コレステロール血症::", "心臓のリズムの異常とは何ですか？:不整脈::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["視力の低下につながる目の水晶体の曇った領域は何ですか？:白内障::", "感染症やアレルギーによって引き起こされる目の状態は何ですか？:結膜炎::", "目と脳をつなぐ視神経が損傷する目の状態とは？:緑内障::", "脳が片方の目からの入力を完全に処理できず、時間の経過とともにもう片方の目を好む視力障害とは何ですか？:弱視::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["乳房のしこりや乳房の形の変化を含む可能性のあるがんの種類は何ですか？:乳がん::", "男性だけに影響を与える最も一般的なタイプの癌は何ですか？:前立腺がん::", "結腸または直腸の細胞が制御不能に成長する癌のタイプは何ですか？:結腸直腸がん::", "長期の喫煙によって引き起こされる癌の種類は何ですか？:肺癌::", "太陽からの紫外線への過度の曝露によって引き起こされる癌の種類は何ですか？:皮膚ガン::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["特に動脈で、あなたの血液中の酸素の正常以下のレベルは何と呼ばれていますか？:低酸素血症::", "あなたの血液中のカルシウムの正常以下のレベルは何と呼ばれていますか？:低カルシウム血症::", "あなたの血液中のカルシウムの正常以上のレベルは何と呼ばれていますか？:高カルシウム血症::", "あなたの血液中のリン酸塩の正常以下のレベルは何と呼ばれていますか？:低リン血症::", "あなたの血液中のリン酸塩の通常以上のレベルは何と呼ばれていますか？:高リン血症::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["肌の黄変と目の白:肝炎:3,4,5:", "直腸の周りの発疹またはかゆみ:腸内寄生虫:2,7,8:", "背中に広がる可能性のある中等度から重度の腹痛:膵炎:1,3,4:", "激しい腹痛:胃潰瘍:6,7,8:", "下腹部の右側から始まる突然の痛み:虫垂炎:0,3,7:", "吐き気または胃のむかつきの再発:胃炎:4,2,1:", "肛門の周りの極端なかゆみ:痔核:0,2,3:", "排尿時の痛みや灼熱感:腎臓結石:3,9,1:", "肌の黄変と目の白:肝硬変:7,5,4:", "血便:クローン病:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["関節痛:関節炎:1,2,3:", "即時の激しい痛み:骨折:2,3:", "時間の経過に伴う身長の低下:骨粗鬆症:1,3,4:", "目に見えて湾曲した背骨:脊柱側弯症:0,1,2:", "影響を受けた関節の上の赤い光沢のある皮膚:痛風:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["ふくらはぎの大きな筋肉:筋ジストロフィー:2,3,4:", "片方の腕または片方の脚がもう一方よりも小さい:筋萎縮:2,3,4:", "動くと悪化する腱の痛み:腱炎:1,3,4:", "突然の鋭い痛み:筋肉のけいれん:1,2:", "筋肉を収縮させながら悪化する突然の痛み:筋肉の破裂:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["首、脇の下、鼠径部のリンパ節の痛みのない腫れ:リンパ腫:2,3:", "リンパ節の腫れ、肝臓または脾臓の腫大:白血病:2,3:", "震え:低体温症:0,1:", "腕や脚のしびれや脱力感:アテローム性動脈硬化症:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["突然の高熱、通常とは異なるように見える激しい頭痛:髄膜炎:1,2,3:", "片目の失明:多発性硬化症:0,3,4:", "手に震え:パーキンソン病:0,3,4:", "運動チック:トウレット症候群:0,1,4:", "集中力低下と記憶喪失:ハンチントン病:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["赤または腫れた歯茎:歯周炎:2,3,4:", "赤または腫れた歯茎:歯肉炎:2,3,4:", "歯痛:虫歯:0,4,3:", "嚥下の問題:扁桃腺炎:0,2,4:", "上顎の変形:口唇裂:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["耳から排出される液体:中耳炎:1,2,3:", "難聴:難聴:0,2,3:", "耳鳴り音:耳鳴り:0,1,3:", "めまい:メニエール病:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["曇ったビジョン:白内障:1,2,3:", "目の白のピンクまたは赤の色:結膜炎:0,2,3:", "激しい目の痛み:緑内障:0,1,3:", "奥行き知覚と周辺視野が悪い:弱視:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["胸や脇の下の新しいしこり:乳がん:1,2,3:", "血尿:前立腺がん:2,3,4:", "排便習慣の変化:結腸直腸がん:1,3,4:", "2、3週間経っても治らない咳:肺癌:1,2,4:", "色、サイズが変化する、または出血するほくろ:皮膚ガン:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["肌、指の爪、唇の青みがかった色:低酸素血症:1,2,3:", "手、顔、足のけいれん:低カルシウム血症:0,2,4:", "より頻繁な排尿と喉の渇き:高カルシウム血症:0,1:", "骨の衰弱:低リン血症:0,4:", "筋肉のけいれんやけいれん:高リン血症:0,1:"]);
  }

  void addKO(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.ko;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["간:1,2,3:29.2,45", "입:4,2,9:28.1,81.6", "식도:1,8,5:48.6,58.6", "대장:4,2,6:20.5,21", "소장:8,7,1:52.4,19", "위:4,6,7:66,41", "인두:5,2,9:48.6,81", "담낭:6,9,4:31.3,39.6", "췌장:2,1,0:50,35.1", "충수:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["해골:11,8,6:48,97", "견갑골:5,4,3:61.1,80.2", "갈비:11,7,0:56,74.1", "척추:8,10,1:45.9,65.2", "경골:5,9,3:51.4,23.6", "대퇴골:4,10,7:54.9,35.5", "후메 루스:2,7,9:69.1,66.2", "중수골 뼈:6,0,1:81.3,44.8", "손목 뼈:5,4,2:77.1,48.7", "족근 뼈:4,3,1:49.3,6.9", "중간 뼈:0,3,5:54.2,2.8", "골반:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["삼각근:4,1,5:65.3,80.2", "위팔두갈래근:5,0,4:67.3,71.5", "흉근:5,0,4:52.5,76.4", "승모근:1,5,4:51.4,85.5", "복부 외부 경사:1,5,0:54.2,65.9", "전 경골:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["심장:4,2,5:65.3,73", "대동맥:4,2,5:62.9,77.6", "신정맥:0,4,5:57.3,59.1", "신장 동맥:0,5,4:61.5,59.1", "경정맥:0,2,5:60.4,86.1", "대퇴 정맥:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["뇌:5,4,3:50.4,96.8", "소뇌:5,4,3:56,92.6", "척수:0,4,3:50.7,86.8", "좌골 신경:0,4,5:59.4,37.6", "경골 신경:1,5,3:61.1,19.4", "신경절:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["입술:1,2,4:61.4,96.6", "목젖:6,2,0:48.6,51.8", "어금니:0,6,1:76.1,33", "앞니:0,4,1:50.4,83", "혀:7,2,0:48.2,27.6", "톤실:4,0,6:69.5,46.8", "열개 구개:1,2,0:48.6,73.8", "소프트 구개:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["전두엽:1,2,4:25,58.5", "측두엽:0,2,3:51.2,42.2", "중간 엽:0,1,3:66,69", "후두엽:0,1,2:91,46", "소뇌:1,2,0:72.8,26.1", "브레인 스템:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["외이:1,2,4:8,31", "외이도:0,2,6:33.5,42.1", "고막:1,5,6:55.6,42", "귓속뼈:1,0,6:54.3,52.9", "달팽이관:6,1,5:75.8,45.7", "청각 신경:6,2,1:91.8,48", "유스타키오 관:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["대동맥:8,6,3:51.7,84.7", "우수한 대정맥:6,7,4:27.3,92", "하대 정맥:1,4,3:27.8,6.8", "오른쪽 아트리움:4,7,0:31,54.4", "왼쪽 아트리움:7,6,0:59.6,55.5", "중성 밸브:8,2,0:69.5,43.7", "우심실:0,1,3:47.8,38.9", "좌심실:1,8,3:58.1,43", "삼첨판:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["홍채:6,3,4:11.3,57", "각막:2,6,4:1.7,50.5", "수정체:1,4,6:19,51.3", "망막:1,6,4:64.6,76.8", "시신경:0,6,3:87.9,36.2", "전안방의:6,4,3:7.2,51.4", "초자체:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["세포핵:5,3,2:57.3,75.5", "핵소체:2,6,4:44.5,67.9,8", "세포질:1,4,6:93.08,50.09,9", "세포막:2,5,1:90,24,14", "리보솜:2,1,3:80.929,75.844,14", "미토콘드리아:1,2,3:51.4,90.35,18", "소포체:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["산소:1,2,4:74.5,29,25", "카본:2,0,4:74.5,57,25", "수소:1,0,5:74.5,73.2,25", "질소:1,0,2:74.5,83.5,25", "칼슘:0,1,2:74.5,91.2,25", "인:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["소화에 필요한 담즙을 생산하는 기관은?:0,7,6,8", "음식물을 공급받고 침을 생성하는 소화관의 첫 번째 부분은 무엇입니까?:1,2,6,5", "음식물이 인두에서 위로 넘어가는 기관은?:2,6,9,7", "소화 시스템의 마지막 부분은 어떤 기관입니까?:3,4,7,8", "음식에서 영양소와 미네랄이 가장 많이 흡수되는 곳은 어디입니까?:4,5,3,0", "음식물의 소화를 돕기 위해 소화효소와 위산을 분비하는 기관은?:5,4,7,3", "입과 비강 뒤에 있는 목 부분의 이름은 무엇입니까?:6,2,9,8", "담즙은 소장으로 배출되기 전에 어디에 저장되고 농축됩니까?:7,6,9,8", "인슐린은 어디에서 분비됩니까?:8,0,7,6", "오른쪽 아래 복부에는 어떤 기관이 있습니까?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["머리를 구성하는 뼈 구조는 무엇입니까?:0,1,9,7", "어깨뼈라고도 하는 것은 무엇입니까?:1,9,11,6", "흉강을 둘러싸고 있는 반강성 뼈와 연골 구조는 무엇입니까?:2,7,8,11", "척추동물의 특징은 무엇입니까?:3,0,11,2", "무릎 아래 다리의 두 뼈 중 더 큰 것은 무엇입니까?:4,6,9,5", "당신의 몸에서 가장 길고 강한 뼈는 무엇입니까?:5,6,9,1", "어깨에서 팔꿈치까지 이어지는 팔의 긴 뼈는 무엇입니까?:6,5,1,7", "지골과 손목 사이에 있는 5개의 손 뼈 그룹은 무엇입니까?:7,5,1,3", "손목을 구성하는 뼈는?:8,7,9,10", "각 발에 있는 7개의 관절 뼈는 무엇입니까?:9,7,8,1", "발에 있는 다섯 개의 긴 뼈 그룹은 무엇입니까?:10,8,7,4", "몸통의 아래쪽 부분은 무엇입니까?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["사람 어깨의 둥근 윤곽을 형성하는 근육은 무엇입니까?:0,1,3,5", "어깨와 팔꿈치 사이의 상완 앞쪽에 있는 큰 근육은 무엇입니까?:1,0,2,3", "인체의 가슴에는 어떤 근육이 있습니까?:2,3,5,1", "목 뒤쪽에 위치한 삼각형 근육은 무엇입니까?:3,1,2,5", "측면 복부 근육 중 가장 큰 근육은 무엇입니까?:4,1,2,0", "다리의 앞쪽 구획에 있는 4개의 근육 중 가장 큰 것은 무엇입니까?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["순환계의 혈관을 통해 혈액을 펌핑하는 근육 기관은 무엇입니까?:0,1,3,5", "인체에서 가장 큰 주요 동맥은 무엇입니까?:1,4,3,2", "신장을 배출하는 정맥은 무엇입니까?:2,5,4,1", "신장에 혈액을 공급하는 한 쌍의 동맥은 무엇입니까?:3,2,1,5", "머리에서 산소가 제거된 혈액을 다시 심장으로 보내는 정맥은 무엇입니까?:4,2,5,1", "허벅지 깊숙이 위치한 대정맥이란?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["신경계의 중추 역할을 하는 기관은?:0,1,2,5", "모든 척추동물의 후뇌의 주요 특징은 무엇입니까?:1,5,0,2", "신경 조직으로 구성된 길고 가느다란 관형 구조는 무엇입니까?:2,1,3,4", "고관절을 따라 흐르는 큰 신경은 무엇입니까?:3,2,1,5", "좌골신경의 분지란?:4,5,2,1", "말초 신경계의 뉴런 세포체 그룹은 무엇입니까?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["입을 둘러싸고 있는 근육주름이란?:0,1,4,7", "목구멍 위로 늘어진 다육질 확장은 무엇입니까?:1,4,0,7", "입 뒤쪽의 평평한 치아는 무엇입니까?:2,3,5,6", "앞니는 무엇입니까?:3,2,5,6", "입안의 근육 기관은 무엇입니까?:4,5,6,1", "면역 체계에서 어떤 기관이 중요한 역할을 하나요?:5,1,4,0", "안면 골격의 두 뼈로 구성된 얇은 수평 골판이란 무엇입니까?:6,7,2,5", "입천장 뒤쪽을 구성하는 연조직은 무엇입니까?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["뇌의 네 가지 주요 엽 중 가장 큰 것은 무엇입니까?:0,3,1,4", "귀 뒤에 있는 것은 무엇이며 두 번째로 큰 엽은 무엇입니까?:1,0,3,2", "촉각, 온도, 통증을 포함한 감각의 지각에는 무엇이 관련되어 있습니까?:2,0,3,5", "뇌의 시각 처리 센터는 무엇입니까?:3,0,1,4", "균형 조절에서 중요한 역할을 하는 것은 무엇입니까?:4,5,0,1", "심박수와 호흡수를 조절하는 데 도움이 되는 것은 무엇입니까?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["머리 바깥쪽에 보이는 귀 부분은 무엇입니까?:0,3,6,2", "외이에서 중이로 이어지는 경로는 무엇입니까?:1,2,3,0", "북처럼 팽팽하게 뻗어 있고 소리가 치면 진동하는 얇은 피부는 무엇입니까?:2,0,5,3", "인체에서 가장 작은 뼈 중 중이의 세 뼈는 무엇입니까?:3,0,6,2", "달팽이 껍데기와 비슷한 것은?:4,2,0,6", "내이의 달팽이관에서 직접 뇌로 청각 감각 정보를 전달하는 것은 무엇입니까?:5,2,0,6", "청각 관이라고도 하는 것은 무엇입니까?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["인체에서 가장 큰 주요 동맥은 무엇입니까?:0,3,8,6", "어느 정맥이 머리, 목, 팔, 가슴에서 심장으로 혈액을 운반합니까?:1,3,0,2", "어느 정맥이 하체에서 심장으로 혈액을 운반합니까?:2,1,0,3", "혈액이 심장의 심실로 들어가는 상부 챔버는 무엇입니까?:3,5,6,2", "폐에서 산소가 공급된 혈액을 받는 심실은?:4,3,6,8", "심장의 왼쪽에 있는 두 개의 방을 분리하는 판막은 무엇입니까?:5,8,7,3", "심장에서 순환계로 혈액을 펌핑하는 근육실이란 무엇입니까?:6,5,8,2", "심장의 네 방 중 하나는 무엇입니까?:7,0,1,2", "그 역할은 우심실에서 우심방으로 혈액이 역류하는 것을 방지하는 것입니다.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["동공의 직경과 크기를 조절하는 눈의 얇은 구조는 무엇입니까?:0,1,3,2", "홍채를 덮고 있는 눈의 투명한 앞부분은 무엇입니까?:1,2,3,0", "망막에 초점을 맞추기 위해 빛을 굴절시키는 데 도움이되는 눈의 투명한 구조는 무엇입니까?:2,3,0,1", "눈 조직의 가장 안쪽, 빛에 민감한 층은 무엇입니까?:3,1,0,2", "망막에서 뇌로 시각 정보를 전달하는 것은 무엇입니까?:4,6,5,3", "각막과 홍채 사이의 눈 앞 부분은 무엇입니까?:5,6,2,3", "수정체 뒤와 시신경 앞에 있는 안방은?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["세포의 한가운데에 무엇이 있으며 염색체에 배열된 DNA가 들어 있습니까?:0,1,2,3", "세포 내에서 세포 리보솜 생성과 관련된 영역은 무엇입니까?:1,2,3,4", "세포 내부를 채우는 젤라틴 액체는 무엇입니까?:2,3,4,5", "세포를 외부 환경으로부터 보호하는 것은 무엇입니까?:3,4,2,1", "단백질을 생산하는 세포 구조는 무엇입니까?:4,3,2,1", "화학 에너지를 세포가 사용할 수 있는 에너지 형태로 변환하는 것은 무엇입니까?:5,4,3,2", "진핵 세포의 수송 시스템은 무엇입니까?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["세포 호흡 과정에서 음식을 산화시켜 에너지를 방출하는 데 사용되는 것은 무엇입니까?:0,1,2,3", "인체에서 두 번째로 풍부한 원소는 무엇입니까?:1,2,3,4", "인체의 수분을 유지하기 위해 무엇을 사용합니까?:2,3,4,5", "우리 몸에서 단백질을 만드는 아미노산을 만드는 데 사용되는 것은 무엇입니까?:3,5,4", "튼튼한 뼈를 만들고 유지하기 위해 무엇을 사용합니까?:4,0,1,2", "뼈와 치아의 형성에 사용되는 것은 무엇입니까?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["간에 염증이 생기는 질환은?:간염::", "기생충이 사람의 위장관을 감염시키는 질병은 무엇입니까?:장내 기생충::", "췌장에 염증이 생기는 질환은?:췌장염::", "위 내벽의 파열을 일으키는 질병은 무엇입니까?:위궤양::", "맹장에 염증이 생기는 질병은 무엇입니까?:충수염::", "위 내벽에 염증이 생기는 질환은?:위염::", "직장 하부에 부은 정맥을 일으키는 질병은 무엇입니까?:치질::", "미네랄과 소금으로 만들어진 단단한 퇴적물은 무엇입니까?:신장 결석::", "장기간의 간 손상으로 인한 간의 흉터는 무엇입니까?:경화증::", "염증성 장질환의 종류는?:크론병::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["관절에 통증과 염증을 일으키는 질병은?:관절염::", "뼈의 연속성의 끊김이란 무엇입니까?:뼈 골절::", "어떤 질병이 뼈를 약화시켜 뼈를 약하게 만들고 부러지기 쉽게 합니까?:골다공증::", "척추가 옆으로 휘는 질환은?:척추 측만증::", "갑작스럽고 심한 관절 통증을 유발하는 관절염의 유형은 무엇입니까?:통풍::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["진행성 약화 및 근육량 감소를 유발하는 질병은 무엇입니까?:근이영양증::", "운동 부족으로 생기는 질병은?:근육 위축::", "어떤 질병이 힘줄의 염증이나 자극을 유발합니까?:건염::", "근육 중 하나의 갑작스럽고 비자발적인 수축은 무엇입니까?:근육 경련::", "근육이 과도하게 늘어나거나 찢어지면 어떻게 됩니까?:근육 파열::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["신체 면역 체계의 일부인 세포에서 시작되는 암의 유형은 무엇입니까?:림프종::", "일반적으로 골수에서 시작되는 암의 유형은 무엇입니까?:백혈병::", "매우 추운 온도에 장기간 노출되면 어떻게 됩니까?:저체온증::", "점진적인 플라크 축적으로 인한 동맥 경화는 무엇입니까?:죽상 동맥 경화증::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["뇌와 척수를 덮고 있는 보호막의 급성 염증은 무엇입니까?:수막염::", "뇌와 척수에 영향을 미치고 시력, 균형, 근육 조절에 문제를 일으킬 수 있는 질병은 무엇입니까?:다발성 경화증::", "떨림, 뻣뻣함, 걷기, 균형 및 협응에 어려움을 일으키는 뇌 장애는 무엇입니까?:파킨슨 병::", "다중 움직임 틱과 적어도 하나의 음성 틱이 특징인 것은 무엇입니까?:투렛 증후군::", "뇌세포를 손상시키는 난치성 유전성 뇌질환이란?:헌팅턴 병::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["연조직을 손상시키고 치아를 지지하는 뼈를 파괴할 수 있는 심각한 잇몸 감염은 무엇입니까?:치주염::", "잇몸 염증, 발적 및 붓기를 유발하는 가벼운 형태의 잇몸 질환은 무엇입니까?:치은염::", "치아의 단단한 표면에서 영구적으로 손상된 부분은 무엇입니까?:충치::", "인후 뒤쪽 편도선의 감염은 무엇입니까?:편도염::", "입술을 구성하는 조직이 출생 전에 완전히 결합되지 않으면 어떻게 됩니까?:구순 구개열::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["기억력과 사고력, 그리고 궁극적으로 가장 단순한 작업을 수행하는 능력을 파괴하는 뇌 장애는 무엇입니까?:알츠하이머병::", "뇌에 염증이 생기는 드물지만 심각한 상태는 무엇입니까?:뇌염::", "중등도에서 중증의 재발성 두통을 특징으로 하는 두통 장애란 무엇입니까?:편두통::", "뇌에 영향을 미치고 빈번한 발작을 일으키는 질병은 무엇입니까?:간질::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["바이러스나 박테리아가 고막 뒤 부위에 염증을 일으키면 어떻게 됩니까?:중이염‎::", "소리를 듣지 못하는 전체 또는 부분적 무능력이란 무엇입니까?:난청::", "소리의 외부 소스가 없을 때 소리가 들리는 상태는 무엇입니까?:이명::", "현기증(현기증)과 청력 상실을 유발할 수 있는 내이 장애는 무엇입니까?:메니에르병::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["심장 근육으로의 혈류 감소로 인한 흉통은 무엇입니까?:협심증::", "정상보다 높은 혈압은 무엇입니까?:고혈압::", "혈류가 심장의 관상동맥으로 감소하거나 멈추면 어떻게 됩니까?:심근 경색증::", "심장이 혈액을 효율적으로 펌프질하지 못하는 심각한 상태는 무엇입니까?:울혈 성 심부전증::", "혈중 콜레스테롤 수치가 높다는 것은 무엇입니까?:고콜레스테롤혈증::", "심장 리듬의 이상은 무엇입니까?:부정맥::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["시력 저하로 이어지는 눈 수정체의 흐린 부분은 무엇입니까?:백내장::", "감염이나 알레르기로 인한 눈 상태는 무엇입니까?:결막염::", "눈과 뇌를 연결하는 시신경이 손상되는 눈의 상태는?:녹내장::", "뇌가 한쪽 눈의 입력을 완전히 처리하지 못하고 시간이 지남에 따라 다른 쪽 눈을 선호하는 시력 장애는 무엇입니까?:약시::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["유방의 덩어리 또는 유방 모양의 변화를 포함할 수 있는 암의 유형은 무엇입니까?:유방암::", "남성에게만 발생하는 가장 흔한 유형의 암은 무엇입니까?:전립선암::", "결장이나 직장의 세포가 통제 불능으로 자라는 암의 유형은 무엇입니까?:대장암::", "장기간 담배를 피우면 어떤 종류의 암이 발생합니까?:폐암::", "태양의 자외선에 과도하게 노출되면 어떤 종류의 암이 발생합니까?:피부암::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["혈액, 특히 동맥의 정상 미만 산소 수치는 얼마입니까?:저산소혈증::", "혈액 내 칼슘 수치가 정상 이하인 것을 무엇이라고 합니까?:저칼슘혈증::", "혈액 내 칼슘 수치가 정상 이상인 것을 무엇이라고 합니까?:고칼슘혈증::", "혈액 내 정상 이하의 인산염 수치를 무엇이라고 합니까?:저인산혈증::", "혈액 내 정상 이상의 인산염 수치를 무엇이라고 합니까?:고인산혈증::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["피부와 눈 흰자위의 황변:간염:3,4,5:", "직장 주변의 발진 또는 가려움증:장내 기생충:2,7,8:", "등으로 퍼질 수 있는 중등도에서 중증 복통:췌장염:1,3,4:", "심한 복통:위궤양:6,7,8:", "하복부 오른쪽에서 시작되는 갑작스러운 통증:충수염:0,3,7:", "메스꺼움 또는 반복적인 배탈:위염:4,2,1:", "항문 주변의 극심한 가려움증:치질:0,2,3:", "배뇨 시 통증 또는 작열감:신장 결석:3,9,1:", "피부와 눈 흰자위의 황변:경화증:7,5,4:", "대변의 피:크론병:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["관절 통증:관절염:1,2,3:", "즉각적인 심한 통증:뼈 골절:2,3:", "시간이 지남에 따라 키 감소:골다공증:1,3,4:", "눈에 띄게 휘어진 척추:척추 측만증:0,1,2:", "영향을 받은 관절 위의 붉고 빛나는 피부:통풍:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["큰 종아리 근육:근이영양증:2,3,4:", "한쪽 팔 또는 한쪽 다리가 다른 쪽보다 작습니다.:근육 위축:2,3,4:", "움직일 때 악화되는 힘줄의 통증:건염:1,3,4:", "갑작스럽고 날카로운 통증:근육 경련:1,2:", "근육을 수축하는 동안 악화되는 갑작스러운 통증:근육 파열:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["목, 겨드랑이 또는 사타구니 림프절의 통증 없는 부기:림프종:2,3:", "부은 림프절, 간 또는 비장 비대:백혈병:2,3:", "떨림:저체온증:0,1:", "팔이나 다리의 마비 또는 약점:죽상 동맥 경화증:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["갑작스런 고열, 평소와 다른 심한 두통:수막염:1,2,3:", "한쪽 눈의 실명:다발성 경화증:0,3,4:", "손에 떨림:파킨슨 병:0,3,4:", "움직임 틱:투렛 증후군:0,1,4:", "집중력 저하 및 기억 상실:헌팅턴 병:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["잇몸이 붉거나 부어오름:치주염:2,3,4:", "잇몸이 붉거나 부어오름:치은염:2,3,4:", "치통:충치:0,4,3:", "삼키는 문제:편도염:0,2,4:", "위턱의 기형:구순 구개열:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["귀에서 흘러나오는 액체:중이염‎:1,2,3:", "청력 상실:난청:0,2,3:", "귀에서 울리는 소리:이명:0,1,3:", "선회:메니에르병:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["흐린 시야:백내장:1,2,3:", "눈의 흰자위에서 분홍색 또는 붉은 색:결막염:0,2,3:", "심한 눈 통증:녹내장:0,1,3:", "깊이 지각 및 주변 시력 불량:약시:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["유방이나 겨드랑이의 새로운 덩어리:유방암:1,2,3:", "소변의 혈액:전립선암:2,3,4:", "배변 습관의 변화:대장암:1,3,4:", "2~3주 후에도 사라지지 않는 기침:폐암:1,2,4:", "색, 크기가 변하거나 피가 나는 점:피부암:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["피부, 손톱, 입술이 푸르스름한 색:저산소혈증:1,2,3:", "손, 얼굴, 발에 경련:저칼슘혈증:0,2,4:", "더 잦은 배뇨와 갈증:고칼슘혈증:0,1:", "뼈의 약화:저인산혈증:0,4:", "근육 경련 또는 경련:고인산혈증:0,1:"]);
  }

  void addMS(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.ms;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Hati:1,2,3:29.2,45", "Mulut:4,2,9:28.1,81.6", "Esofagus:1,8,5:48.6,58.6", "usus besar:4,2,6:20.5,21", "Usus kecil:8,7,1:52.4,19", "Perut:4,6,7:66,41", "Farinks:5,2,9:48.6,81", "Pundi hempedu:6,9,4:31.3,39.6", "Pankreas:2,1,0:50,35.1", "Apendiks:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Tengkorak:11,8,6:48,97", "Tulang belikat:5,4,3:61.1,80.2", "tulang rusuk:11,7,0:56,74.1", "tulang belakang:8,10,1:45.9,65.2", "Tulang kering:5,9,3:51.4,23.6", "Femur:4,10,7:54.9,35.5", "Humerus:2,7,9:69.1,66.2", "Metakarpus:6,0,1:81.3,44.8", "Karpus:5,4,2:77.1,48.7", "Tarsus:4,3,1:49.3,6.9", "tulang metatarsal:0,3,5:54.2,2.8", "Pelvis:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["otot deltoid:4,1,5:65.3,80.2", "otot bisep:5,0,4:67.3,71.5", "Pektoral:5,0,4:52.5,76.4", "otot trapezius:1,5,4:51.4,85.5", "Serong luaran abdomen:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Jantung:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "urat renal:0,4,5:57.3,59.1", "Arteri renal:0,5,4:61.5,59.1", "Urat jugulum:0,2,5:60.4,86.1", "Pembuluh darah femoral:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Otak:5,4,3:50.4,96.8", "Serebelum:5,4,3:56,92.6", "Kord tulang belakang:0,4,3:50.7,86.8", "Saraf Sciatic:0,4,5:59.4,37.6", "Tibial saraf:1,5,3:61.1,19.4", "Ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Bibir:1,2,4:61.4,96.6", "Uvula:6,2,0:48.6,51.8", "Gigi geraham:0,6,1:76.1,33", "Gigi kacip:0,4,1:50.4,83", "Lidah:7,2,0:48.2,27.6", "Tonsil:4,0,6:69.5,46.8", "lelangit keras:1,2,0:48.6,73.8", "lelangit lembut:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Lobus Frontal:1,2,4:25,58.5", "Lobus Temporal:0,2,3:51.2,42.2", "Lobus Parietal:0,1,3:66,69", "Lobus Oksipital:0,1,2:91,46", "Serebelum:1,2,0:72.8,26.1", "Batang otak:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Cuping:1,2,4:8,31", "Telinga telinga:0,2,6:33.5,42.1", "Drum telinga:1,5,6:55.6,42", "Osikel:1,0,6:54.3,52.9", "koklea:6,1,5:75.8,45.7", "Saraf auditori:6,2,1:91.8,48", "Tiub Eustachian:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Superior vena cava:6,7,4:27.3,92", "Inferior vena cava:1,4,3:27.8,6.8", "Atrium kanan:4,7,0:31,54.4", "Atrium kiri:7,6,0:59.6,55.5", "Mitral injap:8,2,0:69.5,43.7", "Ventrikel kanan:0,1,3:47.8,38.9", "Ventrikel kiri:1,8,3:58.1,43", "Injap Tricuspid:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "Kornea:2,6,4:1.7,50.5", "Lensa:1,4,6:19,51.3", "Retina:1,6,4:64.6,76.8", "Saraf optik:0,6,3:87.9,36.2", "kebuk anterior:6,4,3:7.2,51.4", "ruang vitreous:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Nukleus:5,3,2:57.3,75.5", "Nukleolus:2,6,4:44.5,67.9,8", "Sitoplasma:1,4,6:93.08,50.09,9", "Membran sel:2,5,1:90,24,14", "Ribosom:2,1,3:80.929,75.844,14", "Mitokondria:1,2,3:51.4,90.35,18", "Retikulum endoplasma:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oksigen:1,2,4:74.5,29,25", "Karbon:2,0,4:74.5,57,25", "Hidrogen:1,0,5:74.5,73.2,25", "Nitrogen:1,0,2:74.5,83.5,25", "Kalsium:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Apakah organ yang menghasilkan hempedu yang diperlukan untuk penghadaman?:0,7,6,8", "Apakah bahagian pertama saluran pencernaan yang menerima makanan dan menghasilkan air liur?:1,2,6,5", "Melalui organ manakah makanan melalui farinks ke perut?:2,6,9,7", "Apakah organ bahagian terakhir sistem pencernaan?:3,4,7,8", "Di manakah penyerapan nutrien dan mineral yang paling banyak daripada makanan berlaku?:4,5,3,0", "Organ apakah yang merembeskan enzim pencernaan dan asid gastrik untuk membantu penghadaman makanan?:5,4,7,3", "Apakah bahagian tekak di belakang mulut dan rongga hidung dinamakan?:6,2,9,8", "Di manakah hempedu disimpan dan tertumpu sebelum dilepaskan ke dalam usus kecil?:7,6,9,8", "Dari manakah insulin dirembeskan?:8,0,7,6", "Apakah organ yang terletak di bahagian bawah abdomen kanan?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Apakah struktur tulang yang membentuk kepala?:0,1,9,7", "Apa yang dikenali juga sebagai tulang bahu?:1,9,11,6", "Apakah struktur tulang separa tegar dan tulang rawan yang mengelilingi rongga toraks?:2,7,8,11", "Apakah ciri yang menentukan bagi vertebrata?:3,0,11,2", "Apakah yang lebih besar daripada dua tulang di kaki di bawah lutut?:4,6,9,5", "Apakah tulang terpanjang dan terkuat dalam badan anda?:5,6,9,1", "Apakah tulang panjang di lengan yang berjalan dari bahu ke siku?:6,5,1,7", "Apakah kumpulan lima tulang tangan di antara falang dan pergelangan tangan?:7,5,1,3", "Apakah tulang yang membentuk pergelangan tangan?:8,7,9,10", "Apakah gugusan tujuh tulang artikulasi pada setiap kaki?:9,7,8,1", "Apakah kumpulan lima tulang panjang di kaki?:10,8,7,4", "Apakah bahagian bawah batang tubuh?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Apakah otot yang membentuk kontur bulat bahu manusia?:0,1,3,5", "Apakah otot besar yang terletak di bahagian hadapan lengan atas antara bahu dan siku?:1,0,2,3", "Apakah otot yang terletak di dada badan manusia?:2,3,5,1", "Apakah otot segi tiga yang terletak pada bahagian belakang leher?:3,1,2,5", "Otot apakah yang terbesar di antara otot perut sisi?:4,1,2,0", "Apakah yang terbesar daripada 4 otot dalam petak anterior kaki?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Apakah organ otot yang mengepam darah melalui saluran darah sistem peredaran darah?:0,1,3,5", "Apakah arteri utama dan terbesar dalam tubuh manusia?:1,4,3,2", "Apakah urat yang mengalirkan buah pinggang?:2,5,4,1", "Apakah arteri berpasangan yang membekalkan darah kepada buah pinggang?:3,2,1,5", "Apakah urat yang mengambil darah terdeoksigen dari kepala kembali ke jantung?:4,2,5,1", "Apakah urat besar yang terletak jauh di dalam paha?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Apakah organ yang berfungsi sebagai pusat sistem saraf?:0,1,2,5", "Apakah ciri utama otak belakang semua vertebrata?:1,5,0,2", "Apakah struktur tiub yang panjang, nipis dan terdiri daripada tisu saraf?:2,1,3,4", "Apakah saraf besar yang berjalan di sepanjang sendi pinggul?:3,2,1,5", "Apakah cabang saraf sciatic?:4,5,2,1", "Apakah kumpulan badan sel neuron dalam sistem saraf periferi?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Apakah lipatan otot yang mengelilingi mulut?:0,1,4,7", "Apakah sambungan berdaging yang tergantung di atas tekak?:1,4,0,7", "Apakah gigi rata di bahagian belakang mulut?:2,3,5,6", "Apakah gigi hadapan?:3,2,5,6", "Apakah organ berotot di dalam mulut?:4,5,6,1", "Apakah organ yang memainkan peranan penting dalam sistem imun?:5,1,4,0", "Apakah plat tulang melintang nipis yang terdiri daripada dua tulang rangka muka?:6,7,2,5", "Apakah tisu lembut yang membentuk bahagian belakang bumbung mulut?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Apakah yang terbesar daripada empat lobus utama otak?:0,3,1,4", "Apakah yang terletak di belakang telinga dan merupakan lobus kedua terbesar?:1,0,3,2", "Apakah yang terlibat dalam persepsi sensasi, termasuk sentuhan, suhu, kesakitan?:2,0,3,5", "Apakah pusat pemprosesan visual otak?:3,0,1,4", "Apakah yang memainkan peranan penting dalam kawalan keseimbangan?:4,5,0,1", "Apakah yang membantu mengawal kadar denyutan jantung dan kadar pernafasan?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Apakah bahagian telinga yang boleh dilihat di luar kepala?:0,3,6,2", "Apakah laluan yang mengalir dari telinga luar ke telinga tengah?:1,2,3,0", "Apakah kepak kulit nipis yang diregangkan ketat seperti dram dan bergetar apabila bunyi mengenainya?:2,0,5,3", "Apakah tiga tulang di telinga tengah yang merupakan antara tulang terkecil dalam tubuh manusia?:3,0,6,2", "Apakah yang menyerupai kulit siput?:4,2,0,6", "Apakah yang membawa maklumat deria pendengaran dari koklea telinga dalam terus ke otak?:5,2,0,6", "Apakah yang juga dikenali sebagai tiub pendengaran?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Apakah arteri utama dan terbesar dalam tubuh manusia?:0,3,8,6", "Vena manakah yang membawa darah dari kepala, leher, lengan dan dada anda kembali ke jantung anda?:1,3,0,2", "Vena manakah yang membawa darah dari bahagian bawah badan anda kembali ke jantung anda?:2,1,0,3", "Apakah ruang atas yang melaluinya darah memasuki ventrikel jantung?:3,5,6,2", "apakah ruang jantung yang menerima darah beroksigen daripada paru-paru?:4,3,6,8", "Apakah injap yang memisahkan dua ruang bahagian kiri jantung?:5,8,7,3", "Apakah ruang otot yang mengepam darah keluar dari jantung dan ke dalam sistem peredaran darah?:6,5,8,2", "Yang manakah merupakan satu daripada empat ruang jantung?:7,0,1,2", "Ia berperanan untuk menghalang aliran balik darah dari ventrikel kanan ke atrium kanan.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Apakah struktur nipis pada mata, bertanggungjawab untuk mengawal diameter dan saiz murid?:0,1,3,2", "Apakah bahagian depan mata lutsinar yang menutupi iris?:1,2,3,0", "Apakah struktur lutsinar dalam mata yang membantu membiaskan cahaya untuk difokuskan pada retina?:2,3,0,1", "Apakah lapisan tisu mata yang paling dalam dan peka cahaya?:3,1,0,2", "Apakah yang menghantar maklumat visual dari retina ke otak?:4,6,5,3", "Apakah bahagian hadapan mata antara kornea dan iris?:5,6,2,3", "Apakah ruang mata yang terletak di belakang kanta dan di hadapan saraf optik?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Apakah yang terdapat di tengah-tengah sel dan ia mengandungi DNA yang tersusun dalam kromosom?:0,1,2,3", "Apakah kawasan di dalam sel yang berkaitan dengan penghasilan ribosom sel?:1,2,3,4", "Apakah cecair gelatin yang memenuhi bahagian dalam sel?:2,3,4,5", "Apakah yang melindungi sel daripada persekitaran luarannya?:3,4,2,1", "Apakah struktur sel yang menghasilkan protein?:4,3,2,1", "Apakah yang menukarkan tenaga kimia kepada bentuk tenaga yang boleh digunakan oleh sel?:5,4,3,2", "Apakah sistem pengangkutan sel eukariotik?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Apakah yang digunakan untuk mengoksidakan makanan kita, dalam proses respirasi selular, dengan itu membebaskan tenaga?:0,1,2,3", "Apakah unsur kedua paling banyak dalam tubuh manusia?:1,2,3,4", "Apakah yang digunakan untuk mengekalkan badan manusia terhidrat?:2,3,4,5", "Apakah yang digunakan untuk membuat asid amino dalam badan kita yang seterusnya menghasilkan protein?:3,5,4", "Apakah yang digunakan untuk membina dan mengekalkan tulang yang kuat?:4,0,1,2", "Apakah yang digunakan dalam pembentukan tulang dan gigi?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Apakah penyakit di mana hati anda meradang?:Hepatitis::", "Apakah penyakit di mana parasit menjangkiti saluran gastro-usus manusia?:Parasit usus::", "Apakah penyakit di mana pankreas anda meradang?:Pankreatitis::", "Apakah penyakit yang menyebabkan pecahnya lapisan dalam perut?:Ulser gastrik::", "Apakah penyakit di mana apendiks anda meradang?:Apendisitis::", "Apakah penyakit di mana lapisan dalam perut anda meradang?:Gastritis::", "Apakah penyakit yang menyebabkan urat bengkak di bahagian bawah rektum anda?:buasir::", "Apakah mendapan keras yang diperbuat daripada mineral dan garam?:Batu karang::", "Apakah parut pada hati yang disebabkan oleh kerosakan hati jangka panjang?:Sirosis::", "Apakah jenis penyakit radang usus?:penyakit Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Apakah penyakit yang menyebabkan sakit dan keradangan pada sendi?:Sakit sendi::", "Apakah yang dimaksudkan dengan pecahnya kesinambungan tulang?:Patah tulang::", "Apakah penyakit yang melemahkan tulang, menjadikannya rapuh dan lebih cenderung untuk patah?:Osteoporosis::", "Apakah penyakit yang menyebabkan kelengkungan tulang belakang ke sisi?:Scoliosis::", "Apakah jenis arthritis yang menyebabkan sakit sendi yang mendadak dan teruk?:Gout::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Apakah penyakit yang menyebabkan kelemahan progresif dan kehilangan jisim otot?:distrofi otot::", "Apakah penyakit yang disebabkan oleh kekurangan aktiviti fizikal?:atrofi otot::", "Apakah penyakit yang menyebabkan keradangan atau kerengsaan tendon?:tendinitis::", "Apakah penguncupan salah satu otot anda secara tiba-tiba dan tidak disengajakan?:kekejangan otot::", "Apa yang berlaku apabila otot anda terlalu tegang atau koyak?:pecah otot::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Apakah jenis kanser yang bermula dalam sel yang merupakan sebahagian daripada sistem imun badan?:Limfoma::", "Apakah jenis kanser yang biasanya bermula di sumsum tulang?:Leukemia::", "Apakah yang disebabkan oleh pendedahan berpanjangan kepada suhu yang sangat sejuk?:Hipotermia::", "Apakah pengerasan arteri anda yang disebabkan oleh pembentukan plak secara beransur-ansur?:Aterosklerosis::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Apakah keradangan akut pada membran pelindung yang meliputi otak dan saraf tunjang?:Radang meninges::", "Apakah penyakit yang boleh menjejaskan otak dan saraf tunjang anda, dan boleh menyebabkan masalah dengan penglihatan, keseimbangan, kawalan otot?:Sklerosis berbilang::", "Apakah gangguan otak yang membawa kepada gegaran, kekakuan, dan kesukaran berjalan, keseimbangan dan koordinasi?:penyakit Parkinson::", "Apakah yang dicirikan oleh pelbagai tics pergerakan dan sekurang-kurangnya satu tic vokal?:Sindrom Tourette::", "Apakah gangguan otak keturunan yang tidak boleh diubati yang merosakkan sel-sel otak?:penyakit Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Apakah jangkitan gusi yang serius yang merosakkan tisu lembut dan boleh memusnahkan tulang yang menyokong gigi anda?:Radang periodontium::", "Apakah bentuk penyakit gusi ringan yang menyebabkan kerengsaan, kemerahan dan bengkak gingiva anda?:Radang gusi::", "Apakah kawasan yang rosak kekal di permukaan keras gigi anda?:Pereputan gigi::", "Apakah jangkitan tonsil di bahagian belakang tekak anda?:Sakit tekak::", "Apakah yang berlaku jika tisu yang membentuk bibir tidak bercantum sepenuhnya sebelum dilahirkan?:Sumbing bibir::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Apakah gangguan otak yang memusnahkan ingatan dan kemahiran berfikir dan, akhirnya, keupayaan untuk menjalankan tugas yang paling mudah?:Penyakit Alzheimer::", "Apakah keadaan luar biasa tetapi serius di mana otak menjadi meradang?:Ensefalitis::", "Apakah gangguan sakit kepala yang dicirikan oleh sakit kepala berulang yang sederhana hingga teruk?:Migrain::", "Apakah penyakit yang menjejaskan otak dan menyebabkan sawan kerap?:Epilepsi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Apakah yang berlaku apabila virus atau bakteria menyebabkan kawasan di belakang gegendang telinga meradang?:Otitis‎::", "Apakah yang merujuk kepada ketidakupayaan keseluruhan atau separa untuk mendengar bunyi?:Pekak::", "Apakah keadaan di mana anda mendengar bunyi apabila tiada sumber bunyi di luar?:Tinnitus::", "Apakah gangguan pada telinga dalam yang boleh menyebabkan pening (vertigo) dan kehilangan pendengaran?:penyakit Meniere::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Apakah sakit dada yang disebabkan oleh pengurangan aliran darah ke otot jantung?:Angina::", "Apakah tekanan darah yang lebih tinggi daripada biasa?:Hipertensi::", "Apakah yang berlaku apabila aliran darah berkurangan atau berhenti ke arteri koronari jantung?:Infarksi miokardium::", "Apakah keadaan serius di mana jantung tidak mengepam darah dengan cekap seperti yang sepatutnya?:Kegagalan jantung kongestif::", "Apakah perkataan untuk tahap kolesterol yang tinggi dalam darah?:Hiperkolesterolemia::", "Apakah kelainan irama jantung?:Aritmia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Apakah kawasan mendung dalam kanta mata yang menyebabkan penurunan penglihatan?:Katarak::", "Apakah keadaan mata yang disebabkan oleh jangkitan atau alahan?:konjunktivitis::", "Apakah keadaan mata di mana saraf optik, yang menghubungkan mata ke otak, menjadi rosak?:Glaukoma::", "Apakah gangguan penglihatan di mana otak gagal memproses sepenuhnya input dari satu mata dan lama-kelamaan memihak kepada mata yang lain?:Ambliopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Apakah jenis kanser yang mungkin termasuk ketulan pada payudara atau perubahan dalam bentuk payudara?:Kanser payudara::", "Apakah jenis kanser yang paling biasa yang hanya menyerang lelaki?:Kanser prostat::", "Apakah jenis kanser di mana sel-sel dalam kolon atau rektum tumbuh di luar kawalan?:Kanser kolorektal::", "Apakah jenis kanser yang disebabkan oleh merokok tembakau jangka panjang?:Kanser paru-paru::", "Apakah jenis kanser yang disebabkan oleh pendedahan berlebihan kepada sinaran ultraungu dari matahari?:Kanser kulit::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Apakah paras oksigen di bawah normal dalam darah anda dipanggil, khususnya dalam arteri?:Hipoksemia::", "Apakah paras kalsium di bawah normal dalam darah anda dipanggil?:Hipokalsemia::", "Apakah paras kalsium yang melebihi normal dalam darah anda dipanggil?:Hiperkalsemia::", "Apakah paras fosfat di bawah normal dalam darah anda dipanggil?:hipofosfatemia::", "Apakah paras fosfat di atas normal dalam darah anda dipanggil?:Hiperfosfatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Kekuningan kulit dan putih mata anda:Hepatitis:3,4,5:", "Ruam atau gatal-gatal di sekitar rektum:Parasit usus:2,7,8:", "Sakit perut sederhana hingga teruk yang mungkin merebak ke belakang anda:Pankreatitis:1,3,4:", "Sakit perut yang teruk:Ulser gastrik:6,7,8:", "Sakit secara tiba-tiba yang bermula di sebelah kanan perut bawah:Apendisitis:0,3,7:", "Loya atau sakit perut berulang:Gastritis:4,2,1:", "Gatal-gatal yang melampau di sekitar dubur:buasir:0,2,3:", "Sakit atau rasa terbakar semasa membuang air kecil:Batu karang:3,9,1:", "Kekuningan kulit dan putih mata anda:Sirosis:7,5,4:", "Darah dalam najis:penyakit Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["sakit sendi:Sakit sendi:1,2,3:", "serta-merta, sakit teruk:Patah tulang:2,3:", "Kehilangan ketinggian dari semasa ke semasa:Osteoporosis:1,3,4:", "tulang belakang yang kelihatan melengkung:Scoliosis:0,1,2:", "kulit merah berkilat di atas sendi yang terjejas:Gout:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Otot betis yang besar:distrofi otot:2,3,4:", "Satu lengan atau satu kaki lebih kecil daripada yang lain:atrofi otot:2,3,4:", "sakit pada tendon yang menjadi lebih teruk apabila anda bergerak:tendinitis:1,3,4:", "Sakit yang tiba-tiba dan tajam:kekejangan otot:1,2:", "sakit secara tiba-tiba yang bertambah teruk semasa mengecutkan otot:pecah otot:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Pembengkakan nodus limfa yang tidak menyakitkan di leher, ketiak atau pangkal paha anda:Limfoma:2,3:", "Nodus limfa bengkak, hati atau limpa membesar:Leukemia:2,3:", "Menggigil:Hipotermia:0,1:", "Kebas atau kelemahan pada lengan atau kaki anda:Aterosklerosis:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Demam tinggi secara tiba-tiba, sakit kepala teruk yang kelihatan berbeza dari biasa:Radang meninges:1,2,3:", "buta sebelah mata:Sklerosis berbilang:0,3,4:", "Gegaran di tangan:penyakit Parkinson:0,3,4:", "tics pergerakan:Sindrom Tourette:0,1,4:", "kesukaran menumpukan perhatian dan hilang ingatan:penyakit Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Gusi merah atau bengkak:Radang periodontium:2,3,4:", "Gusi merah atau bengkak:Radang gusi:2,3,4:", "Sakit gigi:Pereputan gigi:0,4,3:", "masalah menelan:Sakit tekak:0,2,4:", "Kecacatan rahang atas:Sumbing bibir:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["cecair yang mengalir dari telinga:Otitis‎:1,2,3:", "Kehilangan pendengaran:Pekak:0,2,3:", "bunyi berdesing di telinga:Tinnitus:0,1,3:", "vertigo:penyakit Meniere:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Penglihatan mendung:Katarak:1,2,3:", "Warna merah jambu atau merah di bahagian putih mata:konjunktivitis:0,2,3:", "sakit mata yang teruk:Glaukoma:0,1,3:", "Persepsi kedalaman yang lemah dan penglihatan periferi:Ambliopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Ketulan baru di payudara atau ketiak:Kanser payudara:1,2,3:", "Darah dalam air kencing:Kanser prostat:2,3,4:", "Perubahan dalam tabiat buang air besar:Kanser kolorektal:1,3,4:", "batuk yang tidak hilang selepas 2 atau 3 minggu:Kanser paru-paru:1,2,4:", "Tahi lalat yang berubah warna, saiz atau yang berdarah:Kanser kulit:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Warna kebiruan pada kulit, kuku dan bibir:Hipoksemia:1,2,3:", "Berkedut di tangan, muka, dan kaki anda:Hipokalsemia:0,2,4:", "Lebih kerap membuang air kecil dan dahaga:Hiperkalsemia:0,1:", "kelemahan tulang:hipofosfatemia:0,4:", "kekejangan atau kekejangan otot:Hiperfosfatemia:0,1:"]);
  }

  void addNL(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.nl;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Lever:1,2,3:29.2,45", "Mond:4,2,9:28.1,81.6", "slokdarm:1,8,5:48.6,58.6", "Dikke darm:4,2,6:20.5,21", "Dunne darm:8,7,1:52.4,19", "Maag:4,6,7:66,41", "Farynx:5,2,9:48.6,81", "galblaas:6,9,4:31.3,39.6", "Alvleesklier:2,1,0:50,35.1", "Wormvormig aanhangsel:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Schedel:11,8,6:48,97", "Schouderblad:5,4,3:61.1,80.2", "Ribben:11,7,0:56,74.1", "Wervelkolom:8,10,1:45.9,65.2", "Scheenbeen:5,9,3:51.4,23.6", "dijbeen:4,10,7:54.9,35.5", "Opperarmbeen:2,7,9:69.1,66.2", "Middenhandsbeen:6,0,1:81.3,44.8", "Handwortelbotten:5,4,2:77.1,48.7", "Voetwortelbeen:4,3,1:49.3,6.9", "Middenvoetsbeentjes:0,3,5:54.2,2.8", "Bekken:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Musculus deltoideus:4,1,5:65.3,80.2", "Biceps:5,0,4:67.3,71.5", "Borstspier:5,0,4:52.5,76.4", "Trapezius:1,5,4:51.4,85.5", "buitenste schuine buikspier:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Hart:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Nieraders:0,4,5:57.3,59.1", "Nierslagader:0,5,4:61.5,59.1", "Jugulaire aderen:0,2,5:60.4,86.1", "Dijader:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Hersenen:5,4,3:50.4,96.8", "Kleine hersenen:5,4,3:56,92.6", "Ruggenmerg:0,4,3:50.7,86.8", "Heupzenuw:0,4,5:59.4,37.6", "Tibiale zenuw:1,5,3:61.1,19.4", "Zenuwknoop:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Lip:1,2,4:61.4,96.6", "Huig:6,2,0:48.6,51.8", "Kies:0,6,1:76.1,33", "Snijtand:0,4,1:50.4,83", "Tong:7,2,0:48.2,27.6", "Keelamandel:4,0,6:69.5,46.8", "Harde gehemelte:1,2,0:48.6,73.8", "Zacht gehemelte:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Frontale kwab:1,2,4:25,58.5", "Temporale kwab:0,2,3:51.2,42.2", "Pariëtale kwab:0,1,3:66,69", "Occipitale kwab:0,1,2:91,46", "Kleine hersenen:1,2,0:72.8,26.1", "Hersenstam:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Oorschelp:1,2,4:8,31", "Gehoorgang:0,2,6:33.5,42.1", "Oortrommel:1,5,6:55.6,42", "gehoorbeentjes:1,0,6:54.3,52.9", "slakkenhuis:6,1,5:75.8,45.7", "Auditieve zenuw:6,2,1:91.8,48", "Eustachius-buis:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Vena cava superior:6,7,4:27.3,92", "Vena cava inferior:1,4,3:27.8,6.8", "Rechter atrium:4,7,0:31,54.4", "Linker atrium:7,6,0:59.6,55.5", "Mitralisklep:8,2,0:69.5,43.7", "Rechter ventrikel:0,1,3:47.8,38.9", "Linker ventrikel:1,8,3:58.1,43", "Tricuspidalisklep:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "hoornvlies:2,6,4:1.7,50.5", "Linse:1,4,6:19,51.3", "netvlies:1,6,4:64.6,76.8", "Oogzenuw:0,6,3:87.9,36.2", "voorste oogkamer:6,4,3:7.2,51.4", "Glasachtig lichaam:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Celkern:5,3,2:57.3,75.5", "Nucleolus:2,6,4:44.5,67.9,8", "Cytoplasma:1,4,6:93.08,50.09,9", "Celmembraan:2,5,1:90,24,14", "Ribosoom:2,1,3:80.929,75.844,14", "Mitochondrion:1,2,3:51.4,90.35,18", "Endoplasmatisch reticulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Zuurstof:1,2,4:74.5,29,25", "Koolstof:2,0,4:74.5,57,25", "Waterstof:1,0,5:74.5,73.2,25", "Stikstof:1,0,2:74.5,83.5,25", "Calcium:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Welk orgaan produceert gal die nodig is voor de spijsvertering?:0,7,6,8", "Wat is het eerste deel van het spijsverteringskanaal dat voedsel ontvangt en speeksel produceert?:1,2,6,5", "Door welk orgaan gaat voedsel van de keelholte naar de maag?:2,6,9,7", "Welk orgaan is het laatste deel van het spijsverteringsstelsel?:3,4,7,8", "Waar vindt de meeste opname van voedingsstoffen en mineralen uit voedsel plaats?:4,5,3,0", "Welk orgaan scheidt spijsverteringsenzymen en maagzuur af om te helpen bij de vertering van voedsel?:5,4,7,3", "Hoe heet het deel van de keel achter de mond en de neusholte?:6,2,9,8", "Waar wordt gal opgeslagen en geconcentreerd voordat het in de dunne darm wordt afgegeven?:7,6,9,8", "Waar wordt insuline uitgescheiden?:8,0,7,6", "Welk orgaan bevindt zich in de rechter onderbuik?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Wat is een botstructuur die het hoofd vormt?:0,1,9,7", "Wat wordt ook wel het schouderbeen genoemd?:1,9,11,6", "Wat is een halfstijve benige en kraakbeenachtige structuur die de borstholte omringt?:2,7,8,11", "Wat is het bepalende kenmerk van een gewerveld dier?:3,0,11,2", "Wat is de grootste van de twee botten in het been onder de knie?:4,6,9,5", "Wat is het langste en sterkste bot in je lichaam?:5,6,9,1", "Wat is een lang bot in de arm dat van de schouder naar de elleboog loopt?:6,5,1,7", "Wat is een groep van vijf botten van de hand tussen de vingerkootjes en de pols?:7,5,1,3", "Uit welke botten bestaat de pols?:8,7,9,10", "Wat is een cluster van zeven scharnierende botten in elke voet?:9,7,8,1", "Wat is een groep van vijf lange botten in de voet?:10,8,7,4", "Wat is het onderste deel van de romp?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Wat is de spier die de ronde contour van de menselijke schouder vormt?:0,1,3,5", "Wat is een grote spier die aan de voorkant van de bovenarm tussen de schouder en de elleboog ligt?:1,0,2,3", "Welke spier bevindt zich op de borst van het menselijk lichaam?:2,3,5,1", "Wat is een driehoekige spier aan de achterkant van de nek?:3,1,2,5", "Welke spier is de grootste van de laterale buikspieren?:4,1,2,0", "Wat is de grootste van de 4 spieren in het voorste compartiment van het been?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Wat is een spierorgaan dat bloed door de bloedvaten van de bloedsomloop pompt?:0,1,3,5", "Wat is de belangrijkste en grootste slagader in het menselijk lichaam?:1,4,3,2", "Wat zijn aderen die de nier afvoeren?:2,5,4,1", "Wat zijn gepaarde slagaders die de nieren van bloed voorzien?:3,2,1,5", "Wat zijn aderen die zuurstofarm bloed van het hoofd terug naar het hart voeren?:4,2,5,1", "Wat is een grote ader die zich diep in de dij bevindt?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Wat is een orgaan dat dient als het centrum van het zenuwstelsel?:0,1,2,5", "Wat is een belangrijk kenmerk van de achterhersenen van alle gewervelde dieren?:1,5,0,2", "Wat is een lange, dunne buisvormige structuur die bestaat uit zenuwweefsel?:2,1,3,4", "Wat is een grote zenuw die langs het heupgewricht loopt?:3,2,1,5", "Wat is een tak van de heupzenuw?:4,5,2,1", "Wat is een groep neuroncellichamen in het perifere zenuwstelsel?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Wat zijn spierplooien die de mond omsluiten?:0,1,4,7", "Wat is een vlezige verlenging die boven de keel hangt?:1,4,0,7", "Wat zijn platte tanden aan de achterkant van de mond?:2,3,5,6", "Wat zijn de voortanden?:3,2,5,6", "Wat is een spierorgaan in de mond?:4,5,6,1", "Welke organen spelen een belangrijke rol in het immuunsysteem?:5,1,4,0", "Wat is een dunne horizontale benige plaat die bestaat uit twee botten van het aangezichtsskelet?:6,7,2,5", "Wat is het zachte weefsel dat de achterkant van het gehemelte vormt?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Wat is de grootste van de vier grote hersenkwabben?:0,3,1,4", "Wat zit achter de oren en is de op één na grootste kwab?:1,0,3,2", "Wat is betrokken bij de perceptie van sensatie, inclusief aanraking, temperatuur, pijn?:2,0,3,5", "Wat is het visuele verwerkingscentrum van de hersenen?:3,0,1,4", "Wat speelt een belangrijke rol bij balanscontrole?:4,5,0,1", "Wat helpt om de hartslag en ademhaling te beheersen?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Wat is het zichtbare deel van het oor dat zich buiten het hoofd bevindt?:0,3,6,2", "Welke weg loopt van het uitwendige oor naar het middenoor?:1,2,3,0", "Wat is een dunne huidflap die strak gespannen is als een trommel en trilt als er geluid op komt?:2,0,5,3", "Welke drie botten in het middenoor behoren tot de kleinste botten in het menselijk lichaam?:3,0,6,2", "Wat lijkt op het schild van een slak?:4,2,0,6", "Wat brengt auditieve sensorische informatie van het slakkenhuis van het binnenoor rechtstreeks naar de hersenen?:5,2,0,6", "Wat wordt ook wel de gehoorbuis genoemd?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Wat is de belangrijkste en grootste slagader in het menselijk lichaam?:0,3,8,6", "Welke ader voert bloed van je hoofd, nek, armen en borst terug naar je hart?:1,3,0,2", "Welke ader voert bloed van je onderlichaam terug naar je hart?:2,1,0,3", "Wat is de bovenste kamer waardoor bloed de ventrikels van het hart binnenkomt?:3,5,6,2", "welke hartkamer ontvangt zuurstofrijk bloed uit de longen?:4,3,6,8", "Welke klep scheidt de twee kamers van de linkerkant van het hart?:5,8,7,3", "Wat is een spierkamer die bloed uit het hart en in de bloedsomloop pompt?:6,5,8,2", "Welke is een van de vier kamers van het hart?:7,0,1,2", "Zijn rol is om te voorkomen dat het bloed terugstroomt van de rechterkamer naar de rechterboezem.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Wat is een dunne structuur in het oog, die verantwoordelijk is voor het regelen van de diameter en grootte van de pupil?:0,1,3,2", "Wat is het transparante voorste deel van het oog dat de iris bedekt?:1,2,3,0", "Wat is een transparante structuur in het oog die helpt om licht te breken om op het netvlies te worden gefocust?:2,3,0,1", "Wat is de binnenste, lichtgevoelige weefsellaag van het oog?:3,1,0,2", "Wat stuurt visuele informatie van het netvlies naar de hersenen?:4,6,5,3", "Wat is het voorste deel van het oog tussen het hoornvlies en de iris?:5,6,2,3", "Welke oogkamer bevindt zich achter de lens en voor de oogzenuw?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Wat bevindt zich in het midden van de cel en bevat het DNA dat in chromosomen is gerangschikt?:0,1,2,3", "Welk gebied in de cel houdt zich bezig met het produceren van de celribosomen?:1,2,3,4", "Wat is een gelatineuze vloeistof die de binnenkant van een cel vult?:2,3,4,5", "Wat beschermt de cel tegen zijn externe omgeving?:3,4,2,1", "Wat is een celstructuur die eiwit produceert?:4,3,2,1", "Wat zet chemische energie om in een energievorm die de cel kan gebruiken?:5,4,3,2", "Wat is het transportsysteem van de eukaryote cel?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Wat wordt gebruikt om ons voedsel te oxideren, in het proces van cellulaire ademhaling, waardoor energie vrijkomt?:0,1,2,3", "Wat is het op één na meest voorkomende element in het menselijk lichaam?:1,2,3,4", "Wat wordt gebruikt om het menselijk lichaam gehydrateerd te houden?:2,3,4,5", "Wat wordt gebruikt om aminozuren in ons lichaam te maken die op hun beurt eiwitten maken?:3,5,4", "Wat wordt gebruikt om sterke botten op te bouwen en te behouden?:4,0,1,2", "Wat wordt gebruikt bij de vorming van botten en tanden?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Wat is een ziekte waarbij uw lever ontstoken raakt?:Hepatitis::", "Wat is een ziekte waarbij een parasiet het maagdarmkanaal van de mens infecteert?:Darm parasieten::", "Wat is een ziekte waarbij uw alvleesklier ontstoken raakt?:Pancreatitis::", "Wat is een ziekte die een breuk in de binnenwand van de maag veroorzaakt?:Maagzweer::", "Wat is een ziekte waarbij uw appendix ontstoken raakt?:Appendicitis::", "Wat is een ziekte waarbij uw binnenwand van de maag ontstoken raakt?:Gastritis::", "Welke ziekte veroorzaakt gezwollen aderen in uw onderste rectum?:Aambeien::", "Wat zijn harde afzettingen van mineralen en zouten?:Nierstenen::", "Wat is littekenvorming van de lever veroorzaakt door langdurige leverbeschadiging?:Cirrose::", "Wat is een type inflammatoire darmziekte?:ziekte van Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Welke ziekte veroorzaakt pijn en ontsteking in een gewricht?:Artritis::", "Wat is een breuk in de continuïteit van een bot?:Bot fractuur::", "Welke ziekte verzwakt botten, waardoor ze kwetsbaarder worden en sneller breken?:osteoporose::", "Welke ziekte veroorzaakt een zijwaartse kromming van de wervelkolom?:Scoliose::", "Wat is een type artritis dat plotselinge, ernstige gewrichtspijn veroorzaakt?:Jicht::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Welke ziekte veroorzaakt progressieve zwakte en verlies van spiermassa?:spierdystrofie::", "Welke ziekte wordt veroorzaakt door een gebrek aan lichamelijke activiteit?:spieratrofie::", "Welke ziekte veroorzaakt de ontsteking of irritatie van een pees?:tendinitis::", "Wat is een plotselinge en onwillekeurige samentrekking van een van uw spieren?:spierkrampen::", "Wat gebeurt er als uw spier overbelast of gescheurd is?:spierruptuur::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Wat is een type kanker dat begint in cellen die deel uitmaken van het immuunsysteem van het lichaam?:lymfoom::", "Wat is een type kanker dat meestal in het beenmerg begint?:Leukemie::", "Wat wordt veroorzaakt door langdurige blootstelling aan zeer koude temperaturen?:Hypothermie::", "Wat is een verharding van uw slagaders veroorzaakt door geleidelijke opbouw van tandplak?:atherosclerose::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Wat is een acute ontsteking van de beschermende vliezen die de hersenen en het ruggenmerg bedekken?:meningitis::", "Wat is een ziekte die uw hersenen en ruggenmerg kan aantasten en problemen kan veroorzaken met zicht, evenwicht en spiercontrole?:Multiple sclerose::", "Wat is een hersenaandoening die leidt tot beven, stijfheid en moeite met lopen, evenwicht en coördinatie?:ziekte van Parkinson::", "Wat wordt gekenmerkt door meervoudige bewegingstics en minstens één vocale tic?:Tourette syndroom::", "Wat is een ongeneeslijke, erfelijke hersenaandoening die hersencellen beschadigt?:de ziekte van Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Wat is een ernstige tandvleesontsteking die het zachte weefsel beschadigt en het bot dat uw tanden ondersteunt kan vernietigen?:Parodontitis::", "Wat is een milde vorm van tandvleesontsteking die irritatie, roodheid en zwelling van uw tandvlees veroorzaakt?:gingivitis::", "Wat zijn blijvend beschadigde plekken op het harde oppervlak van je tanden?:Tandbederf::", "Wat is een infectie van de amandelen achter in je keel?:Tonsillitis::", "Wat gebeurt er als het weefsel waaruit de lip bestaat niet volledig samenkomt voor de geboorte?:Hazenlip::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Welke hersenstoornis vernietigt geheugen en denkvaardigheden en uiteindelijk het vermogen om de eenvoudigste taken uit te voeren?:ziekte van Alzheimer::", "Wat is een ongewone maar ernstige aandoening waarbij de hersenen ontstoken raken?:Encefalitis::", "Wat is een hoofdpijnstoornis die wordt gekenmerkt door terugkerende hoofdpijn die matig tot ernstig is?:Migraine::", "Wat is een ziekte die de hersenen aantast en frequente aanvallen veroorzaakt?:Epilepsie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Wat gebeurt er als een virus of bacterie ervoor zorgt dat het gebied achter het trommelvlies ontstoken raakt?:Otitis::", "Wat verwijst naar het totale of gedeeltelijke onvermogen om geluiden te horen?:Doofheid::", "Wat is een toestand waarin je geluiden hoort als er geen externe bron van de geluiden is?:Tinnitus::", "Wat is een aandoening van het binnenoor die kan leiden tot duizeligheid (vertigo) en gehoorverlies?:de ziekte van Menière::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Wat is pijn op de borst die wordt veroorzaakt door een verminderde bloedtoevoer naar de hartspier?:Angina::", "Wat is een bloeddruk die hoger is dan normaal?:hypertensie::", "Wat gebeurt er als de bloedstroom naar de kransslagader van het hart afneemt of stopt?:Myocardinfarct::", "Wat is een ernstige aandoening waarbij het hart het bloed niet zo efficiënt rondpompt als zou moeten?:Congestief hartfalen::", "Wat is een woord voor een hoog cholesterolgehalte in het bloed?:Hypercholesterolemie::", "Wat is een afwijking van het hartritme?:aritmie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Wat is een troebel gebied in de ooglens dat leidt tot een verminderd gezichtsvermogen?:staar::", "Wat is een oogaandoening die wordt veroorzaakt door een infectie of allergieën?:Bindvliesontsteking::", "Wat is een oogaandoening waarbij de oogzenuw, die het oog met de hersenen verbindt, beschadigd raakt?:glaucoom::", "Wat is een gezichtsstoornis waarbij de hersenen de input van het ene oog niet volledig verwerken en na verloop van tijd het andere oog bevoordeelt?:Amblyopie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Wat is een type kanker dat een knobbel in de borst of een verandering in de vorm van de borst kan omvatten?:Borstkanker::", "Wat is de meest voorkomende vorm van kanker die alleen mannen treft?:Prostaatkanker::", "Wat is een type kanker waarbij cellen in de dikke darm of het rectum ongecontroleerd groeien?:Colorectale kanker::", "Welk type kanker wordt veroorzaakt door langdurig roken?:longkanker::", "Welk type kanker wordt veroorzaakt door overmatige blootstelling aan ultraviolette stralen van de zon?:Huidkanker::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Hoe wordt een zuurstofgehalte in uw bloed onder het normale niveau genoemd, met name in de slagaders?:Hypoxemie::", "Hoe wordt een lager calciumgehalte in uw bloed genoemd?:Hypocalciëmie::", "Hoe wordt een bovennormaal calciumgehalte in uw bloed genoemd?:Hypercalciëmie::", "Hoe wordt een lager dan normaal fosfaatgehalte in uw bloed genoemd?:hypofosfatemie::", "Hoe wordt een boven normaal fosfaatgehalte in uw bloed genoemd?:hyperfosfatemie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Geelverkleuring van de huid en het wit van uw ogen:Hepatitis:3,4,5:", "Huiduitslag of jeuk rond het rectum:Darm parasieten:2,7,8:", "Matige tot ernstige buikpijn die kan uitstralen naar uw rug:Pancreatitis:1,3,4:", "Ernstige maagpijn:Maagzweer:6,7,8:", "Plotselinge pijn die begint aan de rechterkant van de onderbuik:Appendicitis:0,3,7:", "Misselijkheid of terugkerende maagklachten:Gastritis:4,2,1:", "Extreme jeuk rond de anus:Aambeien:0,2,3:", "Pijn of branderig gevoel tijdens het plassen:Nierstenen:3,9,1:", "Geelverkleuring van de huid en het wit van uw ogen:Cirrose:7,5,4:", "Bloed in de ontlasting:ziekte van Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["gewrichtspijn:Artritis:1,2,3:", "onmiddellijke, hevige pijn:Bot fractuur:2,3:", "Hoogteverlies in de loop van de tijd:osteoporose:1,3,4:", "een zichtbaar gebogen ruggengraat:Scoliose:0,1,2:", "rode, glanzende huid over het aangetaste gewricht:Jicht:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Grote kuitspieren:spierdystrofie:2,3,4:", "Een arm of een been is kleiner dan de andere:spieratrofie:2,3,4:", "pijn in een pees die erger wordt als je beweegt:tendinitis:1,3,4:", "Een plotselinge, scherpe pijn:spierkrampen:1,2:", "plotselinge pijn die verergert tijdens het samentrekken van de spier:spierruptuur:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Pijnloze zwelling van lymfeklieren in uw nek, oksels of lies:lymfoom:2,3:", "Gezwollen lymfeklieren, vergrote lever of milt:Leukemie:2,3:", "rillen:Hypothermie:0,1:", "Gevoelloosheid of zwakte in uw armen of benen:atherosclerose:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Plotselinge hoge koorts, ernstige hoofdpijn die anders lijkt dan normaal:meningitis:1,2,3:", "blindheid aan één oog:Multiple sclerose:0,3,4:", "Tremor in handen:ziekte van Parkinson:0,3,4:", "beweging tics:Tourette syndroom:0,1,4:", "moeite met concentreren en geheugenverlies:de ziekte van Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Rood of gezwollen tandvlees:Parodontitis:2,3,4:", "Rood of gezwollen tandvlees:gingivitis:2,3,4:", "Kiespijn:Tandbederf:0,4,3:", "problemen met slikken:Tonsillitis:0,2,4:", "Misvormingen van de bovenkaak:Hazenlip:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["vloeistof die uit het oor loopt:Otitis:1,2,3:", "Gehoorverlies:Doofheid:0,2,3:", "een rinkelend geluid in de oren:Tinnitus:0,1,3:", "hoogtevrees:de ziekte van Menière:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Vertroebeld zicht:staar:1,2,3:", "Roze of rode kleur in het wit van het oog:Bindvliesontsteking:0,2,3:", "intense oogpijn:glaucoom:0,1,3:", "Slechte dieptewaarneming en perifeer zicht:Amblyopie:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Een nieuwe knobbel in de borst of onderarm:Borstkanker:1,2,3:", "Bloed in de urine:Prostaatkanker:2,3,4:", "Een verandering in stoelgang:Colorectale kanker:1,3,4:", "een hoest die niet weggaat na 2 of 3 weken:longkanker:1,2,4:", "Een moedervlek die van kleur, grootte verandert of gaat bloeden:Huidkanker:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Blauwachtige kleur in huid, vingernagels en lippen:Hypoxemie:1,2,3:", "Trillingen in uw handen, gezicht en voeten:Hypocalciëmie:0,2,4:", "Vaker urineren en dorst hebben:Hypercalciëmie:0,1:", "verzwakking van botten:hypofosfatemie:0,4:", "spierkrampen of spasmen:hyperfosfatemie:0,1:"]);
  }

  void addNB(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.nb;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Lever:1,2,3:29.2,45", "Munn:4,2,9:28.1,81.6", "Spiserøret:1,8,5:48.6,58.6", "Tykktarmen:4,2,6:20.5,21", "Tynntarm:8,7,1:52.4,19", "Mage:4,6,7:66,41", "Svelg:5,2,9:48.6,81", "Galleblæren:6,9,4:31.3,39.6", "Bukspyttkjertel:2,1,0:50,35.1", "appendektomi:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Skalle:11,8,6:48,97", "skapula:5,4,3:61.1,80.2", "Ribbein:11,7,0:56,74.1", "Ryggsøyle:8,10,1:45.9,65.2", "Tibia:5,9,3:51.4,23.6", "Lårben:4,10,7:54.9,35.5", "Humerus:2,7,9:69.1,66.2", "Metacarpal bein:6,0,1:81.3,44.8", "Karpale bein:5,4,2:77.1,48.7", "tarsal bein:4,3,1:49.3,6.9", "Metatarsalben:0,3,5:54.2,2.8", "Bekken:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["deltoid muskel:4,1,5:65.3,80.2", "Biceps:5,0,4:67.3,71.5", "Brystmuskulaturen:5,0,4:52.5,76.4", "Trapezius:1,5,4:51.4,85.5", "Den ytre skrå bukmuskel:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Hjerte:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Nyre årer:0,4,5:57.3,59.1", "Nyre arterie:0,5,4:61.5,59.1", "Vena jugularis:0,2,5:60.4,86.1", "Femoral vene:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Hjerne:5,4,3:50.4,96.8", "Lillehjernen:5,4,3:56,92.6", "Ryggmargen:0,4,3:50.7,86.8", "Isjiasnerven:0,4,5:59.4,37.6", "Tibial nerve:1,5,3:61.1,19.4", "Ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Lepper:1,2,4:61.4,96.6", "Drøvel:6,2,0:48.6,51.8", "molarer:0,6,1:76.1,33", "fortann:0,4,1:50.4,83", "Tunge:7,2,0:48.2,27.6", "Mandel:4,0,6:69.5,46.8", "Hard gane:1,2,0:48.6,73.8", "Myk gane:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Pannelapp:1,2,4:25,58.5", "Temporallapp:0,2,3:51.2,42.2", "Parietallapp:0,1,3:66,69", "Occipitallapp lob:0,1,2:91,46", "lillehjernen:1,2,0:72.8,26.1", "hjernestammen:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Øremusling:1,2,4:8,31", "Øregang:0,2,6:33.5,42.1", "Ørtrommel:1,5,6:55.6,42", "ossicles:1,0,6:54.3,52.9", "Sneglehuset:6,1,5:75.8,45.7", "Auditive nerv:6,2,1:91.8,48", "Øretrompeten:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Overlegen vena cava:6,7,4:27.3,92", "Mindre vena cava:1,4,3:27.8,6.8", "Høyre atrium:4,7,0:31,54.4", "Venstre atrium:7,6,0:59.6,55.5", "Mitralventil:8,2,0:69.5,43.7", "Høyre ventrikkel:0,1,3:47.8,38.9", "Venstre ventrikkel:1,8,3:58.1,43", "Tricuspid ventil:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["regnbuehinne:6,3,4:11.3,57", "hornhinnen:2,6,4:1.7,50.5", "linse:1,4,6:19,51.3", "Netthinnen:1,6,4:64.6,76.8", "Optisk nerve:0,6,3:87.9,36.2", "Fremre øyekammer:6,4,3:7.2,51.4", "Glasslegeme:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Cellekjerne:5,3,2:57.3,75.5", "Kjernelegeme:2,6,4:44.5,67.9,8", "Cytoplasma:1,4,6:93.08,50.09,9", "Cellemembran:2,5,1:90,24,14", "Ribosom:2,1,3:80.929,75.844,14", "Mitokondrion:1,2,3:51.4,90.35,18", "Endoplasmatisk retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oksygen:1,2,4:74.5,29,25", "Karbon:2,0,4:74.5,57,25", "Hydrogen:1,0,5:74.5,73.2,25", "Nitrogen:1,0,2:74.5,83.5,25", "Kalsium:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Hvilket organ produserer galle som er nødvendig for fordøyelsen?:0,7,6,8", "Hva er den første delen av fordøyelseskanalen som mottar mat og produserer spytt?:1,2,6,5", "Gjennom hvilken organmat går fra svelget til magen?:2,6,9,7", "Hvilket organ er den siste delen av fordøyelsessystemet?:3,4,7,8", "Hvor er det mest opptak av næringsstoffer og mineraler fra maten?:4,5,3,0", "Hvilket organ skiller ut fordøyelsesenzymer og magesyre for å hjelpe fordøyelsen av maten?:5,4,7,3", "Hva heter delen av halsen bak munnen og nesehulen?:6,2,9,8", "Hvor lagres og konsentreres galle før den slippes ut i tynntarmen?:7,6,9,8", "Hvor skilles insulin ut fra?:8,0,7,6", "Hvilket organ er plassert i nedre høyre del av magen?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Hva er en beinstruktur som danner hodet?:0,1,9,7", "Hva er også kjent som skulderbeinet?:1,9,11,6", "Hva er en halvstiv bein- og bruskstruktur som omgir brysthulen?:2,7,8,11", "Hva er den definerende egenskapen til et virveldyr?:3,0,11,2", "Hva er det største av de to beinene i benet under kneet?:4,6,9,5", "Hva er det lengste og sterkeste beinet i kroppen din?:5,6,9,1", "Hva er et langt bein i armen som går fra skulderen til albuen?:6,5,1,7", "Hva er en gruppe på fem håndbein mellom phalanges og håndledd?:7,5,1,3", "Hvilke bein utgjør håndleddet?:8,7,9,10", "Hva er en klynge av syv artikulerende bein i hver fot?:9,7,8,1", "Hva er en gruppe på fem lange bein i foten?:10,8,7,4", "Hva er den nedre delen av torsoen?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Hva er muskelen som danner den avrundede konturen til den menneskelige skulderen?:0,1,3,5", "Hva er en stor muskel som ligger foran på overarmen mellom skulder og albue?:1,0,2,3", "Hvilken muskel sitter på brystet av menneskekroppen?:2,3,5,1", "Hva er en trekantet muskel plassert på baksiden av nakken?:3,1,2,5", "Hvilken muskel er den største av de laterale magemusklene?:4,1,2,0", "Hva er den største av 4 muskler i fremre del av benet?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Hva er et muskelorgan som pumper blod gjennom blodårene i sirkulasjonssystemet?:0,1,3,5", "Hva er hoved- og største arterien i menneskekroppen?:1,4,3,2", "Hva er årer som drenerer nyrene?:2,5,4,1", "Hva er sammenkoblede arterier som forsyner nyrene med blod?:3,2,1,5", "Hva er årer som tar oksygenert blod fra hodet tilbake til hjertet?:4,2,5,1", "Hva er en stor vene som ligger dypt inne i låret?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Hva er et organ som fungerer som sentrum av nervesystemet?:0,1,2,5", "Hva er et hovedtrekk ved bakhjernen til alle virveldyr?:1,5,0,2", "Hva er en lang, tynn, rørformet struktur som består av nervevev?:2,1,3,4", "Hva er en stor nerve som går langs hofteleddet?:3,2,1,5", "Hva er en gren av isjiasnerven?:4,5,2,1", "Hva er en gruppe nevroncellelegemer i det perifere nervesystemet?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Hva er muskelfolder som omkranser munnen?:0,1,4,7", "Hva er en kjøttfull forlengelse som henger over halsen?:1,4,0,7", "Hva er flate tenner på baksiden av munnen?:2,3,5,6", "Hva er fortennene?:3,2,5,6", "Hva er et muskelorgan i munnen?:4,5,6,1", "Hvilke organer spiller en viktig rolle i immunsystemet?:5,1,4,0", "Hva er en tynn horisontal beinplate som består av to bein i ansiktsskjelettet?:6,7,2,5", "Hva er bløtvevet som utgjør baksiden av munntaket?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Hva er den største av de fire hovedlappene i hjernen?:0,3,1,4", "Hva sitter bak ørene og er den nest største lappen?:1,0,3,2", "Hva er involvert i oppfatningen av følelse, inkludert berøring, temperatur, smerte?:2,0,3,5", "Hva er det visuelle prosesseringssenteret i hjernen?:3,0,1,4", "Hva spiller en viktig rolle i balansekontroll?:4,5,0,1", "Hva hjelper til med å kontrollere hjertefrekvens og pustefrekvens?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Hva er den synlige delen av øret som er utenfor hodet?:0,3,6,2", "Hva er en vei som går fra det ytre øret til mellomøret?:1,2,3,0", "Hva er en tynn hudflik som strekkes stramt som en tromme og vibrerer når lyden treffer den?:2,0,5,3", "Hva er tre bein i mellomøret som er blant de minste beinene i menneskekroppen?:3,0,6,2", "Hva ligner på skallet til en snegle?:4,2,0,6", "Hva bærer auditiv sensorisk informasjon fra sneglen i det indre øret direkte til hjernen?:5,2,0,6", "Hva er også kjent som hørselsrøret?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Hva er hoved- og største arterien i menneskekroppen?:0,3,8,6", "Hvilken blodåre fører blod fra hodet, nakken, armene og brystet tilbake til hjertet?:1,3,0,2", "Hvilken blodåre fører blod fra underkroppen tilbake til hjertet?:2,1,0,3", "Hva er det øvre kammeret der blod kommer inn i hjertets ventrikler?:3,5,6,2", "hvilket hjertekammer mottar oksygenrikt blod fra lungene?:4,3,6,8", "Hvilken ventil skiller de to kamrene på venstre side av hjertet?:5,8,7,3", "Hva er muskelkammer som pumper blod ut av hjertet og inn i sirkulasjonssystemet?:6,5,8,2", "Hvilket er ett av fire hjertekamre?:7,0,1,2", "Dens rolle er å forhindre tilbakestrømning av blod fra høyre ventrikkel til høyre atrium.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Hva er en tynn struktur i øyet, ansvarlig for å kontrollere diameteren og størrelsen på pupillen?:0,1,3,2", "Hva er den gjennomsiktige fremre delen av øyet som dekker iris?:1,2,3,0", "Hva er en gjennomsiktig struktur i øyet som hjelper til med å bryte lys for å bli fokusert på netthinnen?:2,3,0,1", "Hva er det innerste, lysfølsomme laget av vev i øyet?:3,1,0,2", "Hva overfører visuell informasjon fra netthinnen til hjernen?:4,6,5,3", "Hva er den fremre delen av øyet mellom hornhinnen og iris?:5,6,2,3", "Hvilket øyekammer er plassert bak linsen og foran synsnerven?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Hva finnes i midten av cellen og den inneholder DNA ordnet i kromosomer?:0,1,2,3", "Hvilken region i cellen er opptatt av å produsere celleribosomer?:1,2,3,4", "Hva er en gelatinøs væske som fyller innsiden av en celle?:2,3,4,5", "Hva beskytter cellen mot ytre miljø?:3,4,2,1", "Hva er en cellestruktur som produserer protein?:4,3,2,1", "Hva konverterer kjemisk energi til en energiform som cellen kan bruke?:5,4,3,2", "Hva er transportsystemet til den eukaryote cellen?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Hva brukes til å oksidere maten vår, i prosessen med cellulær respirasjon, og dermed frigjøre energi?:0,1,2,3", "Hva er det nest mest tallrike elementet i menneskekroppen?:1,2,3,4", "Hva brukes for å holde menneskekroppen hydrert?:2,3,4,5", "Hva brukes til å lage aminosyrer i kroppen vår som igjen lager proteiner?:3,5,4", "Hva brukes til å bygge og vedlikeholde sterke bein?:4,0,1,2", "Hva brukes i dannelsen av bein og tenner?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Hva er en sykdom der leveren din blir betent?:Hepatitt::", "Hva er en sykdom der en parasitt infiserer mage-tarmkanalen til mennesker?:Tarmparasitter::", "Hva er en sykdom der bukspyttkjertelen din blir betent?:Pankreatitt::", "Hva er en sykdom som forårsaker brudd i den indre slimhinnen i magen?:Magesår::", "Hva er en sykdom der blindtarmen din blir betent?:Blindtarmbetennelse::", "Hva er en sykdom der den indre slimhinnen i magen blir betent?:Gastritt::", "Hvilken sykdom forårsaker hovne årer i nedre endetarm?:Hemorroider::", "Hva er harde forekomster laget av mineraler og salter?:Nyrestein::", "Hva er arrdannelse i leveren forårsaket av langvarig leverskade?:Skrumplever::", "Hva er en type inflammatorisk tarmsykdom?:Crohns sykdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Hvilken sykdom forårsaker smerte og betennelse i et ledd?:Leddgikt::", "Hva er et brudd i kontinuiteten til et bein?:Benbrudd::", "Hvilken sykdom svekker bein, noe som gjør dem skjøre og mer sannsynlig å knekke?:Osteoporose::", "Hvilken sykdom forårsaker en sideveis krumning av ryggraden?:Skoliose::", "Hva er en type leddgikt som forårsaker plutselige, alvorlige leddsmerter?:Gikt::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Hvilken sykdom forårsaker progressiv svakhet og tap av muskelmasse?:muskeldystrofi::", "Hvilken sykdom forårsakes av mangel på fysisk aktivitet?:muskelatrofi::", "Hvilken sykdom forårsaker betennelse eller irritasjon av en sene?:senebetennelse::", "Hva er en plutselig og ufrivillig sammentrekning av en av musklene dine?:muskelkramper::", "Hva skjer når muskelen din er overstrukket eller revet?:muskelbrudd::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Hva er en type kreft som starter i celler som er en del av kroppens immunsystem?:Lymfom::", "Hva er en type kreft som vanligvis begynner i benmargen?:Leukemi::", "Hva er forårsaket av langvarig eksponering for svært kalde temperaturer?:Hypotermi::", "Hva er en herding av arteriene dine forårsaket av gradvis plakkoppbygging?:Aterosklerose::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Hva er en akutt betennelse i de beskyttende membranene som dekker hjernen og ryggmargen?:Meningitt::", "Hva er en sykdom som kan påvirke hjernen og ryggmargen din, og som kan gi problemer med syn, balanse, muskelkontroll?:Multippel sklerose::", "Hva er en hjernesykdom som fører til skjelvinger, stivhet og vanskeligheter med å gå, balanse og koordinasjon?:Parkinsons sykdom::", "Hva kjennetegnes av tics med flere bevegelser og minst en vokal tics?:Tourettes syndrom::", "Hva er en uhelbredelig, arvelig hjernesykdom som skader hjerneceller?:Huntingtons sykdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Hva er en alvorlig tannkjøttinfeksjon som skader bløtvevet og som kan ødelegge beinet som støtter tennene dine?:Periodontitt::", "Hva er en mild form for tannkjøttsykdom som forårsaker irritasjon, rødhet og hevelse i tannkjøttet?:gingivitt::", "Hva er permanent skadede områder i den harde overflaten av tennene dine?:Tannråte::", "Hva er en infeksjon i mandlene bak i halsen?:Tonsillitt::", "Hva skjer hvis vevet som utgjør leppen ikke går helt sammen før fødselen?:Leppespalte::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Hvilken hjerneforstyrrelse ødelegger hukommelsen og tenkeevnen og til slutt evnen til å utføre de enkleste oppgavene?:Alzheimers sykdom::", "Hva er en uvanlig, men alvorlig tilstand der hjernen blir betent?:Encefalitt::", "Hva er en hodepinelidelse preget av tilbakevendende hodepine som er moderat til alvorlig?:Migrene::", "Hva er en sykdom som påvirker hjernen og forårsaker hyppige anfall?:Epilepsi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Hva skjer når et virus eller en bakterie får området bak trommehinnen til å bli betent?:Ørebetennelse::", "Hva refererer til total eller delvis manglende evne til å høre lyder?:Døvhet::", "Hva er en tilstand der du hører lyder når det ikke er noen ekstern kilde til lydene?:Tinnitus::", "Hva er en lidelse i det indre øret som kan føre til svimmelhet (vertigo) og hørselstap?:Menières sykdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Hva er brystsmerter forårsaket av redusert blodtilførsel til hjertemusklene?:Angina::", "Hva er blodtrykket som er høyere enn normalt?:Hypertensjon::", "Hva skjer når blodstrømmen avtar eller stopper til hjertets kranspulsårer?:Hjerteinfarkt::", "Hva er en alvorlig tilstand der hjertet ikke pumper blod så effektivt som det burde?:Kongestiv hjertesvikt::", "Hva er et ord for høye nivåer av kolesterol i blodet?:Hyperkolesterolemi::", "Hva er en avvik i hjertets rytme?:Arytmi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Hva er et uklart område i øyelinsen som fører til nedsatt syn?:Grå stær::", "Hva er en øyesykdom forårsaket av infeksjon eller allergi?:Konjunktivitt::", "Hva er en øyetilstand der synsnerven, som forbinder øyet med hjernen, blir skadet?:Grønn stær::", "Hva er en synsforstyrrelse der hjernen ikke klarer å behandle input fra det ene øyet fullt ut og over tid favoriserer det andre øyet?:Amblyopi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Hva er en type kreft som kan inkludere en kul i brystet eller en endring i brystform?:Brystkreft::", "Hva er den vanligste krefttypen som kun rammer menn?:Prostatakreft::", "Hva er en type kreft der celler i tykktarmen eller endetarmen vokser ut av kontroll?:Tykktarmskreft::", "Hvilken type kreft forårsakes av langvarig tobakksrøyking?:Lungekreft::", "Hvilken type kreft er forårsaket av overeksponering for ultrafiolette stråler fra solen?:Hudkreft::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Hva kalles et undernormalt nivå av oksygen i blodet ditt, spesielt i arteriene?:Hypoksemi::", "Hva kalles et undernormalt nivå av kalsium i blodet ditt?:Hypokalsemi::", "Hva kalles et overnormalt nivå av kalsium i blodet ditt?:Hyperkalsemi::", "Hva kalles et undernormalt nivå av fosfat i blodet ditt?:hypofosfatemi::", "Hva kalles et overnormalt nivå av fosfat i blodet ditt?:Hyperfosfatemi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Gulfarging av huden og det hvite i øynene:Hepatitt:3,4,5:", "Utslett eller kløe rundt endetarmen:Tarmparasitter:2,7,8:", "Moderat til alvorlig magesmerter som kan spre seg til ryggen:Pankreatitt:1,3,4:", "Sterke magesmerter:Magesår:6,7,8:", "Plutselig smerte som begynner på høyre side av nedre del av magen:Blindtarmbetennelse:0,3,7:", "Kvalme eller tilbakevendende urolig mage:Gastritt:4,2,1:", "Ekstrem kløe rundt anus:Hemorroider:0,2,3:", "Smerte eller brennende følelse ved vannlating:Nyrestein:3,9,1:", "Gulfarging av huden og det hvite i øynene:Skrumplever:7,5,4:", "Blod i avføringen:Crohns sykdom:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["leddsmerter:Leddgikt:1,2,3:", "umiddelbare, sterke smerter:Benbrudd:2,3:", "Tap av høyde over tid:Osteoporose:1,3,4:", "en synlig buet ryggrad:Skoliose:0,1,2:", "rød, skinnende hud over det berørte leddet:Gikt:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Store leggmuskler:muskeldystrofi:2,3,4:", "En arm eller ett ben er mindre enn den andre:muskelatrofi:2,3,4:", "smerter i en sene som blir verre når du beveger deg:senebetennelse:1,3,4:", "En plutselig, skarp smerte:muskelkramper:1,2:", "plutselige smerter som forverres mens muskelen trekkes sammen:muskelbrudd:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Smertefri hevelse av lymfeknuter i nakken, armhulene eller lysken:Lymfom:2,3:", "Hovne lymfeknuter, forstørret lever eller milt:Leukemi:2,3:", "Skjelver:Hypotermi:0,1:", "Nummenhet eller svakhet i armer eller ben:Aterosklerose:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Plutselig høy feber, sterk hodepine som virker annerledes enn normalt:Meningitt:1,2,3:", "blindhet i det ene øyet:Multippel sklerose:0,3,4:", "Tremor i hendene:Parkinsons sykdom:0,3,4:", "bevegelses-tics:Tourettes syndrom:0,1,4:", "konsentrasjonsvansker og hukommelsessvikt:Huntingtons sykdom:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Rødt eller hovent tannkjøtt:Periodontitt:2,3,4:", "Rødt eller hovent tannkjøtt:gingivitt:2,3,4:", "Tannverk:Tannråte:0,4,3:", "problemer med å svelge:Tonsillitt:0,2,4:", "Deformiteter i overkjeven:Leppespalte:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["væske som renner fra øret:Ørebetennelse:1,2,3:", "Tap av hørsel:Døvhet:0,2,3:", "en ringelyd i ørene:Tinnitus:0,1,3:", "svimmelhet:Menières sykdom:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Skyet syn:Grå stær:1,2,3:", "Rosa eller rød farge i det hvite i øyet:Konjunktivitt:0,2,3:", "intense øyesmerter:Grønn stær:0,1,3:", "Dårlig dybdesyn og perifert syn:Amblyopi:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["En ny klump i brystet eller armhulen:Brystkreft:1,2,3:", "Blod i urinen:Prostatakreft:2,3,4:", "En endring i avføringsvaner:Tykktarmskreft:1,3,4:", "en hoste som ikke går over etter 2 eller 3 uker:Lungekreft:1,2,4:", "En føflekk som endrer seg i farge, størrelse eller som blør:Hudkreft:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Blåaktig farge i hud, negler og lepper:Hypoksemi:1,2,3:", "Rykninger i hender, ansikt og føtter:Hypokalsemi:0,2,4:", "Hyppigere vannlating og tørste:Hyperkalsemi:0,1:", "svekkelse av bein:hypofosfatemi:0,4:", "muskelkramper eller spasmer:Hyperfosfatemi:0,1:"]);
  }

  void addPL(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.pl;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Wątroba:1,2,3:29.2,45", "Usta:4,2,9:28.1,81.6", "Przełyk:1,8,5:48.6,58.6", "Jelito grube:4,2,6:20.5,21", "Jelito cienkie:8,7,1:52.4,19", "Żołądek:4,6,7:66,41", "Gardło:5,2,9:48.6,81", "Pęcherzyk żółciowy:6,9,4:31.3,39.6", "Trzustka:2,1,0:50,35.1", "Wyrostek robaczkowy:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Czaszka:11,8,6:48,97", "Łopatka:5,4,3:61.1,80.2", "Żebra:11,7,0:56,74.1", "Kręgosłup:8,10,1:45.9,65.2", "Kość piszczelowa:5,9,3:51.4,23.6", "Kość udowa:4,10,7:54.9,35.5", "Kość ramienna:2,7,9:69.1,66.2", "Kości śródręcza:6,0,1:81.3,44.8", "Kości nadgarstka:5,4,2:77.1,48.7", "Stęp:4,3,1:49.3,6.9", "Śródstopie:0,3,5:54.2,2.8", "Miednica:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Mięsień naramienny:4,1,5:65.3,80.2", "Mięsień dwugłowy ramienia:5,0,4:67.3,71.5", "Mięsień piersiowy większy:5,0,4:52.5,76.4", "Mięsień czworoboczny:1,5,4:51.4,85.5", "Mięsień skośny zewnętrzny:1,5,0:54.2,65.9", "Mięsień piszczelowy przedni:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Serce:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Żyły nerkowe:0,4,5:57.3,59.1", "Tętnica nerkowa:0,5,4:61.5,59.1", "Żyła szyjna:0,2,5:60.4,86.1", "Żyła udowa:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Mózg:5,4,3:50.4,96.8", "Móżdżek:5,4,3:56,92.6", "Rdzeń kręgowy:0,4,3:50.7,86.8", "Nerw kulszowy:0,4,5:59.4,37.6", "Nerw piszczelowy:1,5,3:61.1,19.4", "Zwój nerwowy:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Usta:1,2,4:61.4,96.6", "Języczek ssaków:6,2,0:48.6,51.8", "Molowe:0,6,1:76.1,33", "Siekacz:0,4,1:50.4,83", "Język:7,2,0:48.2,27.6", "Migdałki:4,0,6:69.5,46.8", "Podniebienie twarde:1,2,0:48.6,73.8", "Podniebienie miękkie:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Płat czołowy:1,2,4:25,58.5", "Płat skroniowy:0,2,3:51.2,42.2", "Płat ciemieniowy:0,1,3:66,69", "Płat potyliczny:0,1,2:91,46", "Móżdżek:1,2,0:72.8,26.1", "Pień mózgu:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Małżowina uszna:1,2,4:8,31", "Przewód słuchowy:0,2,6:33.5,42.1", "Bęben uszny:1,5,6:55.6,42", "Kosteczki słuchowe:1,0,6:54.3,52.9", "Ślimak:6,1,5:75.8,45.7", "Nerw słuchowy:6,2,1:91.8,48", "Rurka Eustachiusza:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Żyła główna górna:6,7,4:27.3,92", "Dolna żyła główna:1,4,3:27.8,6.8", "Prawe przedsionek:4,7,0:31,54.4", "Lewe przedsionek:7,6,0:59.6,55.5", "Zastawka mitralna:8,2,0:69.5,43.7", "Prawa komora:0,1,3:47.8,38.9", "Lewa komora:1,8,3:58.1,43", "Tricuspid valve:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["tęczówki:6,3,4:11.3,57", "Rogówka:2,6,4:1.7,50.5", "soczewek:1,4,6:19,51.3", "siatkówka:1,6,4:64.6,76.8", "Nerw wzrokowy:0,6,3:87.9,36.2", "Komora przednia:6,4,3:7.2,51.4", "Ciało szkliste:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Jądro komórkowe:5,3,2:57.3,75.5", "Jąderko:2,6,4:44.5,67.9,8", "Cytoplazma:1,4,6:93.08,50.09,9", "Błona komórkowa:2,5,1:90,24,14", "Rybosom:2,1,3:80.929,75.844,14", "Mitochondrium:1,2,3:51.4,90.35,18", "Retikulum endoplazmatyczne:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Tlen:1,2,4:74.5,29,25", "Węgiel:2,0,4:74.5,57,25", "Wodór:1,0,5:74.5,73.2,25", "Azot:1,0,2:74.5,83.5,25", "Wapń:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Jaki narząd wytwarza żółć niezbędną do trawienia?:0,7,6,8", "Jaka jest pierwsza część przewodu pokarmowego, która otrzymuje pokarm i wytwarza ślinę?:1,2,6,5", "Przez który narząd przechodzi z gardła do żołądka?:2,6,9,7", "Jaki narząd jest ostatnią częścią układu pokarmowego?:3,4,7,8", "Gdzie odbywa się największe wchłanianie składników odżywczych i minerałów z pożywienia?:4,5,3,0", "Jaki narząd wydziela enzymy trawienne i kwas żołądkowy, aby wspomóc trawienie pokarmu?:5,4,7,3", "Jak nazywa się część gardła za jamą ustną i nosową?:6,2,9,8", "Gdzie jest przechowywana i zagęszczana żółć, zanim zostanie uwolniona do jelita cienkiego?:7,6,9,8", "Skąd wydzielana jest insulina?:8,0,7,6", "Jaki narząd znajduje się w prawym dolnym brzuchu?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Jaka jest struktura kości, która tworzy głowę?:0,1,9,7", "Co jest znane również jako kość barku?:1,9,11,6", "Czym jest półsztywna struktura kostno-chrzęstna otaczająca klatkę piersiową?:2,7,8,11", "Jaka jest charakterystyczna cecha kręgowca?:3,0,11,2", "Jaka jest większa z dwóch kości w nodze poniżej kolana?:4,6,9,5", "Jaka jest najdłuższa i najsilniejsza kość w twoim ciele?:5,6,9,1", "Czym jest długa kość w ramieniu, która biegnie od barku do łokcia?:6,5,1,7", "Czym jest grupa pięciu kości dłoni między palikami a nadgarstkiem?:7,5,1,3", "Jakie kości tworzą nadgarstek?:8,7,9,10", "Czym jest skupisko siedmiu przegubowych kości w każdej stopie?:9,7,8,1", "Czym jest grupa pięciu długich kości w stopie?:10,8,7,4", "Jaka jest dolna część tułowia?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Jaki mięsień tworzy zaokrąglony kontur ludzkiego ramienia?:0,1,3,5", "Co to jest duży mięsień, który leży z przodu ramienia między barkiem a łokciem?:1,0,2,3", "Jaki mięsień znajduje się na klatce piersiowej ludzkiego ciała?:2,3,5,1", "Czym jest mięsień trójkątny znajdujący się w tylnej części szyi?:3,1,2,5", "Jaki mięsień jest największym z bocznych mięśni brzucha?:4,1,2,0", "Jaki jest największy z 4 mięśni w przedniej części nogi?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Czym jest narząd mięśniowy, który pompuje krew przez naczynia krwionośne układu krążenia?:0,1,3,5", "Jaka jest główna i największa tętnica w ludzkim ciele?:1,4,3,2", "Jakie żyły drenują nerki?:2,5,4,1", "Czym są sparowane tętnice, które zaopatrują nerki w krew?:3,2,1,5", "Jakie żyły przenoszą odtlenioną krew z głowy z powrotem do serca?:4,2,5,1", "Co to jest duża żyła położona głęboko w udzie?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Czym jest narząd, który służy jako centrum układu nerwowego?:0,1,2,5", "Jaka jest główna cecha tyłomózgowia wszystkich kręgowców?:1,5,0,2", "Czym jest długa, cienka, rurkowata struktura zbudowana z tkanki nerwowej?:2,1,3,4", "Czym jest duży nerw biegnący wzdłuż stawu biodrowego?:3,2,1,5", "Co to jest gałąź nerwu kulszowego?:4,5,2,1", "Jaka jest grupa ciał komórek neuronowych w obwodowym układzie nerwowym?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Czym są fałdy mięśniowe otaczające usta?:0,1,4,7", "Czym jest mięsiste przedłużenie, które wisi nad gardłem?:1,4,0,7", "Czym są płaskie zęby z tyłu jamy ustnej?:2,3,5,6", "Jakie są przednie zęby?:3,2,5,6", "Czym jest narząd mięśniowy w jamie ustnej?:4,5,6,1", "Jakie narządy odgrywają ważną rolę w układzie odpornościowym?:5,1,4,0", "Czym jest cienka pozioma płytka kostna złożona z dwóch kości szkieletu twarzy?:6,7,2,5", "Jaka jest tkanka miękka stanowiąca tył podniebienia?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Jaki jest największy z czterech głównych płatów mózgu?:0,3,1,4", "Co znajduje się za uszami i jest drugim co do wielkości płatem?:1,0,3,2", "Co obejmuje percepcję wrażeń, w tym dotyku, temperatury, bólu?:2,0,3,5", "Czym jest centrum przetwarzania wzrokowego w mózgu?:3,0,1,4", "Co odgrywa ważną rolę w kontroli równowagi?:4,5,0,1", "Co pomaga kontrolować tętno i częstość oddechów?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Jaka jest widoczna część ucha, która znajduje się poza głową?:0,3,6,2", "Jaka jest ścieżka biegnąca od ucha zewnętrznego do ucha środkowego?:1,2,3,0", "Czym jest cienki płat skóry, który jest naciągnięty jak bęben i wibruje, gdy uderza w niego dźwięk?:2,0,5,3", "Jakie są trzy kości w uchu środkowym, które należą do najmniejszych kości w ludzkim ciele?:3,0,6,2", "Co przypomina muszlę ślimaka?:4,2,0,6", "Co przenosi słuchowe informacje czuciowe ze ślimaka ucha wewnętrznego bezpośrednio do mózgu?:5,2,0,6", "Co jest również znane jako rura słuchowa?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Jaka jest główna i największa tętnica w ludzkim ciele?:0,3,8,6", "Która żyła przenosi krew z głowy, szyi, ramion i klatki piersiowej z powrotem do serca?:1,3,0,2", "Która żyła przenosi krew z dolnej części ciała z powrotem do serca?:2,1,0,3", "Jaka jest górna komora, przez którą krew dostaje się do komór serca?:3,5,6,2", "która komora serca otrzymuje natlenioną krew z płuc?:4,3,6,8", "Jaki zawór oddziela dwie komory lewej strony serca?:5,8,7,3", "Czym jest komora mięśniowa, która pompuje krew z serca do układu krążenia?:6,5,8,2", "Która jest jedną z czterech komór serca?:7,0,1,2", "Jej zadaniem jest zapobieganie cofaniu się krwi z prawej komory do prawego przedsionka.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Jaka jest cienka struktura w oku odpowiedzialna za kontrolowanie średnicy i wielkości źrenicy?:0,1,3,2", "Jaka jest przezroczysta przednia część oka, która zakrywa tęczówkę?:1,2,3,0", "Jaka jest przezroczysta struktura w oku, która pomaga załamywać światło i skupiać się na siatkówce?:2,3,0,1", "Jaka jest najbardziej wewnętrzna, światłoczuła warstwa tkanki oka?:3,1,0,2", "Co przekazuje informacje wizualne z siatkówki do mózgu?:4,6,5,3", "Jaka jest przednia część oka między rogówką a tęczówką?:5,6,2,3", "Jaka komora oka znajduje się za soczewką i przed nerwem wzrokowym?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Co znajduje się w środku komórki i zawiera DNA ułożone w chromosomach?:0,1,2,3", "Jaki region w komórce zajmuje się wytwarzaniem rybosomów komórkowych?:1,2,3,4", "Czym jest galaretowata ciecz, która wypełnia wnętrze komórki?:2,3,4,5", "Co chroni komórkę przed środowiskiem zewnętrznym?:3,4,2,1", "Jaka jest struktura komórki, która produkuje białko?:4,3,2,1", "Co zamienia energię chemiczną w formę energii, którą może wykorzystać komórka?:5,4,3,2", "Jaki jest system transportu komórki eukariotycznej?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Co jest wykorzystywane do utleniania naszego pożywienia w procesie oddychania komórkowego, uwalniając w ten sposób energię?:0,1,2,3", "Jaki jest drugi najliczniejszy pierwiastek w ludzkim ciele?:1,2,3,4", "Co służy do utrzymania nawodnienia organizmu?:2,3,4,5", "Co jest używane do wytwarzania aminokwasów w naszym ciele, które z kolei wytwarzają białka?:3,5,4", "Co służy do budowy i utrzymania mocnych kości?:4,0,1,2", "Co jest używane do tworzenia kości i zębów?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Jaka jest choroba, w której dochodzi do zapalenia wątroby?:Zapalenie wątroby::", "Czym jest choroba, w której pasożyt infekuje przewód pokarmowy człowieka?:Pasożyty jelitowe::", "Jaka jest choroba, w której pojawia się stan zapalny trzustki?:Zapalenie trzustki::", "Jaka choroba powoduje pęknięcie wewnętrznej wyściółki żołądka?:Wrzód żołądka::", "Jaka jest choroba, w której dochodzi do zapalenia wyrostka robaczkowego?:Zapalenie wyrostka robaczkowego::", "Jaka jest choroba, w której dochodzi do zapalenia wewnętrznej wyściółki żołądka?:Nieżyt żołądka::", "Jaka choroba powoduje obrzęk żył w dolnej części odbytnicy?:Hemoroidy::", "Czym są twarde złoża minerałów i soli?:Kamienie nerkowe::", "Co to jest bliznowacenie wątroby spowodowane długotrwałym uszkodzeniem wątroby?:Marskość::", "Jaki jest rodzaj nieswoistego zapalenia jelit?:choroba Crohna::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Jaka choroba powoduje ból i stan zapalny w stawie?:Artretyzm::", "Czym jest przerwanie ciągłości kości?:Struktura kości::", "Jaka choroba osłabia kości, sprawiając, że stają się kruche i bardziej podatne na złamania?:Osteoporoza::", "Jaka choroba powoduje boczne skrzywienie kręgosłupa?:Skolioza::", "Jaki rodzaj zapalenia stawów powoduje nagły, silny ból stawów?:Dna::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Jaka choroba powoduje postępujące osłabienie i utratę masy mięśniowej?:dystrofia mięśniowa::", "Jaką chorobę wywołuje brak aktywności fizycznej?:zanik mięśni::", "Jaka choroba powoduje stan zapalny lub podrażnienie ścięgna?:zapalenie ścięgna::", "Czym jest nagły i mimowolny skurcz jednego z Twoich mięśni?:skurcze mięśni::", "Co się dzieje, gdy mięsień jest nadmiernie rozciągnięty lub rozdarty?:pęknięcie mięśnia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Jaki jest rodzaj raka, który zaczyna się w komórkach, które są częścią układu odpornościowego organizmu?:Chłoniak::", "Jaki jest typ nowotworu, który zwykle zaczyna się w szpiku kostnym?:Białaczka::", "Co jest spowodowane długotrwałym narażeniem na bardzo niskie temperatury?:Hipotermia::", "Czym jest stwardnienie twoich tętnic spowodowane stopniowym odkładaniem się płytki nazębnej?:Miażdżyca::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Co to jest ostre zapalenie błon ochronnych pokrywających mózg i rdzeń kręgowy?:Zapalenie opon mózgowych::", "Jaka choroba może wpływać na mózg i rdzeń kręgowy i może powodować problemy z widzeniem, równowagą, kontrolą mięśni?:Stwardnienie rozsiane::", "Czym jest zaburzenie mózgu, które prowadzi do drżenia, sztywności i trudności z chodzeniem, równowagą i koordynacją?:Choroba Parkinsona::", "Czym charakteryzują się wielokrotne tiki ruchowe i przynajmniej jeden tik wokalny?:zespół Tourette'a::", "Czym jest nieuleczalna, dziedziczna choroba mózgu, która uszkadza komórki mózgowe?:choroba Huntingtona::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Czym jest poważna infekcja dziąseł, która uszkadza tkankę miękką i może zniszczyć kość podtrzymującą zęby?:Zapalenie ozębnej::", "Jaka jest łagodna forma choroby dziąseł, która powoduje podrażnienie, zaczerwienienie i obrzęk dziąseł?:zapalenie dziąseł::", "Jakie są trwale uszkodzone obszary na twardej powierzchni zębów?:Próchnica::", "Co to jest infekcja migdałków z tyłu gardła?:Zapalenie migdałków::", "Co się stanie, jeśli tkanka tworząca wargę nie połączy się całkowicie przed urodzeniem?:Rozszczep wargi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Jakie zaburzenie mózgu niszczy pamięć i zdolności myślenia, a ostatecznie zdolność do wykonywania najprostszych zadań?:choroba Alzheimera::", "Jaki jest rzadki, ale poważny stan, w którym dochodzi do zapalenia mózgu?:Zapalenie mózgu::", "Czym jest ból głowy charakteryzujący się nawracającymi bólami głowy o nasileniu od umiarkowanego do ciężkiego?:Migrena::", "Jaka jest choroba, która atakuje mózg i powoduje częste drgawki?:Padaczka::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Co się dzieje, gdy wirus lub bakteria powodują stan zapalny w obszarze za błoną bębenkową?:Zapalenie ucha‎::", "Co odnosi się do całkowitej lub częściowej niezdolności słyszenia dźwięków?:Głuchota::", "W jakim stanie słyszysz dźwięki, gdy nie ma zewnętrznego źródła dźwięków?:szum w uszach::", "Czym jest zaburzenie ucha wewnętrznego, które może prowadzić do zawrotów głowy (zawrotów głowy) i utraty słuchu?:choroba Meniere'a::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Czym jest ból w klatce piersiowej spowodowany zmniejszonym dopływem krwi do mięśnia sercowego?:Dusznica::", "Czym jest ciśnienie krwi wyższe niż normalnie?:Nadciśnienie::", "Co się dzieje, gdy przepływ krwi do tętnicy wieńcowej serca zmniejsza się lub zatrzymuje?:Zawał mięśnia sercowego::", "Jaki jest poważny stan, w którym serce nie pompuje krwi tak wydajnie, jak powinno?:Zastoinowa niewydolność serca::", "Jak nazywa się wysoki poziom cholesterolu we krwi?:Hipercholesterolemia::", "Jaka jest nieprawidłowość rytmu serca?:Niemiarowość::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Czym jest mętny obszar w soczewce oka, który prowadzi do pogorszenia widzenia?:Zaćma::", "Co to jest stan oczu spowodowany infekcją lub alergią?:Zapalenie spojówek::", "Co to za stan oka, w którym nerw wzrokowy, który łączy oko z mózgiem, ulega uszkodzeniu?:Jaskra::", "Czym jest zaburzenie widzenia, w którym mózg nie przetwarza w pełni danych z jednego oka i z czasem faworyzuje drugie oko?:Niedowidzenie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Jaki jest rodzaj nowotworu, który może obejmować guzek w piersi lub zmianę kształtu piersi?:Rak piersi::", "Jaki jest najczęstszy rodzaj raka, który dotyka tylko mężczyzn?:Rak prostaty::", "Jaki jest rodzaj raka, w którym komórki w okrężnicy lub odbytnicy wymykają się spod kontroli?:Rak jelita grubego::", "Jaki rodzaj raka jest spowodowany długotrwałym paleniem tytoniu?:Rak płuc::", "Jaki rodzaj raka jest spowodowany nadmierną ekspozycją na promienie ultrafioletowe ze słońca?:Nowotwór skóry::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Jak nazywa się poziom tlenu we krwi poniżej normy, a konkretnie w tętnicach?:Hipoksemia::", "Jak nazywa się poziom wapnia we krwi poniżej normy?:Hipokalcemia::", "Jak nazywa się ponad normalny poziom wapnia we krwi?:Hiperkalcemia::", "Jak nazywa się poziom fosforanów poniżej normy?:hipofosfatemia::", "Jak nazywa się ponad normalny poziom fosforanów we krwi?:Hiperfosfatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Zażółcenie skóry i białek oczu:Zapalenie wątroby:3,4,5:", "Wysypka lub swędzenie wokół odbytnicy:Pasożyty jelitowe:2,7,8:", "Umiarkowany do silnego ból brzucha, który może promieniować na plecy:Zapalenie trzustki:1,3,4:", "Silny ból brzucha:Wrzód żołądka:6,7,8:", "Nagły ból, który zaczyna się po prawej stronie podbrzusza:Zapalenie wyrostka robaczkowego:0,3,7:", "Nudności lub nawracające rozstrój żołądka:Nieżyt żołądka:4,2,1:", "Ekstremalne swędzenie wokół odbytu:Hemoroidy:0,2,3:", "Ból lub pieczenie podczas oddawania moczu:Kamienie nerkowe:3,9,1:", "Zażółcenie skóry i białek oczu:Marskość:7,5,4:", "Krew w kale:choroba Crohna:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["ból stawu:Artretyzm:1,2,3:", "natychmiastowy, silny ból:Struktura kości:2,3:", "Utrata wzrostu z biegiem czasu:Osteoporoza:1,3,4:", "wyraźnie zakrzywiony kręgosłup:Skolioza:0,1,2:", "czerwona, błyszcząca skóra nad dotkniętym stawem:Dna:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Duże mięśnie łydek:dystrofia mięśniowa:2,3,4:", "Jedna ręka lub jedna noga jest mniejsza od drugiej:zanik mięśni:2,3,4:", "ból ścięgna, który nasila się podczas ruchu:zapalenie ścięgna:1,3,4:", "Nagły, ostry ból:skurcze mięśni:1,2:", "nagły ból, który nasila się podczas napinania mięśnia:pęknięcie mięśnia:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Bezbolesny obrzęk węzłów chłonnych szyi, pach lub pachwin:Chłoniak:2,3:", "Powiększone węzły chłonne, powiększona wątroba lub śledziona:Białaczka:2,3:", "dreszcze:Hipotermia:0,1:", "Drętwienie lub osłabienie rąk lub nóg:Miażdżyca:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Nagła wysoka gorączka, silny ból głowy, który wydaje się odbiegać od normalnego:Zapalenie opon mózgowych:1,2,3:", "ślepota w jednym oku:Stwardnienie rozsiane:0,3,4:", "Drżenie w rękach:Choroba Parkinsona:0,3,4:", "tiki ruchowe:zespół Tourette'a:0,1,4:", "trudności z koncentracją i zaniki pamięci:choroba Huntingtona:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Zaczerwienione lub spuchnięte dziąsła:Zapalenie ozębnej:2,3,4:", "Czerwone lub spuchnięte dziąsła:zapalenie dziąseł:2,3,4:", "Ból zęba:Próchnica:0,4,3:", "problemy z połykaniem:Zapalenie migdałków:0,2,4:", "Deformacje górnej szczęki:Rozszczep wargi:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["płyn, który spływa z ucha:Zapalenie ucha‎:1,2,3:", "Utrata słuchu:Głuchota:0,2,3:", "dzwonienie w uszach:szum w uszach:0,1,3:", "zawrót głowy:choroba Meniere'a:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Pochmurna wizja:Zaćma:1,2,3:", "Różowy lub czerwony kolor w bieli oka:Zapalenie spojówek:0,2,3:", "intensywny ból oka:Jaskra:0,1,3:", "Słaba percepcja głębi i widzenie peryferyjne:Niedowidzenie:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Nowy guzek w piersi lub pod pachami:Rak piersi:1,2,3:", "Krew w moczu:Rak prostaty:2,3,4:", "Zmiana nawyków jelitowych:Rak jelita grubego:1,3,4:", "kaszel, który nie ustępuje po 2 lub 3 tygodniach:Rak płuc:1,2,4:", "Pieprzyk zmieniający kolor, rozmiar lub krwawiący:Nowotwór skóry:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Niebieskawy kolor skóry, paznokci i ust:Hipoksemia:1,2,3:", "Drganie w dłoniach, twarzy i stopach:Hipokalcemia:0,2,4:", "Częstsze oddawanie moczu i pragnienie:Hiperkalcemia:0,1:", "osłabienie kości:hipofosfatemia:0,4:", "skurcze lub skurcze mięśni:Hiperfosfatemia:0,1:"]);
  }

  void addPT(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.pt;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Fígado:1,2,3:29.2,45", "Boca:4,2,9:28.1,81.6", "Esôfago:1,8,5:48.6,58.6", "Intestino grosso:4,2,6:20.5,21", "Intestino delgado:8,7,1:52.4,19", "Estômago:4,6,7:66,41", "Faringe:5,2,9:48.6,81", "Vesícula biliar:6,9,4:31.3,39.6", "Pâncreas:2,1,0:50,35.1", "Apêndice:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Crânio:11,8,6:48,97", "Escápula:5,4,3:61.1,80.2", "Costelas:11,7,0:56,74.1", "Coluna:8,10,1:45.9,65.2", "Tíbia:5,9,3:51.4,23.6", "Fêmur:4,10,7:54.9,35.5", "Úmero:2,7,9:69.1,66.2", "Ossos do metacarpo:6,0,1:81.3,44.8", "Ossos do carpo:5,4,2:77.1,48.7", "Tarso:4,3,1:49.3,6.9", "Ossos metatarso:0,3,5:54.2,2.8", "Pelve:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltóide:4,1,5:65.3,80.2", "Bíceps:5,0,4:67.3,71.5", "Peitoral:5,0,4:52.5,76.4", "Trapézio:1,5,4:51.4,85.5", "Oblíquo externo abdominal:1,5,0:54.2,65.9", "Músculo tibial anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Coração:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Veias renais:0,4,5:57.3,59.1", "Artéria renal:0,5,4:61.5,59.1", "Veia jugular:0,2,5:60.4,86.1", "Veia femoral:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Cérebro:5,4,3:50.4,96.8", "Cerebelo:5,4,3:56,92.6", "Medula espinhal:0,4,3:50.7,86.8", "Nervo ciático:0,4,5:59.4,37.6", "Nervo tibial:1,5,3:61.1,19.4", "Gânglio:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Lábios:1,2,4:61.4,96.6", "Úvula:6,2,0:48.6,51.8", "Molares:0,6,1:76.1,33", "Incisivo:0,4,1:50.4,83", "Língua:7,2,0:48.2,27.6", "Amígdala:4,0,6:69.5,46.8", "Paladar duro:1,2,0:48.6,73.8", "Paladar blando:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Lobo frontal:1,2,4:25,58.5", "Lobo temporal:0,2,3:51.2,42.2", "Lobo parietal:0,1,3:66,69", "Lobo occipital:0,1,2:91,46", "Cerebelo:1,2,0:72.8,26.1", "Tronco cerebral:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Pavilhão da orelha:1,2,4:8,31", "Canal auditivo:0,2,6:33.5,42.1", "Tímpano:1,5,6:55.6,42", "Ossículos:1,0,6:54.3,52.9", "Cóclea:6,1,5:75.8,45.7", "Nervo auditivo:6,2,1:91.8,48", "Tuba de Eustáquio:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Veia cava superior:6,7,4:27.3,92", "Veia cava inferior:1,4,3:27.8,6.8", "Átrio direito:4,7,0:31,54.4", "Átrio esquerdo:7,6,0:59.6,55.5", "Válvula mitral:8,2,0:69.5,43.7", "Ventrículo direito:0,1,3:47.8,38.9", "Ventrículo esquerdo:1,8,3:58.1,43", "Válvula tricúspide:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["íris:6,3,4:11.3,57", "Córnea:2,6,4:1.7,50.5", "cristalino:1,4,6:19,51.3", "Retina:1,6,4:64.6,76.8", "Nervo óptico:0,6,3:87.9,36.2", "Câmara anterior:6,4,3:7.2,51.4", "Humor vítreo:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Núcleo:5,3,2:57.3,75.5", "Nucléolo:2,6,4:44.5,67.9,8", "Citoplasma:1,4,6:93.08,50.09,9", "Membrana celular:2,5,1:90,24,14", "Ribossomo:2,1,3:80.929,75.844,14", "Mitocôndria:1,2,3:51.4,90.35,18", "Retículo endoplasmático:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oxigênio:1,2,4:74.5,29,25", "Carbono:2,0,4:74.5,57,25", "Hidrogênio:1,0,5:74.5,73.2,25", "Nitrogênio:1,0,2:74.5,83.5,25", "Cálcio:0,1,2:74.5,91.2,25", "Fósforo:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Qual órgão produz a bile necessária para a digestão?:0,7,6,8", "Qual é a primeira porção do canal alimentar que recebe alimentos e produz saliva?:1,2,6,5", "Por qual órgão o alimento passa da faringe para o estômago?:2,6,9,7", "Qual órgão é a última parte do sistema digestivo?:3,4,7,8", "Onde ocorre a maior absorção de nutrientes e minerais dos alimentos?:4,5,3,0", "Que órgão secreta enzimas digestivas e ácido gástrico para ajudar na digestão dos alimentos?:5,4,7,3", "Qual é o nome da parte da garganta atrás da boca e da cavidade nasal?:6,2,9,8", "Onde a bile é armazenada e concentrada antes de ser liberada no intestino delgado?:7,6,9,8", "De onde a insulina é secretada?:8,0,7,6", "Qual órgão está localizado no abdome inferior direito?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["O que é uma estrutura óssea que forma a cabeça?:0,1,9,7", "O que também é conhecido como osso do ombro?:1,9,11,6", "O que é uma estrutura óssea e cartilaginosa semi-rígida que circunda a cavidade torácica?:2,7,8,11", "Qual é a característica definidora de um vertebrado?:3,0,11,2", "Qual é o maior dos dois ossos da perna abaixo do joelho?:4,6,9,5", "Qual é o osso mais longo e mais forte do seu corpo?:5,6,9,1", "O que é um osso longo no braço que vai do ombro ao cotovelo?:6,5,1,7", "O que é um grupo de cinco ossos da mão entre as falanges e o pulso?:7,5,1,3", "Quais ossos compõem o pulso?:8,7,9,10", "O que é um conjunto de sete ossos articulados em cada pé?:9,7,8,1", "O que é um grupo de cinco ossos longos no pé?:10,8,7,4", "Qual é a parte inferior do tronco?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Qual é o músculo que forma o contorno arredondado do ombro humano?:0,1,3,5", "O que é um músculo grande que fica na frente do braço, entre o ombro e o cotovelo?:1,0,2,3", "Que músculo está situado no peito do corpo humano?:2,3,5,1", "O que é um músculo triangular localizado na face posterior do pescoço?:3,1,2,5", "Qual músculo é o maior dos músculos abdominais laterais?:4,1,2,0", "Qual é o maior dos 4 músculos do compartimento anterior da perna?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["O que é um órgão muscular que bombeia o sangue através dos vasos sanguíneos do sistema circulatório?:0,1,3,5", "Qual é a principal e a maior artéria do corpo humano?:1,4,3,2", "Quais são as veias que drenam o rim?:2,5,4,1", "Quais são as artérias pareadas que fornecem sangue aos rins?:3,2,1,5", "Quais são as veias que levam sangue desoxigenado da cabeça de volta ao coração?:4,2,5,1", "O que é uma grande veia localizada profundamente na coxa?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["O que é um órgão que serve como centro do sistema nervoso?:0,1,2,5", "Qual é a principal característica do rombencéfalo de todos os vertebrados?:1,5,0,2", "O que é uma estrutura tubular longa e fina composta de tecido nervoso?:2,1,3,4", "O que é um grande nervo que corre ao lado da articulação do quadril?:3,2,1,5", "O que é um ramo do nervo ciático?:4,5,2,1", "O que é um grupo de corpos celulares de neurônios no sistema nervoso periférico?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["O que são dobras musculares que circundam a boca?:0,1,4,7", "O que é uma extensão carnuda que fica acima da garganta?:1,4,0,7", "O que são dentes planos na parte de trás da boca?:2,3,5,6", "Quais são os dentes da frente?:3,2,5,6", "O que é um órgão muscular na boca?:4,5,6,1", "Quais órgãos desempenham um papel importante no sistema imunológico?:5,1,4,0", "O que é uma fina placa óssea horizontal composta por dois ossos do esqueleto facial?:6,7,2,5", "Qual é o tecido mole que constitui a parte posterior do céu da boca?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Qual é o maior dos quatro lobos principais do cérebro?:0,3,1,4", "O que fica atrás das orelhas e é o segundo maior lóbulo?:1,0,3,2", "O que está envolvido na percepção da sensação, incluindo toque, temperatura, dor?:2,0,3,5", "Qual é o centro de processamento visual do cérebro?:3,0,1,4", "O que desempenha um papel importante no controle do equilíbrio?:4,5,0,1", "O que ajuda a controlar a frequência cardíaca e a frequência respiratória?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Qual é a parte visível da orelha que fica fora da cabeça?:0,3,6,2", "O que é um caminho que vai do ouvido externo ao ouvido médio?:1,2,3,0", "O que é um fino retalho de pele que é esticado como um tambor e vibra quando o som o atinge?:2,0,5,3", "Quais são os três ossos do ouvido médio que estão entre os menores ossos do corpo humano?:3,0,6,2", "O que se assemelha à concha de um caracol?:4,2,0,6", "O que transporta a informação sensorial auditiva da cóclea do ouvido interno diretamente para o cérebro?:5,2,0,6", "O que também é conhecido como tuba auditiva?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Qual é a principal e maior artéria do corpo humano?:0,3,8,6", "Qual veia leva o sangue da cabeça, pescoço, braços e peito de volta ao coração?:1,3,0,2", "Qual veia transporta o sangue da parte inferior do corpo de volta ao coração?:2,1,0,3", "Qual é a câmara superior pela qual o sangue entra nos ventrículos do coração?:3,5,6,2", "qual câmara do coração recebe sangue oxigenado dos pulmões?:4,3,6,8", "Qual válvula separa as duas câmaras do lado esquerdo do coração?:5,8,7,3", "O que é a câmara muscular que bombeia o sangue para fora do coração e para o sistema circulatório?:6,5,8,2", "Qual é uma das quatro câmaras do coração?:7,0,1,2", "Seu papel é impedir o refluxo de sangue do ventrículo direito para o átrio direito.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["O que é uma estrutura fina no olho, responsável por controlar o diâmetro e o tamanho da pupila?:0,1,3,2", "Qual é a parte frontal transparente do olho que cobre a íris?:1,2,3,0", "O que é uma estrutura transparente no olho que ajuda a refratar a luz a ser focada na retina?:2,3,0,1", "Qual é a camada de tecido do olho mais interna e sensível à luz?:3,1,0,2", "O que transmite a informação visual da retina para o cérebro?:4,6,5,3", "Qual é a parte frontal do olho entre a córnea e a íris?:5,6,2,3", "Qual câmara do olho está localizada atrás da lente e na frente do nervo óptico?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["O que é encontrado no meio da célula e contém DNA organizado em cromossomos?:0,1,2,3", "Que região dentro da célula está relacionada com a produção dos ribossomos celulares?:1,2,3,4", "O que é um líquido gelatinoso que preenche o interior de uma célula?:2,3,4,5", "O que protege a célula de seu ambiente externo?:3,4,2,1", "O que é uma estrutura celular que produz proteínas?:4,3,2,1", "O que converte a energia química em uma forma de energia que a célula pode usar?:5,4,3,2", "Qual é o sistema de transporte da célula eucariótica?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["O que é usado para oxidar nossos alimentos, no processo de respiração celular, liberando assim energia?:0,1,2,3", "Qual é o segundo elemento mais abundante no corpo humano?:1,2,3,4", "O que é usado para manter o corpo humano hidratado?:2,3,4,5", "O que é usado para fazer aminoácidos em nosso corpo, que por sua vez produzem proteínas?:3,5,4", "O que é usado para construir e manter ossos fortes?:4,0,1,2", "O que é usado na formação de ossos e dentes?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["O que é uma doença em que seu fígado fica inflamado?:Hepatite::", "O que é uma doença na qual um parasita infecta o trato gastrointestinal de humanos?:Parasitas intestinais::", "O que é uma doença em que seu pâncreas fica inflamado?:Pancreatite::", "O que é uma doença que causa uma ruptura no revestimento interno do estômago?:Úlcera gástrica::", "O que é uma doença em que seu apêndice fica inflamado?:Apendicite::", "O que é uma doença em que o revestimento interno do estômago fica inflamado?:Gastrite::", "Que doença causa veias inchadas no reto inferior?:Hemorróidas::", "O que são depósitos duros feitos de minerais e sais?:Pedras nos rins::", "O que é a cicatrização do fígado causada por danos no fígado a longo prazo?:Cirrose::", "O que é um tipo de doença inflamatória intestinal?:doença de Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Que doença causa dor e inflamação em uma articulação?:Artrite::", "O que é uma quebra na continuidade de um osso?:Fratura óssea::", "Que doença enfraquece os ossos, tornando-os frágeis e mais propensos a quebrar?:Osteoporose::", "Que doença causa uma curvatura lateral da coluna?:Escoliose::", "O que é um tipo de artrite que causa dor nas articulações repentina e intensa?:Gota::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Que doença causa fraqueza progressiva e perda de massa muscular?:distrofia muscular::", "Que doença é causada pela falta de atividade física?:atrofia muscular::", "Que doença causa a inflamação ou irritação de um tendão?:tendinite::", "O que é uma contração súbita e involuntária de um dos seus músculos?:cãibras musculares::", "O que ocorre quando seu músculo está sobrecarregado ou rasgado?:ruptura muscular::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["O que é um tipo de câncer que começa nas células que fazem parte do sistema imunológico do corpo?:Linfoma::", "Qual é um tipo de câncer que geralmente começa na medula óssea?:Leucemia::", "O que é causado por exposições prolongadas a temperaturas muito frias?:Hipotermia::", "O que é um endurecimento de suas artérias causado pelo acúmulo gradual de placas?:Aterosclerose::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["O que é uma inflamação aguda das membranas protetoras que cobrem o cérebro e a medula espinhal?:Meningite::", "Qual é uma doença que pode afetar seu cérebro e medula espinhal e pode causar problemas de visão, equilíbrio, controle muscular?:Esclerose múltipla::", "O que é um distúrbio cerebral que leva a tremores, rigidez e dificuldade de andar, equilíbrio e coordenação?:Mal de Parkinson::", "O que é caracterizado por múltiplos tiques de movimento e pelo menos um tique vocal?:síndrome de Tourette::", "O que é um distúrbio cerebral incurável e hereditário que danifica as células cerebrais?:Doença de Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["O que é uma infecção gengival grave que danifica o tecido mole e pode destruir o osso que sustenta os dentes?:Periodontite::", "Qual é uma forma leve de doença gengival que causa irritação, vermelhidão e inchaço da gengiva?:gengivite::", "Quais são as áreas permanentemente danificadas na superfície dura dos dentes?:Cárie dentária::", "O que é uma infecção das amígdalas na parte de trás da garganta?:Amidalite::", "O que acontece se o tecido que compõe o lábio não se unir completamente antes do nascimento?:Lábio leporino::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Que distúrbio cerebral destrói a memória e as habilidades de pensamento e, eventualmente, a capacidade de realizar as tarefas mais simples?:doença de Alzheimer::", "O que é uma condição incomum, mas grave, na qual o cérebro fica inflamado?:Encefalite::", "O que é um distúrbio de dor de cabeça caracterizado por dores de cabeça recorrentes que são moderadas a graves?:Enxaqueca::", "O que é uma doença que afeta o cérebro e causa convulsões frequentes?:Epilepsia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["O que ocorre quando um vírus ou bactéria causa inflamação na área atrás do tímpano?:Otite::", "O que se refere à incapacidade total ou parcial de ouvir sons?:Surdez::", "Qual é uma condição na qual você ouve sons quando não há uma fonte externa dos sons?:Zumbido::", "O que é um distúrbio do ouvido interno que pode levar a tonturas (vertigem) e perda auditiva?:Doença de Meniere::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["O que é uma dor no peito causada pela redução do fluxo sanguíneo para os músculos do coração?:Angina::", "O que é a pressão arterial que está acima do normal?:Hipertensão::", "O que ocorre quando o fluxo sanguíneo diminui ou para na artéria coronária do coração?:Infarto do miocárdio::", "O que é uma condição séria na qual o coração não bombeia sangue com a eficiência que deveria?:Insuficiência cardíaca congestiva::", "Qual é a palavra para níveis elevados de colesterol no sangue?:Hipercolesterolemia::", "O que é uma anormalidade do ritmo cardíaco?:Arritmia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["O que é uma área turva na lente do olho que leva a uma diminuição da visão?:Catarata::", "O que é uma condição ocular causada por infecção ou alergia?:Conjuntivite::", "O que é uma condição ocular em que o nervo óptico, que conecta o olho ao cérebro, fica danificado?:Glaucoma::", "O que é um distúrbio da visão em que o cérebro não processa totalmente as entradas de um olho e, com o tempo, favorece o outro olho?:Ambliopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Qual é um tipo de câncer que pode incluir um nódulo na mama ou uma mudança na forma da mama?:Câncer de mama::", "Qual é o tipo de câncer mais comum que afeta apenas homens?:Câncer de próstata::", "Qual é um tipo de câncer em que as células do cólon ou do reto crescem fora de controle?:Câncer colorretal::", "Que tipo de câncer é causado pelo tabagismo a longo prazo?:Câncer de pulmão::", "Que tipo de câncer é causado pela exposição excessiva aos raios ultravioleta do sol?:Câncer de pele::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Como é chamado um nível abaixo do normal de oxigênio no sangue, especificamente nas artérias?:Hipoxemia::", "Como é chamado um nível abaixo do normal de cálcio no sangue?:Hipocalcemia::", "Como é chamado um nível acima do normal de cálcio no sangue?:Hipercalcemia::", "Como é chamado um nível abaixo do normal de fosfato no sangue?:hipofosfatemia::", "Como é chamado um nível acima do normal de fosfato no sangue?:Hiperfosfatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Amarelecimento da pele e do branco dos olhos:Hepatite:3,4,5:", "Erupção ou coceira ao redor do reto:Parasitas intestinais:2,7,8:", "Dor abdominal moderada a grave que pode se espalhar para as costas:Pancreatite:1,3,4:", "Dor de estômago severa:Úlcera gástrica:6,7,8:", "Dor súbita que começa no lado direito do abdome inferior:Apendicite:0,3,7:", "Náusea ou dor de estômago recorrente:Gastrite:4,2,1:", "Coceira extrema ao redor do ânus:Hemorróidas:0,2,3:", "Dor ou sensação de queimação ao urinar:Pedras nos rins:3,9,1:", "Amarelecimento da pele e do branco dos olhos:Cirrose:7,5,4:", "Sangue nas fezes:doença de Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["dor nas articulações:Artrite:1,2,3:", "dor imediata e intensa:Fratura óssea:2,3:", "Perda de altura ao longo do tempo:Osteoporose:1,3,4:", "uma coluna visivelmente curvada:Escoliose:0,1,2:", "pele vermelha e brilhante sobre a articulação afetada:Gota:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Grandes músculos da panturrilha:distrofia muscular:2,3,4:", "Um braço ou uma perna é menor que o outro:atrofia muscular:2,3,4:", "dor em um tendão que piora quando você se move:tendinite:1,3,4:", "Uma dor súbita e aguda:cãibras musculares:1,2:", "dor súbita que piora ao contrair o músculo:ruptura muscular:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Inchaço indolor dos gânglios linfáticos no pescoço, axilas ou virilha:Linfoma:2,3:", "Linfonodos inchados, fígado ou baço aumentados:Leucemia:2,3:", "Tremendo:Hipotermia:0,1:", "Dormência ou fraqueza em seus braços ou pernas:Aterosclerose:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Febre alta repentina, dor de cabeça intensa que parece diferente do normal:Meningite:1,2,3:", "cegueira em um olho:Esclerose múltipla:0,3,4:", "Tremor nas mãos:Mal de Parkinson:0,3,4:", "tiques de movimento:síndrome de Tourette:0,1,4:", "dificuldade de concentração e lapsos de memória:Doença de Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Gengivas vermelhas ou inchadas:Periodontite:2,3,4:", "Gengivas vermelhas ou inchadas:gengivite:2,3,4:", "Dor de dente:Cárie dentária:0,4,3:", "problemas para engolir:Amidalite:0,2,4:", "Deformidades do maxilar superior:Lábio leporino:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["fluido que drena do ouvido:Otite:1,2,3:", "Perda de audição:Surdez:0,2,3:", "um zumbido nos ouvidos:Zumbido:0,1,3:", "vertigem:Doença de Meniere:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Visão nublada:Catarata:1,2,3:", "Cor rosa ou vermelha no branco do olho:Conjuntivite:0,2,3:", "dor ocular intensa:Glaucoma:0,1,3:", "Percepção de profundidade ruim e visão periférica:Ambliopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Um novo nódulo na mama ou nas axilas:Câncer de mama:1,2,3:", "Sangue na urina:Câncer de próstata:2,3,4:", "Uma mudança nos hábitos intestinais:Câncer colorretal:1,3,4:", "uma tosse que não desaparece após 2 ou 3 semanas:Câncer de pulmão:1,2,4:", "Uma verruga que muda de cor, tamanho ou que sangra:Câncer de pele:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Cor azulada na pele, unhas e lábios:Hipoxemia:1,2,3:", "Espasmos nas mãos, rosto e pés:Hipocalcemia:0,2,4:", "Micção e sede mais frequentes:Hipercalcemia:0,1:", "enfraquecimento dos ossos:hipofosfatemia:0,4:", "cãibras musculares ou espasmos:Hiperfosfatemia:0,1:"]);
  }

  void addRO(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.ro;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Ficat:1,2,3:29.2,45", "Gura:4,2,9:28.1,81.6", "Esofag:1,8,5:48.6,58.6", "Intestinul gros:4,2,6:20.5,21", "Intestinul subțire:8,7,1:52.4,19", "Stomac:4,6,7:66,41", "faringe:5,2,9:48.6,81", "Vezică biliară:6,9,4:31.3,39.6", "Pancreas:2,1,0:50,35.1", "Apendice:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Craniu:11,8,6:48,97", "omoplat:5,4,3:61.1,80.2", "Coaste:11,7,0:56,74.1", "Coloană vertebrală:8,10,1:45.9,65.2", "Tibia:5,9,3:51.4,23.6", "Femur:4,10,7:54.9,35.5", "Humerus:2,7,9:69.1,66.2", "Oase metacarpiene:6,0,1:81.3,44.8", "Oasele carpului:5,4,2:77.1,48.7", "Tarsul:4,3,1:49.3,6.9", "Oase metatarsiene:0,3,5:54.2,2.8", "Pelvis:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["deltoid:4,1,5:65.3,80.2", "biceps:5,0,4:67.3,71.5", "pectoral:5,0,4:52.5,76.4", "trapez:1,5,4:51.4,85.5", "Oblicul extern abdominal:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Inimă:4,2,5:65.3,73", "aortă:4,2,5:62.9,77.6", "vene renale:0,4,5:57.3,59.1", "Artera renală:0,5,4:61.5,59.1", "vene jugulare:0,2,5:60.4,86.1", "Venă femurală:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Creier:5,4,3:50.4,96.8", "Cerebelul:5,4,3:56,92.6", "Coloană vertebrală:0,4,3:50.7,86.8", "Nervul sciatic:0,4,5:59.4,37.6", "Nervul tibial:1,5,3:61.1,19.4", "ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Buze:1,2,4:61.4,96.6", "uvula:6,2,0:48.6,51.8", "Molari:0,6,1:76.1,33", "incisivul:0,4,1:50.4,83", "Limba:7,2,0:48.2,27.6", "amigdale:4,0,6:69.5,46.8", "Palatul dur:1,2,0:48.6,73.8", "Palatul moale:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Lobul frontal:1,2,4:25,58.5", "Lobul temporal:0,2,3:51.2,42.2", "Lobul parietal:0,1,3:66,69", "Lobul occipital:0,1,2:91,46", "Cerebelul:1,2,0:72.8,26.1", "Trunchiul cerebral:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Pavilionul urechii:1,2,4:8,31", "Canalul urechii:0,2,6:33.5,42.1", "Timpan:1,5,6:55.6,42", "Oscioarele urechii:1,0,6:54.3,52.9", "cohlee:6,1,5:75.8,45.7", "Nerv auditiv:6,2,1:91.8,48", "Tub Eustahian:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["aortă:8,6,3:51.7,84.7", "Vena cavă superioară:6,7,4:27.3,92", "vena cavă Inferioră:1,4,3:27.8,6.8", "Atriul drept:4,7,0:31,54.4", "Atriul stâng:7,6,0:59.6,55.5", "Valva mitrala:8,2,0:69.5,43.7", "Ventriculul drept:0,1,3:47.8,38.9", "Ventriculul stâng:1,8,3:58.1,43", "Valva tricuspidă:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Iris:6,3,4:11.3,57", "cornee:2,6,4:1.7,50.5", "cristalin:1,4,6:19,51.3", "Retină:1,6,4:64.6,76.8", "Nervul optic:0,6,3:87.9,36.2", "Camera anterioară:6,4,3:7.2,51.4", "Umoare vitroasă:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Nucleu:5,3,2:57.3,75.5", "Nucleol:2,6,4:44.5,67.9,8", "Citoplasmă:1,4,6:93.08,50.09,9", "Membrană celulară:2,5,1:90,24,14", "Ribozom:2,1,3:80.929,75.844,14", "Mitocondrie:1,2,3:51.4,90.35,18", "Reticul endoplasmatic:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oxigen:1,2,4:74.5,29,25", "Carbon:2,0,4:74.5,57,25", "Hidrogen:1,0,5:74.5,73.2,25", "Azot:1,0,2:74.5,83.5,25", "Calciu:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Ce organ produce bila necesară digestiei?:0,7,6,8", "Care este prima porțiune a canalului alimentar care primește hrană și produce saliva?:1,2,6,5", "Prin ce organ trec alimentele din faringe în stomac?:2,6,9,7", "Ce organ este ultima parte a sistemului digestiv?:3,4,7,8", "Unde are loc cea mai mare absorbție de nutrienți și minerale din alimente?:4,5,3,0", "Ce organ secretă enzime digestive și acid gastric pentru a ajuta digestia alimentelor?:5,4,7,3", "Cum se numește partea gâtului din spatele gurii și cavității nazale?:6,2,9,8", "Unde este depozitată și concentrată bila înainte de a fi eliberată în intestinul subțire?:7,6,9,8", "De unde este secretată insulina?:8,0,7,6", "Ce organ este situat în partea dreaptă jos a abdomenului?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Ce este o structură osoasă care formează capul?:0,1,9,7", "Ce este cunoscut și sub numele de osul umărului?:1,9,11,6", "Ce este o structură osoasă și cartilaginoasă semirigidă care înconjoară cavitatea toracică?:2,7,8,11", "Care este caracteristica definitorie a unei vertebrate?:3,0,11,2", "Care este cel mai mare dintre cele două oase ale piciorului de sub genunchi?:4,6,9,5", "Care este cel mai lung și mai puternic os din corpul tău?:5,6,9,1", "Ce este un os lung al brațului care merge de la umăr la cot?:6,5,1,7", "Ce este un grup de cinci oase ale mâinii între falange și încheietura mâinii?:7,5,1,3", "Ce oase alcătuiesc încheietura mâinii?:8,7,9,10", "Ce este un grup de șapte oase articulate în fiecare picior?:9,7,8,1", "Ce este un grup de cinci oase lungi în picior?:10,8,7,4", "Care este partea inferioară a trunchiului?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Care este mușchiul care formează conturul rotunjit al umărului uman?:0,1,3,5", "Ce este un mușchi mare care se află pe partea din față a brațului, între umăr și cot?:1,0,2,3", "Ce mușchi este situat în pieptul corpului uman?:2,3,5,1", "Ce este un mușchi triunghiular situat pe partea posterioară a gâtului?:3,1,2,5", "Care mușchi este cel mai mare dintre mușchii abdominali laterali?:4,1,2,0", "Care este cel mai mare dintre cei 4 mușchi din compartimentul anterior al piciorului?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Ce este un organ muscular care pompează sângele prin vasele de sânge ale sistemului circulator?:0,1,3,5", "Care este artera principală și cea mai mare din corpul uman?:1,4,3,2", "Ce sunt venele care drenează rinichiul?:2,5,4,1", "Care sunt arterele pereche care alimentează rinichii cu sânge?:3,2,1,5", "Ce sunt venele care duc sângele dezoxigenat de la cap înapoi la inimă?:4,2,5,1", "Ce este o venă mare situată adânc în interiorul coapsei?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Ce este un organ care servește ca centru al sistemului nervos?:0,1,2,5", "Care este o caracteristică majoră a creierului posterior al tuturor vertebratelor?:1,5,0,2", "Ce este o structură tubulară lungă, subțire, formată din țesut nervos?:2,1,3,4", "Ce este un nerv mare care trece pe lângă articulația șoldului?:3,2,1,5", "Ce este o ramură a nervului sciatic?:4,5,2,1", "Ce este un grup de corpuri celulare neuronale din sistemul nervos periferic?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Ce sunt pliurile musculare care înconjoară gura?:0,1,4,7", "Ce este o extensie cărnoasă care atârnă deasupra gâtului?:1,4,0,7", "Ce sunt dinții plati din spatele gurii?:2,3,5,6", "Care sunt dinții din față?:3,2,5,6", "Ce este un organ muscular în gură?:4,5,6,1", "Ce organe joacă un rol important în sistemul imunitar?:5,1,4,0", "Ce este o placă osoasă orizontală subțire formată din două oase ale scheletului facial?:6,7,2,5", "Care este țesutul moale care constituie partea din spate a cerului gurii?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Care este cel mai mare dintre cei patru lobi majori ai creierului?:0,3,1,4", "Ce se află în spatele urechilor și este al doilea lob ca mărime?:1,0,3,2", "Ce este implicat în percepția senzației, inclusiv atingerea, temperatura, durerea?:2,0,3,5", "Care este centrul de procesare vizuală al creierului?:3,0,1,4", "Ce joacă un rol important în controlul echilibrului?:4,5,0,1", "Ce ajută la controlul ritmului cardiac și al respirației?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Care este partea vizibilă a urechii care se află în afara capului?:0,3,6,2", "Ce este o cale care merge de la urechea externă la urechea medie?:1,2,3,0", "Ce este o clapă subțire de piele care este întinsă strâns ca o tobă și vibrează când sunetul îl lovește?:2,0,5,3", "Care sunt trei oase din urechea medie care sunt printre cele mai mici oase din corpul uman?:3,0,6,2", "Ce seamănă cu coaja unui melc?:4,2,0,6", "Ce transportă informațiile senzoriale auditive de la cohleea urechii interne direct la creier?:5,2,0,6", "Ce este cunoscut și sub numele de tub auditiv?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Care este artera principală și cea mai mare din corpul uman?:0,3,8,6", "Care venă duce sângele din cap, gât, brațe și piept înapoi la inimă?:1,3,0,2", "Care venă duce sângele din partea inferioară a corpului înapoi la inimă?:2,1,0,3", "Care este camera superioară prin care sângele pătrunde în ventriculii inimii?:3,5,6,2", "ce cameră a inimii primește sânge oxigenat din plămâni?:4,3,6,8", "Ce supapă separă cele două camere din partea stângă a inimii?:5,8,7,3", "Ce este camera musculară care pompează sângele din inimă și în sistemul circulator?:6,5,8,2", "Care este una dintre cele patru camere ale inimii?:7,0,1,2", "Rolul său este de a preveni fluxul înapoi de sânge din ventriculul drept în atriul drept.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Ce este o structură subțire a ochiului, responsabilă pentru controlul diametrului și mărimii pupilei?:0,1,3,2", "Care este partea frontală transparentă a ochiului care acoperă irisul?:1,2,3,0", "Ce este o structură transparentă în ochi care ajută la refracția luminii pentru a fi focalizată pe retină?:2,3,0,1", "Care este cel mai interior strat de țesut al ochiului, sensibil la lumină?:3,1,0,2", "Ce transmite informațiile vizuale de la retină la creier?:4,6,5,3", "Care este partea din față a ochiului dintre cornee și iris?:5,6,2,3", "Ce cameră oculară se află în spatele cristalinului și în fața nervului optic?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Ce se găsește în mijlocul celulei și conține ADN aranjat în cromozomi?:0,1,2,3", "Ce regiune din interiorul celulei este preocupată de producerea ribozomilor celulari?:1,2,3,4", "Ce este un lichid gelatinos care umple interiorul unei celule?:2,3,4,5", "Ce protejează celula de mediul ei extern?:3,4,2,1", "Ce este o structură celulară care produce proteine?:4,3,2,1", "Ce transformă energia chimică într-o formă de energie pe care o poate folosi celula?:5,4,3,2", "Care este sistemul de transport al celulei eucariote?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Cu ce ​​se oxidează alimentele noastre, în procesul de respirație celulară, eliberând astfel energie?:0,1,2,3", "Care este al doilea element cel mai abundent din corpul uman?:1,2,3,4", "Ce se folosește pentru a menține corpul uman hidratat?:2,3,4,5", "Ce se folosește pentru a produce aminoacizi în corpul nostru, care la rândul lor produc proteine?:3,5,4", "Ce se folosește pentru a construi și menține oase puternice?:4,0,1,2", "Ce se folosește în formarea oaselor și a dinților?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Care este o boală în care ficatul tău devine inflamat?:hepatită::", "Ce este o boală în care un parazit infectează tractul gastro-intestinal al omului?:Paraziți intestinali::", "Care este o boală în care pancreasul tău devine inflamat?:Pancreatită::", "Ce este o boală care provoacă o ruptură a mucoasei interioare a stomacului?:Ulcer gastric::", "Care este o boală în care apendicele tău se inflama?:Apendicită::", "Care este o boală în care mucoasa interioară a stomacului devine inflamată?:Gastrită::", "Ce boală provoacă umflarea venelor în rectul inferior?:Hemoroizi::", "Ce sunt depozitele dure formate din minerale și săruri?:Pietre la rinichi::", "Ce este cicatrizarea ficatului cauzată de leziunile hepatice pe termen lung?:Ciroză::", "Ce este un tip de boală inflamatorie intestinală?:Boala Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Ce boală provoacă durere și inflamație într-o articulație?:Artrită::", "Ce este o întrerupere în continuitatea unui os?:Fractură osoasă::", "Ce boală slăbește oasele, făcându-le fragile și mai susceptibile de a se rupe?:Osteoporoza::", "Ce boală provoacă o curbură laterală a coloanei vertebrale?:scolioza::", "Care este un tip de artrită care provoacă dureri articulare bruște și severe?:Gută::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Ce boală provoacă slăbiciune progresivă și pierderea masei musculare?:distrofie musculara::", "Ce boală este cauzată de lipsa de activitate fizică?:atrofie musculară::", "Ce boală provoacă inflamația sau iritația unui tendon?:tendinita::", "Ce este o contracție bruscă și involuntară a unuia dintre mușchii tăi?:crampe musculare::", "Ce se întâmplă când mușchiul tău este supraîntindet sau rupt?:ruptură musculară::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Care este un tip de cancer care începe în celulele care fac parte din sistemul imunitar al organismului?:Limfom::", "Care este un tip de cancer care începe de obicei în măduva osoasă?:leucemie::", "Ce este cauzat de expunerea prelungită la temperaturi foarte scăzute?:Hipotermie::", "Ce este o întărire a arterelor tale cauzată de acumularea treptată a plăcii?:Ateroscleroza::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Ce este o inflamație acută a membranelor protectoare care acoperă creierul și măduva spinării?:Meningita::", "Care este o boală care vă poate afecta creierul și măduva spinării și poate cauza probleme cu vederea, echilibrul, controlul muscular?:Scleroză multiplă::", "Ce este o tulburare a creierului care duce la tremurături, rigiditate și dificultăți de mers, echilibru și coordonare?:boala Parkinson::", "Ce se caracterizează prin ticuri de mișcare multiple și cel puțin un tic vocal?:sindromul Tourette::", "Ce este o tulburare a creierului ereditară, incurabilă, care dăunează celulelor creierului?:boala Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Ce este o infecție gravă a gingiilor care dăunează țesutului moale și care poate distruge osul care susține dinții tăi?:Parodontita::", "Ce este o formă ușoară de boală a gingiilor care provoacă iritație, roșeață și umflare a gingiilor?:gingivita::", "Care sunt zonele deteriorate permanent de pe suprafața tare a dinților tăi?:Carie dentară::", "Ce este o infecție a amigdalelor din spatele gâtului?:Amigdalită::", "Ce se întâmplă dacă țesutul care alcătuiește buza nu se unește complet înainte de naștere?:Buza despicată::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Ce tulburare a creierului distruge memoria și abilitățile de gândire și, în cele din urmă, capacitatea de a îndeplini cele mai simple sarcini?:Boala Alzheimer::", "Care este o afecțiune neobișnuită, dar gravă, în care creierul devine inflamat?:Encefalită::", "Ce este o tulburare de cefalee caracterizată prin dureri de cap recurente care sunt moderate până la severe?:Migrenă::", "Ce este o boală care afectează creierul și provoacă convulsii frecvente?:Epilepsie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Ce se întâmplă atunci când un virus sau o bacterie provoacă inflamarea zonei din spatele timpanului?:Otita::", "Ce se referă la incapacitatea totală sau parțială de a auzi sunete?:Surditate::", "Care este starea în care auziți sunete când nu există nicio sursă exterioară a sunetelor?:Tinitus::", "Ce este o tulburare a urechii interne care poate duce la amețeli (vertij) și pierderea auzului?:boala Meniere::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Ce este o durere în piept cauzată de fluxul sanguin redus către mușchii inimii?:angina pectorală::", "Care este tensiunea arterială mai mare decât în ​​mod normal?:Hipertensiune::", "Ce se întâmplă când fluxul sanguin scade sau se oprește în artera coronară a inimii?:Infarct miocardic::", "Care este o afecțiune gravă în care inima nu pompează sânge atât de eficient pe cât ar trebui?:Insuficiență cardiacă congestivă::", "Care este un cuvânt pentru niveluri ridicate de colesterol în sânge?:Hipercolesterolemie::", "Ce este o anomalie a ritmului inimii?:Aritmie::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Ce este o zonă tulbure din cristalinul ochiului care duce la scăderea vederii?:Cataractă::", "Ce este o afecțiune a ochiului cauzată de infecție sau alergii?:Conjunctivită::", "Care este o afecțiune a ochiului în care nervul optic, care conectează ochiul de creier, este deteriorat?:Glaucom::", "Ce este o tulburare a vederii în care creierul nu reușește să proceseze complet intrările de la un ochi și, în timp, favorizează celălalt ochi?:Ambliopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Care este un tip de cancer care poate include un nodul la sân sau o modificare a formei sânului?:Cancer mamar::", "Care este cel mai frecvent tip de cancer care afectează numai bărbații?:Cancer de prostată::", "Care este un tip de cancer în care celulele din colon sau rect cresc fără control?:Cancer colorectal::", "Ce tip de cancer este cauzat de fumatul pe termen lung?:Cancer de plamani::", "Ce tip de cancer este cauzat de supraexpunerea la razele ultraviolete de la soare?:Cancer de piele::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Cum se numește un nivel sub normal de oxigen din sângele tău, în special în artere?:Hipoxemie::", "Cum se numește un nivel sub normal de calciu din sângele tău?:Hipocalcemie::", "Cum se numește un nivel peste normal de calciu din sângele tău?:Hipercalcemie::", "Cum se numește un nivel sub normal de fosfat din sângele tău?:hipofosfatemie::", "Cum se numește un nivel peste normal de fosfat în sângele tău?:Hiperfosfatemia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Îngălbenirea pielii și a albului ochilor:hepatită:3,4,5:", "Erupție cutanată sau mâncărime în jurul rectului:Paraziți intestinali:2,7,8:", "Dureri abdominale moderate până la severe care se pot răspândi la spate:Pancreatită:1,3,4:", "Dureri severe de stomac:Ulcer gastric:6,7,8:", "Durere bruscă care începe în partea dreaptă a abdomenului inferior:Apendicită:0,3,7:", "Greață sau tulburări de stomac recurente:Gastrită:4,2,1:", "Mâncărime extremă în jurul anusului:Hemoroizi:0,2,3:", "Durere sau senzație de arsură în timpul urinării:Pietre la rinichi:3,9,1:", "Îngălbenirea pielii și a albului ochilor:Ciroză:7,5,4:", "Sânge în scaun:Boala Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["dureri articulare:Artrită:1,2,3:", "durere imediată, puternică:Fractură osoasă:2,3:", "Pierderea înălțimii în timp:Osteoporoza:1,3,4:", "o coloană vertebrală vizibil curbată:scolioza:0,1,2:", "piele roșie, strălucitoare peste articulația afectată:Gută:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Mușchi mari ale gambei:distrofie musculara:2,3,4:", "Un braț sau un picior este mai mic decât celălalt:atrofie musculară:2,3,4:", "durere la un tendon care se agravează atunci când vă mișcați:tendinita:1,3,4:", "O durere bruscă, ascuțită:crampe musculare:1,2:", "durere bruscă care se agravează în timpul contractării mușchiului:ruptură musculară:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Umflarea nedureroasă a ganglionilor limfatici la nivelul gâtului, axilelor sau inghinală:Limfom:2,3:", "Ganglioni limfatici umflați, ficatul sau splina mărite:leucemie:2,3:", "Tremurând:Hipotermie:0,1:", "Amorțeală sau slăbiciune în brațe sau picioare:Ateroscleroza:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Febră ridicată bruscă, cefalee severă care pare diferită de normal:Meningita:1,2,3:", "orbire la un ochi:Scleroză multiplă:0,3,4:", "Tremor în mâini:boala Parkinson:0,3,4:", "ticuri de mișcare:sindromul Tourette:0,1,4:", "dificultăți de concentrare și pierderi de memorie:boala Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Gingii roșii sau umflate:Parodontita:2,3,4:", "Gingii roșii sau umflate:gingivita:2,3,4:", "Durere de dinţi:Carie dentară:0,4,3:", "probleme la înghițire:Amigdalită:0,2,4:", "Deformări ale maxilarului superior:Buza despicată:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["lichid care se scurge din ureche:Otita:1,2,3:", "Pierderea auzului:Surditate:0,2,3:", "un zgomot în urechi:Tinitus:0,1,3:", "vertij:boala Meniere:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Vedere tulbure:Cataractă:1,2,3:", "Culoare roz sau roșie în albul ochiului:Conjunctivită:0,2,3:", "durere oculară intensă:Glaucom:0,1,3:", "Percepție slabă a profunzimii și vedere periferică:Ambliopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Un nou nodul la sân sau la subrat:Cancer mamar:1,2,3:", "Sânge în urină:Cancer de prostată:2,3,4:", "O schimbare a obiceiurilor intestinale:Cancer colorectal:1,3,4:", "o tuse care nu dispare după 2 sau 3 săptămâni:Cancer de plamani:1,2,4:", "O aluniță care își schimbă culoarea, dimensiunea sau care sângerează:Cancer de piele:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Culoare albăstruie în piele, unghii și buze:Hipoxemie:1,2,3:", "Tremurări în mâini, față și picioare:Hipocalcemie:0,2,4:", "Urinări mai frecvente și sete:Hipercalcemie:0,1:", "slăbirea oaselor:hipofosfatemie:0,4:", "crampe sau spasme musculare:Hiperfosfatemia:0,1:"]);
  }

  void addRU(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.ru;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Печень:1,2,3:29.2,45", "Рот:4,2,9:28.1,81.6", "Пищевод:1,8,5:48.6,58.6", "Толстая кишка:4,2,6:20.5,21", "Тонкая кишка:8,7,1:52.4,19", "Желудок:4,6,7:66,41", "Глотка:5,2,9:48.6,81", "Желчный:6,9,4:31.3,39.6", "Поджелудочная:2,1,0:50,35.1", "Аппендикс человека:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Череп:11,8,6:48,97", "Лопатка:5,4,3:61.1,80.2", "Ребра:11,7,0:56,74.1", "Позвоночник:8,10,1:45.9,65.2", "Голень:5,9,3:51.4,23.6", "Бедро:4,10,7:54.9,35.5", "Плечевая кость:2,7,9:69.1,66.2", "Пястные кости:6,0,1:81.3,44.8", "Кистевые кости:5,4,2:77.1,48.7", "Предплюсна:4,3,1:49.3,6.9", "плюсневые кости:0,3,5:54.2,2.8", "Таз:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["дельтовидных:4,1,5:65.3,80.2", "Бицепс:5,0,4:67.3,71.5", "Грудная мышца:5,0,4:52.5,76.4", "Трапециевидная:1,5,4:51.4,85.5", "Наружная косая мышца живота:1,5,0:54.2,65.9", "Передняя большеберцовая мышца:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Сердце:4,2,5:65.3,73", "Аорта:4,2,5:62.9,77.6", "Почечные вены:0,4,5:57.3,59.1", "Почечная артерия:0,5,4:61.5,59.1", "Яремная вена:0,2,5:60.4,86.1", "Бедренная вена:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Мозг:5,4,3:50.4,96.8", "Мозжечок:5,4,3:56,92.6", "Спинной мозг:0,4,3:50.7,86.8", "седалищный нерв:0,4,5:59.4,37.6", "большеберцовый нерв:1,5,3:61.1,19.4", "Ганглий:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Губы:1,2,4:61.4,96.6", "Язычок:6,2,0:48.6,51.8", "Моляры:0,6,1:76.1,33", "Резцы:0,4,1:50.4,83", "Язык:7,2,0:48.2,27.6", "миндалин:4,0,6:69.5,46.8", "Твердое небо:1,2,0:48.6,73.8", "Мягкое небо:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Лобная доля:1,2,4:25,58.5", "Височная доля:0,2,3:51.2,42.2", "Теменная доля:0,1,3:66,69", "Затылочная доля:0,1,2:91,46", "Мозжечок:1,2,0:72.8,26.1", "ствола мозга:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Ушная раковина:1,2,4:8,31", "Ушной канал:0,2,6:33.5,42.1", "Ушной барабан:1,5,6:55.6,42", "Слуховые косточки:1,0,6:54.3,52.9", "Улитка:6,1,5:75.8,45.7", "Слуховой нерв:6,2,1:91.8,48", "Евстахиева труба:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Аорта:8,6,3:51.7,84.7", "Верхняя полая вена:6,7,4:27.3,92", "Нижняя полая вена:1,4,3:27.8,6.8", "Правое предсердие:4,7,0:31,54.4", "Левое предсердие:7,6,0:59.6,55.5", "Митральный клапан:8,2,0:69.5,43.7", "Правый желудочек:0,1,3:47.8,38.9", "Левый желудочек:1,8,3:58.1,43", "Трикуспидальный клапан:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["радужная оболочка:6,3,4:11.3,57", "Роговица:2,6,4:1.7,50.5", "хрусталик:1,4,6:19,51.3", "сетчатка:1,6,4:64.6,76.8", "Зрительный нерв:0,6,3:87.9,36.2", "Передняя камера:6,4,3:7.2,51.4", "Стекловидное тело:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Ядро:5,3,2:57.3,75.5", "Ядрышко:2,6,4:44.5,67.9,8", "Цитоплазма:1,4,6:93.08,50.09,9", "Клеточная мембрана:2,5,1:90,24,14", "Рибосома:2,1,3:80.929,75.844,14", "Митохондрия:1,2,3:51.4,90.35,18", "Эндоплазматическая сеть:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Кислород:1,2,4:74.5,29,25", "Углерод:2,0,4:74.5,57,25", "Водород:1,0,5:74.5,73.2,25", "Азот:1,0,2:74.5,83.5,25", "Кальций:0,1,2:74.5,91.2,25", "Фосфор:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Какой орган вырабатывает желчь, необходимую для пищеварения?:0,7,6,8", "Какой первый отдел пищеварительного тракта принимает пищу и выделяет слюну?:1,2,6,5", "Через какой орган пища попадает из глотки в желудок?:2,6,9,7", "Какой орган является последней частью пищеварительной системы?:3,4,7,8", "Где происходит наибольшее усвоение питательных веществ и минералов из пищи?:4,5,3,0", "Какой орган выделяет пищеварительные ферменты и желудочную кислоту, способствующие перевариванию пищи?:5,4,7,3", "Как называется часть глотки за ротовой и носовой полостью?:6,2,9,8", "Где хранится и концентрируется желчь перед попаданием в тонкую кишку?:7,6,9,8", "Откуда секретируется инсулин?:8,0,7,6", "Какой орган расположен в нижней правой части живота?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Какая костная структура образует голову?:0,1,9,7", "Что еще называют плечевой костью?:1,9,11,6", "Что представляет собой полужесткая костно-хрящевая структура, окружающая грудную полость?:2,7,8,11", "Что является определяющим признаком позвоночных?:3,0,11,2", "Какая из двух костей в ноге ниже колена больше?:4,6,9,5", "Какая самая длинная и крепкая кость в вашем теле?:5,6,9,1", "Что такое длинная кость в руке, которая проходит от плеча до локтя?:6,5,1,7", "Что представляет собой группа из пяти костей кисти между фалангами и запястьем?:7,5,1,3", "Какие кости образуют запястье?:8,7,9,10", "Что представляет собой группа из семи сочленяющихся костей в каждой стопе?:9,7,8,1", "Что представляет собой группа из пяти длинных костей стопы?:10,8,7,4", "Что такое нижняя часть туловища?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Какая мышца образует округлый контур плеча человека?:0,1,3,5", "Какая большая мышца лежит на передней поверхности плеча между плечом и локтем?:1,0,2,3", "Какая мышца расположена на груди человека?:2,3,5,1", "Какая треугольная мышца расположена на задней стороне шеи?:3,1,2,5", "Какая мышца является самой большой из боковых мышц живота?:4,1,2,0", "Какая из четырех мышц передней поверхности голени самая крупная?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Какой мышечный орган перекачивает кровь по кровеносным сосудам кровеносной системы?:0,1,3,5", "Какая главная и самая большая артерия в организме человека?:1,4,3,2", "Какие вены дренируют почки?:2,5,4,1", "Какие парные артерии снабжают кровью почки?:3,2,1,5", "Какие вены несут деоксигенированную кровь от головы обратно к сердцу?:4,2,5,1", "Какая крупная вена расположена глубоко в бедре?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Какой орган является центром нервной системы?:0,1,2,5", "Что является главной особенностью заднего мозга всех позвоночных?:1,5,0,2", "Что представляет собой длинная тонкая трубчатая структура, состоящая из нервной ткани?:2,1,3,4", "Какой крупный нерв проходит рядом с тазобедренным суставом?:3,2,1,5", "Что такое ветвь седалищного нерва?:4,5,2,1", "Что представляет собой группа тел нейронов периферической нервной системы?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Какие мышечные складки окружают рот?:0,1,4,7", "Что такое мясистое расширение, которое висит над горлом?:1,4,0,7", "Что такое плоские зубы в задней части рта?:2,3,5,6", "Какие передние зубы?:3,2,5,6", "Что такое мышечный орган во рту?:4,5,6,1", "Какие органы играют важную роль в иммунной системе?:5,1,4,0", "Что представляет собой тонкая горизонтальная костная пластинка, образованная двумя костями лицевого скелета?:6,7,2,5", "Из каких мягких тканей состоит задняя стенка нёба?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Какая из четырех основных долей головного мозга самая большая?:0,3,1,4", "Что находится за ушами и является второй по величине долей?:1,0,3,2", "Что участвует в восприятии ощущений, включая прикосновение, температуру, боль?:2,0,3,5", "Что такое визуальный центр обработки мозга?:3,0,1,4", "Что играет важную роль в контроле баланса?:4,5,0,1", "Что помогает контролировать частоту сердечных сокращений и частоту дыхания?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Какая видимая часть уха находится вне головы?:0,3,6,2", "Что представляет собой путь, идущий от наружного уха к среднему уху?:1,2,3,0", "Что такое тонкий лоскут кожи, который туго натянут, как барабан, и вибрирует, когда на него попадает звук?:2,0,5,3", "Какие три кости среднего уха относятся к числу самых маленьких костей человеческого тела?:3,0,6,2", "Что напоминает раковину улитки?:4,2,0,6", "Что несет слуховую сенсорную информацию от улитки внутреннего уха непосредственно в мозг?:5,2,0,6", "Что еще называют слуховой трубой?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Какая главная и самая крупная артерия в организме человека?:0,3,8,6", "Какая вена несет кровь от головы, шеи, рук и груди обратно к сердцу?:1,3,0,2", "Какая вена несет кровь от нижней части тела обратно к сердцу?:2,1,0,3", "Через какую верхнюю камеру поступает кровь в желудочки сердца?:3,5,6,2", "в какую камеру сердца поступает насыщенная кислородом кровь из легких?:4,3,6,8", "Какой клапан разделяет две камеры левой половины сердца?:5,8,7,3", "Что такое мышечная камера, перекачивающая кровь из сердца в кровеносную систему?:6,5,8,2", "Какая из четырех камер сердца является одной?:7,0,1,2", "Его роль заключается в предотвращении обратного тока крови из правого желудочка в правое предсердие.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Какая тонкая структура в глазу отвечает за контроль диаметра и размера зрачка?:0,1,3,2", "Что представляет собой прозрачная передняя часть глаза, закрывающая радужную оболочку?:1,2,3,0", "Какая прозрачная структура в глазу помогает преломлять свет и фокусироваться на сетчатке?:2,3,0,1", "Какой самый внутренний светочувствительный слой ткани глаза?:3,1,0,2", "Что передает зрительную информацию от сетчатки к мозгу?:4,6,5,3", "Что находится в передней части глаза между роговицей и радужкой?:5,6,2,3", "Какая камера глаза расположена за хрусталиком и перед зрительным нервом?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Что находится в середине клетки и содержит ДНК, расположенную в хромосомах?:0,1,2,3", "Какая область внутри клетки отвечает за образование клеточных рибосом?:1,2,3,4", "Что представляет собой студенистая жидкость, заполняющая внутреннюю часть клетки?:2,3,4,5", "Что защищает клетку от внешней среды?:3,4,2,1", "Какая клеточная структура вырабатывает белок?:4,3,2,1", "Что преобразует химическую энергию в форму энергии, которую может использовать клетка?:5,4,3,2", "Какова транспортная система эукариотической клетки?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Что используется для окисления нашей пищи в процессе клеточного дыхания с выделением энергии?:0,1,2,3", "Какой элемент является вторым по распространенности в организме человека?:1,2,3,4", "Что используется для обезвоживания организма человека?:2,3,4,5", "Что используется для производства аминокислот в нашем организме, которые, в свою очередь, производят белки?:3,5,4", "Что используется для построения и поддержания крепких костей?:4,0,1,2", "Что используется при формировании костей и зубов?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["При каком заболевании воспаляется печень?:Гепатит::", "При каком заболевании паразит поражает желудочно-кишечный тракт человека?:Кишечные паразиты::", "При каком заболевании воспаляется поджелудочная железа?:панкреатит::", "Какое заболевание вызывает разрыв внутренней оболочки желудка?:Язва желудка::", "При каком заболевании воспаляется аппендикс?:Аппендицит::", "При каком заболевании воспаляется внутренняя оболочка желудка?:Гастрит::", "Какое заболевание вызывает вздутие вен в нижней части прямой кишки?:Геморрой::", "Что представляют собой твердые отложения, состоящие из минералов и солей?:Камни в почках::", "Что такое рубцевание печени, вызванное длительным повреждением печени?:Цирроз печени::", "Что такое воспалительное заболевание кишечника?:болезнь Крона::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Какое заболевание вызывает боль и воспаление в суставе?:Артрит::", "Что такое нарушение непрерывности кости?:Трещина в кости::", "Какая болезнь ослабляет кости, делая их хрупкими и более склонными к переломам?:Остеопороз::", "Какое заболевание вызывает боковое искривление позвоночника?:Сколиоз::", "Какой тип артрита вызывает внезапную сильную боль в суставах?:Подагра::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Какое заболевание вызывает прогрессирующую слабость и потерю мышечной массы?:мышечная дистрофия::", "Какое заболевание возникает при недостатке физической активности?:мышечная атрофия::", "Какое заболевание вызывает воспаление или раздражение сухожилия?:тендинит::", "Что такое внезапное и непроизвольное сокращение одной из ваших мышц?:мышечные спазмы::", "Что происходит, когда ваши мышцы перенапрягаются или рвутся?:разрыв мышцы::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Какой тип рака начинается в клетках, которые являются частью иммунной системы организма?:лимфома::", "Какой тип рака обычно начинается в костном мозге?:Лейкемия::", "К чему приводит длительное воздействие очень низких температур?:Гипотермия::", "Что такое затвердение артерий, вызванное постепенным накоплением бляшек?:Атеросклероз::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Что такое острое воспаление защитных оболочек, покрывающих головной и спинной мозг?:Менингит::", "Какое заболевание может повлиять на головной и спинной мозг и вызвать проблемы со зрением, равновесием, контролем мышц?:Рассеянный склероз::", "Что такое расстройство головного мозга, которое приводит к дрожи, скованности и трудностям при ходьбе, равновесии и координации?:болезнь Паркинсона::", "Для чего характерны множественные двигательные тики и хотя бы один вокальный тик?:синдром Туретта::", "Что такое неизлечимое наследственное заболевание головного мозга, которое повреждает клетки мозга?:Болезнь Хантингтона::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Что такое серьезная инфекция десен, которая повреждает мягкие ткани и может разрушить кость, поддерживающую зубы?:пародонтит::", "Какая легкая форма заболевания десен вызывает раздражение, покраснение и отек десен?:гингивит::", "Каковы постоянно поврежденные участки на твердой поверхности ваших зубов?:Кариес::", "Что такое инфекция миндалин в задней части горла?:Тонзиллит::", "Что произойдет, если ткань, из которой состоит губа, не срастется полностью до рождения?:Заячья губа::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Какое расстройство мозга разрушает память и мыслительные способности, а в конечном итоге и способность выполнять простейшие задачи?:Болезнь Альцгеймера::", "Что такое необычное, но серьезное состояние, при котором воспаляется мозг?:Энцефалит::", "Что такое головная боль, характеризующаяся повторяющимися головными болями от умеренной до сильной?:Мигрень::", "Какое заболевание поражает головной мозг и вызывает частые припадки?:эпилепсия::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Что происходит, когда вирус или бактерия вызывают воспаление области за барабанной перепонкой?:Отит::", "Что относится к полной или частичной неспособности слышать звуки?:Глухота::", "В каком состоянии вы слышите звуки, когда нет внешнего источника звуков?:шум в ушах::", "Какое заболевание внутреннего уха может привести к приступам головокружения (вертиго) и потере слуха?:Болезнь Меньера::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Что такое боль в груди, вызванная уменьшением притока крови к сердечной мышце?:Стенокардия::", "Что такое артериальное давление выше нормы?:Гипертония::", "Что происходит, когда уменьшается или прекращается приток крови к коронарной артерии сердца?:Инфаркт миокарда::", "Что такое серьезное состояние, при котором сердце перекачивает кровь не так эффективно, как должно?:Хроническая сердечная недостаточность::", "Каким словом обозначают высокий уровень холестерина в крови?:гиперхолестеринемия::", "Что такое нарушение сердечного ритма?:Аритмия::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Что такое помутнение хрусталика глаза, приводящее к снижению зрения?:Катаракта::", "Какое заболевание глаз вызвано инфекцией или аллергией?:Конъюнктивит::", "При каком заболевании глаз повреждается зрительный нерв, соединяющий глаз с мозгом?:Глаукома::", "Что такое расстройство зрения, при котором мозг не может полностью обрабатывать входные данные от одного глаза и со временем отдает предпочтение другому глазу?:амблиопия::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Какой тип рака может включать опухоль в груди или изменение формы груди?:Рак молочной железы::", "Какой самый распространенный тип рака поражает только мужчин?:Рак простаты::", "При каком типе рака клетки в толстой или прямой кишке разрастаются бесконтрольно?:Колоректальный рак::", "Какой тип рака вызывается длительным курением табака?:Рак легких::", "Какой тип рака вызывается чрезмерным воздействием ультрафиолетовых лучей солнца?:Рак кожи::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Как называется пониженный уровень кислорода в крови, особенно в артериях?:гипоксемия::", "Как называется пониженный уровень кальция в крови?:Гипокальциемия::", "Как называется превышение нормы кальция в крови?:Гиперкальциемия::", "Как называется пониженный уровень фосфатов в крови?:гипофосфатемия::", "Как называется повышенный уровень фосфатов в крови?:Гиперфосфатемия::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Пожелтение кожи и белков глаз:Гепатит:3,4,5:", "Сыпь или зуд вокруг прямой кишки:Кишечные паразиты:2,7,8:", "Умеренная или сильная боль в животе, которая может распространяться на спину.:панкреатит:1,3,4:", "Сильная боль в желудке:Язва желудка:6,7,8:", "Внезапная боль, которая начинается с правой стороны нижней части живота:Аппендицит:0,3,7:", "Тошнота или повторяющееся расстройство желудка:Гастрит:4,2,1:", "Сильный зуд вокруг ануса:Геморрой:0,2,3:", "Боль или жжение во время мочеиспускания:Камни в почках:3,9,1:", "Пожелтение кожи и белков глаз:Цирроз печени:7,5,4:", "Кровь в стуле:болезнь Крона:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["боль в суставах:Артрит:1,2,3:", "немедленная, сильная боль:Трещина в кости:2,3:", "Потеря высоты со временем:Остеопороз:1,3,4:", "заметно изогнутый позвоночник:Сколиоз:0,1,2:", "красная, блестящая кожа над пораженным суставом:Подагра:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Большие икроножные мышцы:мышечная дистрофия:2,3,4:", "Одна рука или одна нога меньше другой:мышечная атрофия:2,3,4:", "боль в сухожилии, которая усиливается при движении:тендинит:1,3,4:", "Внезапная острая боль:мышечные спазмы:1,2:", "внезапная боль, которая усиливается при сокращении мышцы:разрыв мышцы:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Безболезненное увеличение лимфатических узлов на шее, в подмышечных впадинах или в паху:лимфома:2,3:", "Опухшие лимфатические узлы, увеличенная печень или селезенка:Лейкемия:2,3:", "Дрожь:Гипотермия:0,1:", "Онемение или слабость в руках или ногах:Атеросклероз:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Внезапная высокая температура, сильная головная боль, которая кажется отличной от нормальной:Менингит:1,2,3:", "слепота на один глаз:Рассеянный склероз:0,3,4:", "Тремор в руках:болезнь Паркинсона:0,3,4:", "двигательные тики:синдром Туретта:0,1,4:", "трудности с концентрацией внимания и провалы в памяти:Болезнь Хантингтона:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Красные или опухшие десны:пародонтит:2,3,4:", "Красные или опухшие десны:гингивит:2,3,4:", "Зубная боль:Кариес:0,4,3:", "проблемы с глотанием:Тонзиллит:0,2,4:", "Деформации верхней челюсти:Заячья губа:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["жидкость, вытекающая из уха:Отит:1,2,3:", "Потеря слуха:Глухота:0,2,3:", "звон в ушах:шум в ушах:0,1,3:", "головокружение:Болезнь Меньера:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Затуманенное зрение:Катаракта:1,2,3:", "Розовый или красный цвет белка глаза:Конъюнктивит:0,2,3:", "сильная боль в глазах:Глаукома:0,1,3:", "Плохое восприятие глубины и периферийное зрение:амблиопия:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Новая шишка в груди или подмышкой:Рак молочной железы:1,2,3:", "Кровь в моче:Рак простаты:2,3,4:", "Изменение привычек кишечника:Колоректальный рак:1,3,4:", "кашель, который не проходит через 2 или 3 недели:Рак легких:1,2,4:", "Родинка, которая меняет цвет, размер или кровоточит:Рак кожи:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Голубоватый цвет кожи, ногтей и губ:гипоксемия:1,2,3:", "Подергивания в руках, лице и ногах:Гипокальциемия:0,2,4:", "Более частое мочеиспускание и жажда:Гиперкальциемия:0,1:", "ослабление костей:гипофосфатемия:0,4:", "мышечные судороги или спазмы:Гиперфосфатемия:0,1:"]);
  }

  void addSK(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.sk;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Pečeň:1,2,3:29.2,45", "Ústna dutina:4,2,9:28.1,81.6", "pažerák:1,8,5:48.6,58.6", "hrubé črevo:4,2,6:20.5,21", "Tenké črevo:8,7,1:52.4,19", "Žalúdok:4,6,7:66,41", "Hltan:5,2,9:48.6,81", "žlčníka:6,9,4:31.3,39.6", "Pankreas:2,1,0:50,35.1", "slepého čreva:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Lebka:11,8,6:48,97", "Lopatka:5,4,3:61.1,80.2", "Rebrá:11,7,0:56,74.1", "Chrbtica:8,10,1:45.9,65.2", "holenná kosť:5,9,3:51.4,23.6", "stehennej:4,10,7:54.9,35.5", "Ramenná kosť:2,7,9:69.1,66.2", "Záprstná kosť:6,0,1:81.3,44.8", "Karpálne kosti:5,4,2:77.1,48.7", "dechtové kosti:4,3,1:49.3,6.9", "Metatarzálne kosti:0,3,5:54.2,2.8", "Panva:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["deltový sval:4,1,5:65.3,80.2", "bicepsový sval:5,0,4:67.3,71.5", "Prsný sval:5,0,4:52.5,76.4", "Lichobežníkový sval:1,5,4:51.4,85.5", "Vonkajší šikmý sval brucha:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Srdce:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Renálne žily:0,4,5:57.3,59.1", "Renálna artéria:0,5,4:61.5,59.1", "Hrdlová žila:0,2,5:60.4,86.1", "Femorálna žila:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Mozog:5,4,3:50.4,96.8", "Mozoček:5,4,3:56,92.6", "Miecha:0,4,3:50.7,86.8", "sedací nerv:0,4,5:59.4,37.6", "Tibiálny nerv:1,5,3:61.1,19.4", "zhluk nervových buniek:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Pery:1,2,4:61.4,96.6", "uvula:6,2,0:48.6,51.8", "Stolička:0,6,1:76.1,33", "Rezáky zubov:0,4,1:50.4,83", "Jazyk:7,2,0:48.2,27.6", "Mandle:4,0,6:69.5,46.8", "Tvrdé poschodie:1,2,0:48.6,73.8", "mäkké poschodie:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Predný lalok:1,2,4:25,58.5", "Časový lalok:0,2,3:51.2,42.2", "Parietálny lalok:0,1,3:66,69", "týlny lalok:0,1,2:91,46", "Mozoček:1,2,0:72.8,26.1", "Mozgový kmeň:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Ušnica:1,2,4:8,31", "Ušný kanál:0,2,6:33.5,42.1", "Ušný bubon:1,5,6:55.6,42", "Sluchové kostičky:1,0,6:54.3,52.9", "Slimák:6,1,5:75.8,45.7", "Sluchový nerv:6,2,1:91.8,48", "Eustachova trubica:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "horná dutá žila:6,7,4:27.3,92", "Dolná dutá žila:1,4,3:27.8,6.8", "Pravá predsieň:4,7,0:31,54.4", "Ľavé predsieň:7,6,0:59.6,55.5", "Mitrálny ventil:8,2,0:69.5,43.7", "Pravá komora:0,1,3:47.8,38.9", "Ľavá komora:1,8,3:58.1,43", "Trikuspidálny ventil:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["dúhovka:6,3,4:11.3,57", "Rohovka:2,6,4:1.7,50.5", "Šošovka:1,4,6:19,51.3", "sietnica:1,6,4:64.6,76.8", "Očný nerv:0,6,3:87.9,36.2", "Predná komora:6,4,3:7.2,51.4", "Sklovec:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Jadro:5,3,2:57.3,75.5", "Jadierko:2,6,4:44.5,67.9,8", "Cytoplazma:1,4,6:93.08,50.09,9", "Bunková membrána:2,5,1:90,24,14", "Ribozóm:2,1,3:80.929,75.844,14", "Mitochondria:1,2,3:51.4,90.35,18", "Endoplazmatické retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Kyslík:1,2,4:74.5,29,25", "Uhlík:2,0,4:74.5,57,25", "Vodík:1,0,5:74.5,73.2,25", "Dusík:1,0,2:74.5,83.5,25", "Vápnik:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Ktorý orgán produkuje žlč potrebnú na trávenie?:0,7,6,8", "Ktorá je prvá časť tráviaceho traktu, ktorá prijíma potravu a produkuje sliny?:1,2,6,5", "Cez ktorý orgán prechádza potrava z hltana do žalúdka?:2,6,9,7", "Ktorý orgán je poslednou časťou tráviaceho systému?:3,4,7,8", "Kde sa najviac vstrebáva živín a minerálov z potravy?:4,5,3,0", "Ktorý orgán vylučuje tráviace enzýmy a žalúdočnú kyselinu na pomoc pri trávení potravy?:5,4,7,3", "Ako sa nazýva časť hrdla za ústami a nosovou dutinou?:6,2,9,8", "Kde sa skladuje a koncentruje žlč, kým sa uvoľní do tenkého čreva?:7,6,9,8", "Odkiaľ sa inzulín vylučuje?:8,0,7,6", "Aký orgán sa nachádza v pravej dolnej časti brucha?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Čo je to kostná štruktúra, ktorá tvorí hlavu?:0,1,9,7", "Čo je známe aj ako ramenná kosť?:1,9,11,6", "Čo je to polotuhá kostná a chrupavková štruktúra, ktorá obklopuje hrudnú dutinu?:2,7,8,11", "Aká je charakteristická vlastnosť stavovca?:3,0,11,2", "Aká je väčšia z dvoch kostí na nohe pod kolenom?:4,6,9,5", "Aká je najdlhšia a najsilnejšia kosť vo vašom tele?:5,6,9,1", "Čo je to dlhá kosť v paži, ktorá sa tiahne od ramena k lakťu?:6,5,1,7", "Čo je to skupina piatich kostí ruky medzi falangami a zápästím?:7,5,1,3", "Aké kosti tvoria zápästie?:8,7,9,10", "Čo je to zhluk siedmich kĺbových kostí na každom chodidle?:9,7,8,1", "Čo je to skupina piatich dlhých kostí na chodidle?:10,8,7,4", "Čo je spodná časť trupu?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Aký je sval tvoriaci zaoblený obrys ľudského ramena?:0,1,3,5", "Čo je veľký sval, ktorý leží na prednej časti nadlaktia medzi ramenom a lakťom?:1,0,2,3", "Aký sval sa nachádza na hrudi ľudského tela?:2,3,5,1", "Čo je trojuholníkový sval umiestnený na zadnej strane krku?:3,1,2,5", "Ktorý sval je najväčší z bočných brušných svalov?:4,1,2,0", "Aký je najväčší zo 4 svalov v prednom oddelení nohy?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Čo je to svalový orgán, ktorý pumpuje krv cez cievy obehového systému?:0,1,3,5", "Aká je hlavná a najväčšia tepna v ľudskom tele?:1,4,3,2", "Čo sú to žily, ktoré odvádzajú obličky?:2,5,4,1", "Čo sú to párové tepny, ktoré zásobujú obličky krvou?:3,2,1,5", "Čo sú to žily, ktoré odvádzajú odkysličenú krv z hlavy späť do srdca?:4,2,5,1", "Čo je to veľká žila nachádzajúca sa hlboko v stehne?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Čo je orgán, ktorý slúži ako centrum nervového systému?:0,1,2,5", "Čo je hlavnou črtou zadného mozgu všetkých stavovcov?:1,5,0,2", "Čo je dlhá, tenká, rúrkovitá štruktúra tvorená nervovým tkanivom?:2,1,3,4", "Čo je veľký nerv, ktorý vedie popri bedrovom kĺbe?:3,2,1,5", "Čo je to vetva sedacieho nervu?:4,5,2,1", "Čo je to skupina tiel neurónových buniek v periférnom nervovom systéme?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Čo sú to svalové záhyby, ktoré obopínajú ústa?:0,1,4,7", "Čo je to mäsitý nástavec, ktorý visí nad hrdlom?:1,4,0,7", "Čo sú ploché zuby v zadnej časti úst?:2,3,5,6", "Aké sú predné zuby?:3,2,5,6", "Čo je to svalový orgán v ústach?:4,5,6,1", "Ktoré orgány hrajú dôležitú úlohu v imunitnom systéme?:5,1,4,0", "Čo je tenká horizontálna kostená platnička zložená z dvoch kostí tvárového skeletu?:6,7,2,5", "Čo je mäkké tkanivo tvoriace zadnú časť strechy úst?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Aký je najväčší zo štyroch hlavných lalokov mozgu?:0,3,1,4", "Čo sedí za ušami a je druhý najväčší lalok?:1,0,3,2", "Čo sa podieľa na vnímaní pocitov, vrátane dotyku, teploty, bolesti?:2,0,3,5", "Čo je centrum vizuálneho spracovania mozgu?:3,0,1,4", "Čo hrá dôležitú úlohu pri kontrole rovnováhy?:4,5,0,1", "Čo pomáha kontrolovať srdcovú frekvenciu a frekvenciu dýchania?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Aká je viditeľná časť ucha, ktorá je mimo hlavy?:0,3,6,2", "Čo je to cesta vedúca z vonkajšieho ucha do stredného ucha?:1,2,3,0", "Čo je to tenká chlopňa kože, ktorá je napnutá ako bubon a vibruje, keď na ňu zasiahne zvuk?:2,0,5,3", "Aké sú tri kosti v strednom uchu, ktoré patria medzi najmenšie kosti v ľudskom tele?:3,0,6,2", "Čo sa podobá na ulitu slimáka?:4,2,0,6", "Čo prenáša sluchové senzorické informácie z kochley vnútorného ucha priamo do mozgu?:5,2,0,6", "Čo je tiež známe ako sluchová trubica?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Aká je hlavná a najväčšia tepna v ľudskom tele?:0,3,8,6", "Ktorá žila vedie krv z vašej hlavy, krku, rúk a hrudníka späť do vášho srdca?:1,3,0,2", "Ktorá žila vedie krv z dolnej časti tela späť do srdca?:2,1,0,3", "Čo je horná komora, cez ktorú krv vstupuje do srdcových komôr?:3,5,6,2", "do ktorej srdcovej komory sa dostáva okysličená krv z pľúc?:4,3,6,8", "Aká chlopňa oddeľuje dve komory ľavej strany srdca?:5,8,7,3", "Čo je to svalová komora, ktorá pumpuje krv zo srdca do obehového systému?:6,5,8,2", "Ktorá je jedna zo štyroch komôr srdca?:7,0,1,2", "Jeho úlohou je zabrániť spätnému toku krvi z pravej komory do pravej predsiene.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Čo je tenká štruktúra oka, ktorá je zodpovedná za kontrolu priemeru a veľkosti zrenice?:0,1,3,2", "Čo je priehľadná predná časť oka, ktorá pokrýva dúhovku?:1,2,3,0", "Čo je priehľadná štruktúra v oku, ktorá pomáha lámať svetlo, aby sa zameralo na sietnicu?:2,3,0,1", "Čo je najvnútornejšia, na svetlo citlivá vrstva tkaniva oka?:3,1,0,2", "Čo prenáša vizuálne informácie zo sietnice do mozgu?:4,6,5,3", "Čo je predná časť oka medzi rohovkou a dúhovkou?:5,6,2,3", "Ktorá očná komora sa nachádza za šošovkou a pred zrakovým nervom?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Čo sa nachádza v strede bunky a obsahuje DNA usporiadanú do chromozómov?:0,1,2,3", "Ktorá oblasť v bunke sa zaoberá produkciou bunkových ribozómov?:1,2,3,4", "Čo je to želatínová kvapalina, ktorá vypĺňa vnútro bunky?:2,3,4,5", "Čo chráni bunku pred vonkajším prostredím?:3,4,2,1", "Čo je bunková štruktúra, ktorá produkuje proteín?:4,3,2,1", "Čo premieňa chemickú energiu na energetickú formu, ktorú môže bunka využiť?:5,4,3,2", "Aký je transportný systém eukaryotickej bunky?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Čo sa používa na oxidáciu našej potravy v procese bunkového dýchania, čím sa uvoľňuje energia?:0,1,2,3", "Aký je druhý najrozšírenejší prvok v ľudskom tele?:1,2,3,4", "Čo sa používa na udržanie hydratácie ľudského tela?:2,3,4,5", "Čo sa používa na tvorbu aminokyselín v našom tele, ktoré zase tvoria bielkoviny?:3,5,4", "Čo sa používa na stavbu a udržanie silných kostí?:4,0,1,2", "Čo sa používa pri tvorbe kostí a zubov?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Čo je to choroba, pri ktorej sa vám zapáli pečeň?:Hepatitída::", "Čo je to choroba, pri ktorej parazit infikuje gastrointestinálny trakt človeka?:Črevné parazity::", "Čo je to choroba, pri ktorej sa vám zapáli pankreas?:Pankreatitída::", "Čo je to choroba, ktorá spôsobuje prerušenie vnútornej výstelky žalúdka?:Žalúdočný vred::", "Čo je to choroba, pri ktorej sa vám zapáli slepé črevo?:Zápal slepého čreva::", "Čo je to choroba, pri ktorej sa vám zapáli vnútorná výstelka žalúdka?:Gastritída::", "Aké ochorenie spôsobuje opuchnuté žily v dolnej časti konečníka?:Hemoroidy::", "Čo sú tvrdé ložiská minerálov a solí?:Obličkové kamene::", "Čo je zjazvenie pečene spôsobené dlhodobým poškodením pečene?:Cirhóza::", "Aký je typ zápalového ochorenia čriev?:Crohnova choroba::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Aké ochorenie spôsobuje bolesť a zápal v kĺbe?:Artritída::", "Čo je to prerušenie kontinuity kosti?:Zlomenina kosti::", "Aké ochorenie oslabuje kosti, robí ich krehkými a častejšie sa lámu?:Osteoporóza::", "Aké ochorenie spôsobuje zakrivenie chrbtice do strán?:Skolióza::", "Aký je typ artritídy, ktorý spôsobuje náhlu, silnú bolesť kĺbov?:Dna::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Aké ochorenie spôsobuje progresívnu slabosť a stratu svalovej hmoty?:svalová dystrofia::", "Aké ochorenie je spôsobené nedostatkom fyzickej aktivity?:svalová atrofia::", "Aké ochorenie spôsobuje zápal alebo podráždenie šľachy?:tendinitída::", "Čo je náhla a mimovoľná kontrakcia jedného z vašich svalov?:svalové kŕče::", "Čo sa stane, keď je váš sval pretiahnutý alebo natrhnutý?:prasknutie svalu::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Aký druh rakoviny začína v bunkách, ktoré sú súčasťou imunitného systému tela?:Lymfóm::", "Aký je typ rakoviny, ktorý zvyčajne začína v kostnej dreni?:leukémia::", "Čo je spôsobené dlhodobým vystavením veľmi nízkym teplotám?:Podchladenie::", "Čo je kôrnatenie vašich tepien spôsobené postupným hromadením plaku?:Ateroskleróza::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Čo je akútny zápal ochranných membrán pokrývajúcich mozog a miechu?:Meningitída::", "Čo je to choroba, ktorá môže postihnúť váš mozog a miechu a môže spôsobiť problémy s videním, rovnováhou, svalovou kontrolou?:Roztrúsená skleróza::", "Čo je to porucha mozgu, ktorá vedie k traseniu, stuhnutiu a ťažkostiam s chôdzou, rovnováhou a koordináciou?:Parkinsonova choroba::", "Čo charakterizujú viaceré pohybové tiky a aspoň jeden vokálny tik?:Tourettov syndróm::", "Čo je to nevyliečiteľná, dedičná porucha mozgu, ktorá poškodzuje mozgové bunky?:Huntingtonova choroba::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Čo je závažná infekcia ďasien, ktorá poškodzuje mäkké tkanivo a môže zničiť kosť, ktorá podopiera vaše zuby?:Paradentóza::", "Čo je mierna forma ochorenia ďasien, ktorá spôsobuje podráždenie, začervenanie a opuch ďasien?:zápal ďasien::", "Čo sú trvalo poškodené oblasti na tvrdom povrchu vašich zubov?:Zubný kaz::", "Čo je infekcia mandlí v zadnej časti hrdla?:Tonzilitída::", "Čo sa stane, ak sa tkanivo, ktoré tvorí peru, pred narodením úplne nespojí?:Rázštep pery::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Aká mozgová porucha ničí pamäť a myslenie a nakoniec aj schopnosť vykonávať tie najjednoduchšie úlohy?:Alzheimerova choroba::", "Čo je nezvyčajný, ale vážny stav, pri ktorom sa zapáli mozog?:encefalitída::", "Čo je porucha hlavy charakterizovaná opakujúcimi sa bolesťami hlavy, ktoré sú stredne ťažké až ťažké?:Migréna::", "Čo je to choroba, ktorá postihuje mozog a spôsobuje časté záchvaty?:Epilepsia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Čo sa stane, keď vírus alebo baktéria spôsobí zápal v oblasti za ušným bubienkom?:Otitis::", "Čo znamená úplnú alebo čiastočnú neschopnosť počuť zvuky?:Hluchota::", "Aký je stav, keď počujete zvuky, keď neexistuje žiadny vonkajší zdroj zvukov?:Tinnitus::", "Čo je to porucha vnútorného ucha, ktorá môže viesť k závratom (vertigo) a strate sluchu?:Meniérova choroba::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Čo je bolesť na hrudníku spôsobená zníženým prietokom krvi do srdcových svalov?:Angína::", "Čo je krvný tlak, ktorý je vyšší ako normálny?:Hypertenzia::", "Čo sa stane, keď sa prietok krvi zníži alebo zastaví do koronárnej tepny srdca?:Infarkt myokardu::", "Čo je vážny stav, pri ktorom srdce nepumpuje krv tak efektívne, ako by malo?:Kongestívne srdcové zlyhanie::", "Aké je slovo pre vysokú hladinu cholesterolu v krvi?:Hypercholesterolémia::", "Čo je to abnormalita srdcového rytmu?:Arytmia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Čo je to zakalená oblasť v šošovke oka, ktorá vedie k zníženiu videnia?:Sivý zákal::", "Čo je očný stav spôsobený infekciou alebo alergiou?:Konjunktivitída::", "Čo je stav oka, pri ktorom sa poškodí zrakový nerv, ktorý spája oko s mozgom?:Glaukóm::", "Čo je to porucha zraku, pri ktorej mozog nedokáže úplne spracovať vstupy z jedného oka a časom uprednostňuje druhé oko?:Amblyopia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Aký je typ rakoviny, ktorý môže zahŕňať hrčku v prsníku alebo zmenu tvaru prsníka?:Rakovina prsníka::", "Aký je najčastejší typ rakoviny, ktorý postihuje iba mužov?:Rakovina prostaty::", "Aký je typ rakoviny, pri ktorej bunky v hrubom čreve alebo konečníku rastú nekontrolovane?:Kolorektálny karcinóm::", "Aký typ rakoviny je spôsobený dlhodobým fajčením tabaku?:Rakovina pľúc::", "Aký typ rakoviny je spôsobený nadmerným vystavením ultrafialovým lúčom zo slnka?:Rakovina kože::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Ako sa nazýva podnormálna hladina kyslíka vo vašej krvi, konkrétne v tepnách?:Hypoxémia::", "Ako sa nazýva podnormálna hladina vápnika vo vašej krvi?:Hypokalciémia::", "Ako sa nazýva nadnormálna hladina vápnika vo vašej krvi?:Hyperkalcémia::", "Ako sa nazýva hladina fosfátu vo vašej krvi pod normálnou hodnotou?:hypofosfatémia::", "Ako sa nazýva nadnormálna hladina fosfátu vo vašej krvi?:Hyperfosfatémia::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Zožltnutie kože a očných bielkov:Hepatitída:3,4,5:", "Vyrážka alebo svrbenie okolo konečníka:Črevné parazity:2,7,8:", "Stredná až silná bolesť brucha, ktorá sa môže rozšíriť do chrbta:Pankreatitída:1,3,4:", "Silná bolesť žalúdka:Žalúdočný vred:6,7,8:", "Náhla bolesť, ktorá začína na pravej strane podbruška:Zápal slepého čreva:0,3,7:", "Nevoľnosť alebo opakujúce sa žalúdočné ťažkosti:Gastritída:4,2,1:", "Extrémne svrbenie okolo konečníka:Hemoroidy:0,2,3:", "Bolesť alebo pocit pálenia pri močení:Obličkové kamene:3,9,1:", "Zožltnutie kože a očných bielkov:Cirhóza:7,5,4:", "Krv v stolici:Crohnova choroba:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["bolesť kĺbov:Artritída:1,2,3:", "okamžitá, silná bolesť:Zlomenina kosti:2,3:", "Strata výšky v priebehu času:Osteoporóza:1,3,4:", "viditeľne zakrivená chrbtica:Skolióza:0,1,2:", "červená, lesklá koža nad postihnutým kĺbom:Dna:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Veľké lýtkové svaly:svalová dystrofia:2,3,4:", "Jedna ruka alebo jedna noha je menšia ako druhá:svalová atrofia:2,3,4:", "bolesť šľachy, ktorá sa pri pohybe zhoršuje:tendinitída:1,3,4:", "Náhla, ostrá bolesť:svalové kŕče:1,2:", "náhla bolesť, ktorá sa zhoršuje pri sťahovaní svalu:prasknutie svalu:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Bezbolestný opuch lymfatických uzlín na krku, v podpazuší alebo v slabinách:Lymfóm:2,3:", "Zdurené lymfatické uzliny, zväčšená pečeň alebo slezina:leukémia:2,3:", "Triaška:Podchladenie:0,1:", "Necitlivosť alebo slabosť v rukách alebo nohách:Ateroskleróza:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Náhla vysoká horúčka, silná bolesť hlavy, ktorá sa zdá byť odlišná od normálu:Meningitída:1,2,3:", "slepota na jedno oko:Roztrúsená skleróza:0,3,4:", "Chvenie v rukách:Parkinsonova choroba:0,3,4:", "pohybové tiky:Tourettov syndróm:0,1,4:", "ťažkosti so sústredením a výpadky pamäte:Huntingtonova choroba:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Červené alebo opuchnuté ďasná:Paradentóza:2,3,4:", "Červené alebo opuchnuté ďasná:zápal ďasien:2,3,4:", "Bolesť zubov:Zubný kaz:0,4,3:", "problémy s prehĺtaním:Tonzilitída:0,2,4:", "Deformácie hornej čeľuste:Rázštep pery:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["tekutina, ktorá odteká z ucha:Otitis:1,2,3:", "Strata sluchu:Hluchota:0,2,3:", "zvonenie v ušiach:Tinnitus:0,1,3:", "vertigo:Meniérova choroba:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Zakalené videnie:Sivý zákal:1,2,3:", "Ružová alebo červená farba v bielku oka:Konjunktivitída:0,2,3:", "intenzívna bolesť očí:Glaukóm:0,1,3:", "Zlé vnímanie hĺbky a periférne videnie:Amblyopia:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Nová hrčka v prsníku alebo v podpazuší:Rakovina prsníka:1,2,3:", "Krv v moči:Rakovina prostaty:2,3,4:", "Zmena v črevných návykoch:Kolorektálny karcinóm:1,3,4:", "kašeľ, ktorý nezmizne po 2 alebo 3 týždňoch:Rakovina pľúc:1,2,4:", "znamienka, ktorý mení farbu, veľkosť alebo krváca:Rakovina kože:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Modrastá farba kože, nechtov a pier:Hypoxémia:1,2,3:", "Trhanie v rukách, tvári a nohách:Hypokalciémia:0,2,4:", "Častejšie močenie a smäd:Hyperkalcémia:0,1:", "oslabenie kostí:hypofosfatémia:0,4:", "svalové kŕče alebo kŕče:Hyperfosfatémia:0,1:"]);
  }

  void addSL(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.sl;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Jetra:1,2,3:29.2,45", "Usta:4,2,9:28.1,81.6", "Požiralnik:1,8,5:48.6,58.6", "Debelega črevesa:4,2,6:20.5,21", "Tanko črevo:8,7,1:52.4,19", "želodec:4,6,7:66,41", "žrelo:5,2,9:48.6,81", "Žolčnika:6,9,4:31.3,39.6", "trebušna slinavka:2,1,0:50,35.1", "Slepič:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Lobanja:11,8,6:48,97", "Lopatica:5,4,3:61.1,80.2", "Rebra:11,7,0:56,74.1", "Hrbtenica:8,10,1:45.9,65.2", "golenica:5,9,3:51.4,23.6", "Stegnenica:4,10,7:54.9,35.5", "Nadlahtnica:2,7,9:69.1,66.2", "Metakarpalne kosti:6,0,1:81.3,44.8", "Karpalne kosti:5,4,2:77.1,48.7", "Nartnica:4,3,1:49.3,6.9", "Metatarzalne kosti:0,3,5:54.2,2.8", "medenica:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltoid:4,1,5:65.3,80.2", "Biceps:5,0,4:67.3,71.5", "Prsni:5,0,4:52.5,76.4", "Trapez:1,5,4:51.4,85.5", "Zunanji poševni trebuh:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Srce:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Ledvične vene:0,4,5:57.3,59.1", "Ledvična arterija:0,5,4:61.5,59.1", "Jugularne vene:0,2,5:60.4,86.1", "Femoralna vena:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["možgani:5,4,3:50.4,96.8", "Mali možgani:5,4,3:56,92.6", "Hrbtenjača:0,4,3:50.7,86.8", "Išijatični živec:0,4,5:59.4,37.6", "Tibialni živec:1,5,3:61.1,19.4", "Ganglij:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["ustnice:1,2,4:61.4,96.6", "Uvula:6,2,0:48.6,51.8", "Kočniki:0,6,1:76.1,33", "Sekalec:0,4,1:50.4,83", "Jezik:7,2,0:48.2,27.6", "Tonzil:4,0,6:69.5,46.8", "Trdo nebo:1,2,0:48.6,73.8", "Mehko nebo:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Čelni reženj:1,2,4:25,58.5", "Temporalni reženj:0,2,3:51.2,42.2", "Parietalni reženj:0,1,3:66,69", "Okcipitalni reženj:0,1,2:91,46", "Mali možgani:1,2,0:72.8,26.1", "Možgansko deblo:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Uho:1,2,4:8,31", "Sluhovod:0,2,6:33.5,42.1", "Bobnič:1,5,6:55.6,42", "Slušna koščica:1,0,6:54.3,52.9", "Slimák:6,1,5:75.8,45.7", "Slušni živec:6,2,1:91.8,48", "Evstahijeva cev:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Superiorna vena cava:6,7,4:27.3,92", "Spodnja vena cava:1,4,3:27.8,6.8", "Desni atrij:4,7,0:31,54.4", "Levi atrij:7,6,0:59.6,55.5", "Mitralna zaklopka:8,2,0:69.5,43.7", "Desni prekat:0,1,3:47.8,38.9", "Levi prekat:1,8,3:58.1,43", "Trikuspidni ventil:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Šarenica:6,3,4:11.3,57", "Roženica:2,6,4:1.7,50.5", "Leča:1,4,6:19,51.3", "Mrežnica:1,6,4:64.6,76.8", "Optični živec:0,6,3:87.9,36.2", "Sprednja komora:6,4,3:7.2,51.4", "Steklena komora:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Jedro:5,3,2:57.3,75.5", "Nukleolus:2,6,4:44.5,67.9,8", "citoplazma:1,4,6:93.08,50.09,9", "Celična membrana:2,5,1:90,24,14", "ribosom:2,1,3:80.929,75.844,14", "mitohondrije:1,2,3:51.4,90.35,18", "Endoplazemski retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Kisik:1,2,4:74.5,29,25", "ogljik:2,0,4:74.5,57,25", "vodik:1,0,5:74.5,73.2,25", "dušik:1,0,2:74.5,83.5,25", "kalcij:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Kateri organ proizvaja žolč, ki je potreben za prebavo?:0,7,6,8", "Kateri je prvi del prebavnega trakta, ki sprejema hrano in proizvaja slino?:1,2,6,5", "Skozi kateri organ hrana prehaja iz žrela v želodec?:2,6,9,7", "Kateri organ je zadnji del prebavnega sistema?:3,4,7,8", "Kje poteka največja absorpcija hranil in mineralov iz hrane?:4,5,3,0", "Kateri organ izloča prebavne encime in želodčno kislino za pomoč pri prebavi hrane?:5,4,7,3", "Kako se imenuje del grla za ustno in nosno votlino?:6,2,9,8", "Kje je shranjen in koncentriran žolč, preden se sprosti v tanko črevo?:7,6,9,8", "Od kod se izloča inzulin?:8,0,7,6", "Kateri organ se nahaja v spodnjem desnem delu trebuha?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Kakšna je struktura kosti, ki tvori glavo?:0,1,9,7", "Kaj je znano tudi kot ramenska kost?:1,9,11,6", "Kaj je poltrda kostna in hrustančna struktura, ki obdaja torakalno votlino?:2,7,8,11", "Kaj je odločilna značilnost vretenčarja?:3,0,11,2", "Katera je večja od dveh kosti v nogi pod kolenom?:4,6,9,5", "Katera je najdaljša in najmočnejša kost v vašem telesu?:5,6,9,1", "Kaj je dolga kost v roki, ki poteka od rame do komolca?:6,5,1,7", "Kaj je skupina petih kosti roke med falangami in zapestjem?:7,5,1,3", "Katere kosti sestavljajo zapestje?:8,7,9,10", "Kaj je skupek sedmih sklepnih kosti v vsakem stopalu?:9,7,8,1", "Kaj je skupina petih dolgih kosti v stopalu?:10,8,7,4", "Kaj je spodnji del trupa?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Kakšna je mišica, ki tvori zaobljeno konturo človeškega ramena?:0,1,3,5", "Kaj je velika mišica, ki leži na sprednji strani nadlakti med ramo in komolcem?:1,0,2,3", "Katera mišica se nahaja na prsnem košu človeškega telesa?:2,3,5,1", "Kaj je trikotna mišica, ki se nahaja na zadnji strani vratu?:3,1,2,5", "Katera mišica je največja od stranskih trebušnih mišic?:4,1,2,0", "Katera je največja od 4 mišic v sprednjem delu noge?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Kaj je mišični organ, ki črpa kri skozi krvne žile cirkulacijskega sistema?:0,1,3,5", "Katera je glavna in največja arterija v človeškem telesu?:1,4,3,2", "Katere so žile, ki odvajajo ledvico?:2,5,4,1", "Katere so parne arterije, ki oskrbujejo ledvice s krvjo?:3,2,1,5", "Katere so vene, ki odvajajo deoksigenirano kri iz glave nazaj v srce?:4,2,5,1", "Kaj je velika vena, ki se nahaja globoko v stegnu?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Kaj je organ, ki služi kot središče živčnega sistema?:0,1,2,5", "Kaj je glavna značilnost zadnjih možganov vseh vretenčarjev?:1,5,0,2", "Kaj je dolga, tanka, cevasta struktura, sestavljena iz živčnega tkiva?:2,1,3,4", "Kaj je velik živec, ki poteka ob kolčnem sklepu?:3,2,1,5", "Kaj je veja ishiadičnega živca?:4,5,2,1", "Kaj je skupina teles nevronskih celic v perifernem živčnem sistemu?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Kaj so mišične gube, ki obkrožajo usta?:0,1,4,7", "Kaj je mesnati podaljšek, ki visi nad grlom?:1,4,0,7", "Kaj so ploski zobje na zadnji strani ust?:2,3,5,6", "Kakšni so sprednji zobje?:3,2,5,6", "Kaj je mišični organ v ustih?:4,5,6,1", "Kateri organi imajo pomembno vlogo v imunskem sistemu?:5,1,4,0", "Kaj je tanka vodoravna kostna plošča, sestavljena iz dveh kosti obraznega skeleta?:6,7,2,5", "Kaj je mehko tkivo, ki sestavlja zadnji del ustne strehe?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Kateri je največji od štirih glavnih možganskih rež?:0,3,1,4", "Kaj sedi za ušesi in je drugi največji reženj?:1,0,3,2", "Kaj je vključeno v zaznavanje občutka, vključno z dotikom, temperaturo, bolečino?:2,0,3,5", "Kaj je center za vizualno obdelavo možganov?:3,0,1,4", "Kaj igra pomembno vlogo pri nadzoru ravnotežja?:4,5,0,1", "Kaj pomaga pri nadzoru srčnega utripa in dihanja?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Kateri je vidni del ušesa, ki je zunaj glave?:0,3,6,2", "Kakšna je pot, ki poteka od zunanjega ušesa do srednjega ušesa?:1,2,3,0", "Kaj je tanek kožni zavihek, ki je tesno napet kot boben in vibrira, ko ga zadene zvok?:2,0,5,3", "Katere so tri kosti v srednjem ušesu, ki so med najmanjšimi kostmi v človeškem telesu?:3,0,6,2", "Kaj spominja na lupino polža?:4,2,0,6", "Kaj prenaša slušne senzorične informacije iz polža notranjega ušesa neposredno v možgane?:5,2,0,6", "Kaj je znano tudi kot slušna cev?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Katera je glavna in največja arterija v človeškem telesu?:0,3,8,6", "Katera vena prenaša kri iz glave, vratu, rok in prsnega koša nazaj v srce?:1,3,0,2", "Katera vena prenaša kri iz spodnjega dela telesa nazaj v srce?:2,1,0,3", "Kaj je zgornja komora, skozi katero kri vstopi v srčne ventrikle?:3,5,6,2", "katera srčna komora prejema oksigenirano kri iz pljuč?:4,3,6,8", "Kateri ventil ločuje dve komori na levi strani srca?:5,8,7,3", "Kaj je mišična komora, ki črpa kri iz srca v obtočilni sistem?:6,5,8,2", "Katera je ena od štirih komor srca?:7,0,1,2", "Njegova vloga je preprečiti povratni pretok krvi iz desnega prekata v desni atrij.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Kaj je tanka struktura v očesu, odgovorna za nadzor premera in velikosti zenice?:0,1,3,2", "Kaj je prozorni sprednji del očesa, ki prekriva šarenico?:1,2,3,0", "Kakšna je prozorna struktura v očesu, ki pomaga lomiti svetlobo, da se osredotoči na mrežnico?:2,3,0,1", "Kaj je najbolj notranja, na svetlobo občutljiva plast očesnega tkiva?:3,1,0,2", "Kaj prenaša vizualne informacije iz mrežnice v možgane?:4,6,5,3", "Kakšen je sprednji del očesa med roženico in šarenico?:5,6,2,3", "Katera očesna komora se nahaja za lečo in pred vidnim živcem?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Kaj se nahaja v sredini celice in vsebuje DNK, razporejeno po kromosomih?:0,1,2,3", "Katera regija v celici se ukvarja s proizvodnjo celičnih ribosomov?:1,2,3,4", "Kaj je želatinasta tekočina, ki napolni notranjost celice?:2,3,4,5", "Kaj ščiti celico pred zunanjim okoljem?:3,4,2,1", "Kakšna je celična struktura, ki proizvaja beljakovine?:4,3,2,1", "Kaj pretvori kemično energijo v obliko energije, ki jo lahko celica uporabi?:5,4,3,2", "Kakšen je transportni sistem evkariontske celice?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Kaj se uporablja za oksidacijo naše hrane v procesu celičnega dihanja in s tem sproščanje energije?:0,1,2,3", "Kateri je drugi najbolj razširjen element v človeškem telesu?:1,2,3,4", "Kaj se uporablja za vzdrževanje hidracije človeškega telesa?:2,3,4,5", "Kaj se uporablja za tvorbo aminokislin v našem telesu, ki posledično tvorijo beljakovine?:3,5,4", "Kaj se uporablja za izgradnjo in vzdrževanje močnih kosti?:4,0,1,2", "Kaj se uporablja pri tvorbi kosti in zob?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Kakšna je bolezen, pri kateri se vaša jetra vnamejo?:Hepatitis::", "Kakšna je bolezen, pri kateri parazit okuži človeški prebavni trakt?:Črevesni paraziti::", "Kakšna je bolezen, pri kateri se trebušna slinavka vname?:Pankreatitis::", "Kakšna je bolezen, ki povzroči zlom notranje sluznice želodca?:Razjeda na želodcu::", "Kakšna je bolezen, pri kateri se vaš slepič vname?:Apendicitis::", "Kakšna je bolezen, pri kateri se vaša notranja sluznica želodca vname?:Gastritis::", "Katera bolezen povzroča otekle žile v spodnjem delu danke?:Hemoroidi::", "Kakšne so trde nahajališča mineralov in soli?:Ledvični kamni::", "Kakšne so brazgotine na jetrih, ki jih povzroča dolgotrajna poškodba jeter?:ciroza::", "Kakšna je vrsta vnetne črevesne bolezni?:Crohnova bolezen::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Katera bolezen povzroča bolečino in vnetje v sklepu?:Artritis::", "Kaj je prekinitev kontinuitete kosti?:Zlom kosti::", "Katera bolezen oslabi kosti, zaradi česar so krhke in se bolj verjetno zlomijo?:Osteoporoza::", "Katera bolezen povzroča stransko ukrivljenost hrbtenice?:skolioza::", "Kakšna je vrsta artritisa, ki povzroča nenadne, hude bolečine v sklepih?:Protin::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Katera bolezen povzroča progresivno šibkost in izgubo mišične mase?:mišična distrofija::", "Katero bolezen povzroča pomanjkanje telesne dejavnosti?:mišična atrofija::", "Katera bolezen povzroča vnetje ali draženje kite?:tendinitis::", "Kaj je nenadno in neprostovoljno krčenje ene od vaših mišic?:mišični krči::", "Kaj se zgodi, ko je vaša mišica prenapeta ali raztrgana?:ruptura mišice::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Kakšna je vrsta raka, ki se začne v celicah, ki so del imunskega sistema telesa?:Limfom::", "Kakšna je vrsta raka, ki se običajno začne v kostnem mozgu?:levkemija::", "Kaj povzroča dolgotrajna izpostavljenost zelo nizkim temperaturam?:hipotermija::", "Kaj je otrdelost vaših arterij zaradi postopnega nabiranja plakov?:Ateroskleroza::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Kaj je akutno vnetje zaščitnih membran, ki prekrivajo možgane in hrbtenjačo?:Meningitis::", "Kakšna je bolezen, ki lahko prizadene vaše možgane in hrbtenjačo ter lahko povzroči težave z vidom, ravnotežjem, nadzorom mišic?:Multipla skleroza::", "Kakšna je možganska motnja, ki vodi v tresenje, togost in težave pri hoji, ravnotežju in koordinaciji?:Parkinsonova bolezen::", "Kaj je značilno za več gibalnih tikov in vsaj en vokalni tik?:Tourettov sindrom::", "Kaj je neozdravljiva, dedna možganska motnja, ki poškoduje možganske celice?:Huntingtonova bolezen::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Kaj je resna okužba dlesni, ki poškoduje mehko tkivo in lahko uniči kost, ki podpira vaše zobe?:Parodontitis::", "Kaj je blaga oblika bolezni dlesni, ki povzroča draženje, pordelost in otekanje dlesni?:gingivitis::", "Kateri so trajno poškodovani predeli na trdi površini vaših zob?:Zobna gniloba::", "Kaj je okužba tonzil na zadnji strani grla?:Tonzilitis::", "Kaj se zgodi, če se tkivo, ki sestavlja ustnico, pred rojstvom ne združi v celoti?:Razcepljena ustnica::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Katera možganska motnja uniči spomin in miselne sposobnosti ter sčasoma zmožnost opravljanja najpreprostejših nalog?:Alzheimerjeva bolezen::", "Kaj je nenavadno, a resno stanje, pri katerem se možgani vnamejo?:Encefalitis::", "Kaj je motnja glavobola, za katero so značilni ponavljajoči se glavoboli, ki so zmerni do hudi?:migrena::", "Kakšna je bolezen, ki prizadene možgane in povzroča pogoste napade?:epilepsija::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Kaj se zgodi, ko virus ali bakterija povzroči vnetje na območju za bobničem?:Otitis::", "Kaj se nanaša na popolno ali delno nezmožnost slišanja zvokov?:Gluhost::", "Kakšno je stanje, v katerem slišite zvoke, ko ni zunanjega vira zvokov?:Tinitus::", "Kakšna je motnja notranjega ušesa, ki lahko povzroči vrtoglavico (vrtoglavica) in izgubo sluha?:Menierejeva bolezen::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Kaj je bolečina v prsnem košu zaradi zmanjšanega pretoka krvi v srčne mišice?:Angina::", "Kaj je krvni tlak, ki je višji od normalnega?:Hipertenzija::", "Kaj se zgodi, ko se pretok krvi v koronarni arteriji srca zmanjša ali ustavi?:Miokardni infarkt::", "Kaj je resno stanje, pri katerem srce ne črpa krvi tako učinkovito, kot bi moralo?:Postopno srčno popuščanje::", "Kaj je beseda za visoko raven holesterola v krvi?:Hiperholesterolemija::", "Kaj je nenormalnost srčnega ritma?:aritmija::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Kaj je motno območje v očesni leči, ki vodi do zmanjšanja vida?:katarakta::", "Kakšno je očesno stanje, ki ga povzroča okužba ali alergija?:Konjunktivitis::", "Kakšno je očesno stanje, pri katerem se poškoduje vidni živec, ki povezuje oko z možgani?:glavkom::", "Kakšna je motnja vida, pri kateri možgani ne uspejo v celoti obdelati vnosov enega očesa in sčasoma dajejo prednost drugemu očesu?:Ambliopija::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Kakšna je vrsta raka, ki lahko vključuje bulo v dojki ali spremembo oblike prsi?:Rak na dojki::", "Katera je najpogostejša vrsta raka, ki prizadene samo moške?:Rak na prostati::", "Kakšna je vrsta raka, pri kateri celice v debelem črevesu ali danki rastejo nenadzorovano?:Rak debelega črevesa in danke::", "Katero vrsto raka povzroča dolgotrajno kajenje tobaka?:Pljučni rak::", "Katero vrsto raka povzroča prekomerna izpostavljenost ultravijoličnim žarkom sonca?:Kožni rak::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Kako se imenuje podnormalna raven kisika v krvi, natančneje v arterijah?:Hipoksemija::", "Kako se imenuje raven kalcija v krvi pod normalno?:Hipokalcemija::", "Kako se imenuje nadnormalna raven kalcija v krvi?:Hiperkalcemija::", "Kako se imenuje raven fosfata v krvi pod normalno?:hipofosfatemija::", "Kako se imenuje nadnormalna raven fosfata v krvi?:Hiperfosfatemija::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Porumenelost kože in belih oči:Hepatitis:3,4,5:", "Izpuščaj ali srbenje okoli rektuma:Črevesni paraziti:2,7,8:", "Zmerne do hude bolečine v trebuhu, ki se lahko razširijo na hrbet:Pankreatitis:1,3,4:", "Hude bolečine v želodcu:Razjeda na želodcu:6,7,8:", "Nenadna bolečina, ki se začne na desni strani spodnjega dela trebuha:Apendicitis:0,3,7:", "Slabost ali ponavljajoče se želodčne motnje:Gastritis:4,2,1:", "Ekstremno srbenje okoli anusa:Hemoroidi:0,2,3:", "Bolečina ali pekoč občutek med uriniranjem:Ledvični kamni:3,9,1:", "Porumenelost kože in belih oči:ciroza:7,5,4:", "Kri v blatu:Crohnova bolezen:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["bolečine v sklepih:Artritis:1,2,3:", "takojšnja, huda bolečina:Zlom kosti:2,3:", "Izguba višine skozi čas:Osteoporoza:1,3,4:", "vidno ukrivljeno hrbtenico:skolioza:0,1,2:", "rdeča, sijoča ​​koža nad prizadetim sklepom:Protin:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Velike mišice teleta:mišična distrofija:2,3,4:", "Ena roka ali ena noga je manjša od druge:mišična atrofija:2,3,4:", "bolečina v tetivi, ki se poslabša, ko se premikate:tendinitis:1,3,4:", "Nenadna, ostra bolečina:mišični krči:1,2:", "nenadna bolečina, ki se poslabša med krčenjem mišice:ruptura mišice:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Neboleče otekanje bezgavk v vratu, pazduhah ali dimljah:Limfom:2,3:", "Otekle bezgavke, povečana jetra ali vranica:levkemija:2,3:", "Drgetanje:hipotermija:0,1:", "Otrplost ali šibkost v rokah ali nogah:Ateroskleroza:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Nenadna visoka vročina, hud glavobol, ki se zdi drugačen od običajnega:Meningitis:1,2,3:", "slepota na eno oko:Multipla skleroza:0,3,4:", "Tremor v rokah:Parkinsonova bolezen:0,3,4:", "gibalni tiki:Tourettov sindrom:0,1,4:", "težave s koncentracijo in izpadi spomina:Huntingtonova bolezen:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Rdeče ali otekle dlesni:Parodontitis:2,3,4:", "Rdeče ali otekle dlesni:gingivitis:2,3,4:", "Zobobol:Zobna gniloba:0,4,3:", "težave pri požiranju:Tonzilitis:0,2,4:", "Deformacije zgornje čeljusti:Razcepljena ustnica:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["tekočina, ki odteka iz ušesa:Otitis:1,2,3:", "Izguba sluha:Gluhost:0,2,3:", "zvonjenje v ušesih:Tinitus:0,1,3:", "vrtoglavica:Menierejeva bolezen:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Zamagljen vid:katarakta:1,2,3:", "Rožnata ali rdeča barva v belini očesa:Konjunktivitis:0,2,3:", "intenzivne bolečine v očeh:glavkom:0,1,3:", "Slabo zaznavanje globine in periferni vid:Ambliopija:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Nova bulica v dojki ali pod pazduho:Rak na dojki:1,2,3:", "Kri v urinu:Rak na prostati:2,3,4:", "Sprememba črevesnih navad:Rak debelega črevesa in danke:1,3,4:", "kašelj, ki ne izgine po 2 ali 3 tednih:Pljučni rak:1,2,4:", "madež, ki spremeni barvo, velikost ali krvavi:Kožni rak:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Modrikasta barva kože, nohtov in ustnic:Hipoksemija:1,2,3:", "Trzanje v rokah, obrazu in nogah:Hipokalcemija:0,2,4:", "Pogostejše uriniranje in žeja:Hiperkalcemija:0,1:", "oslabitev kosti:hipofosfatemija:0,4:", "mišični krči ali krči:Hiperfosfatemija:0,1:"]);
  }

  void addSR(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.sr;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Јетра:1,2,3:29.2,45", "Уста:4,2,9:28.1,81.6", "Езофагус:1,8,5:48.6,58.6", "Дебело црево:4,2,6:20.5,21", "Танко црево:8,7,1:52.4,19", "Стомак:4,6,7:66,41", "Ждрело:5,2,9:48.6,81", "Жучна кеса:6,9,4:31.3,39.6", "Панкреас:2,1,0:50,35.1", "слепо црево:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Лобања:11,8,6:48,97", "Сцапула:5,4,3:61.1,80.2", "Грудни кош:11,7,0:56,74.1", "Кичма:8,10,1:45.9,65.2", "Тибија:5,9,3:51.4,23.6", "Фемур:4,10,7:54.9,35.5", "Хумерус:2,7,9:69.1,66.2", "Метакарпалне кости:6,0,1:81.3,44.8", "Карпалне кости:5,4,2:77.1,48.7", "Тарсус:4,3,1:49.3,6.9", "Метатарзалне кости:0,3,5:54.2,2.8", "карлица:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Делтоидни мишић:4,1,5:65.3,80.2", "Бицепс:5,0,4:67.3,71.5", "Пекторални:5,0,4:52.5,76.4", "Трапезиус:1,5,4:51.4,85.5", "Абдоминални спољашњи коси:1,5,0:54.2,65.9", "Тибиалис антериор:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Срце:4,2,5:65.3,73", "Аорта:4,2,5:62.9,77.6", "Бубрежне вене:0,4,5:57.3,59.1", "Реналних артерија:0,5,4:61.5,59.1", "Југуларне вене:0,2,5:60.4,86.1", "Феморална вена:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Мозак:5,4,3:50.4,96.8", "Мали мозак:5,4,3:56,92.6", "Кичмена мождина:0,4,3:50.7,86.8", "Бедрени живац:0,4,5:59.4,37.6", "Тибијални нерв:1,5,3:61.1,19.4", "Ганглион:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Усне:1,2,4:61.4,96.6", "Увула:6,2,0:48.6,51.8", "Кутњаци:0,6,1:76.1,33", "Инцисор:0,4,1:50.4,83", "Језик:7,2,0:48.2,27.6", "Крајници:4,0,6:69.5,46.8", "Тврдо непце:1,2,0:48.6,73.8", "Меко непце:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Фронтални режањ:1,2,4:25,58.5", "Темпоралном режњу:0,2,3:51.2,42.2", "Паријетални режањ:0,1,3:66,69", "Окципитални режањ:0,1,2:91,46", "Мали мозак:1,2,0:72.8,26.1", "Мождано стабло:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Ушна шкољка:1,2,4:8,31", "Ушни канал:0,2,6:33.5,42.1", "бубна опна:1,5,6:55.6,42", "Слушне кошчице:1,0,6:54.3,52.9", "Пуж:6,1,5:75.8,45.7", "Слушни живац:6,2,1:91.8,48", "Еустахијеве тубе:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Аорта:8,6,3:51.7,84.7", "Горња шупља вена:6,7,4:27.3,92", "Доње шупље вене:1,4,3:27.8,6.8", "Десна преткомора:4,7,0:31,54.4", "Леве преткоморе:7,6,0:59.6,55.5", "Митралне валвуле:8,2,0:69.5,43.7", "Десна комора:0,1,3:47.8,38.9", "Лева комора:1,8,3:58.1,43", "Трикуспидна вентил:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Шареница:6,3,4:11.3,57", "Рожњача:2,6,4:1.7,50.5", "Очно сочиво:1,4,6:19,51.3", "Мрежњача:1,6,4:64.6,76.8", "Видни живац:0,6,3:87.9,36.2", "Предња комора:6,4,3:7.2,51.4", "Стакласто тело:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Једро:5,3,2:57.3,75.5", "Једарце:2,6,4:44.5,67.9,8", "Цитоплазма:1,4,6:93.08,50.09,9", "Ћелијске мембране:2,5,1:90,24,14", "Рибозом:2,1,3:80.929,75.844,14", "Митохондрије:1,2,3:51.4,90.35,18", "Ендоплазматични ретикулум:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Кисеоник:1,2,4:74.5,29,25", "Царбон:2,0,4:74.5,57,25", "Водоник:1,0,5:74.5,73.2,25", "Азот:1,0,2:74.5,83.5,25", "Калцијум:0,1,2:74.5,91.2,25", "Фосфор:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Који орган производи жуч неопходну за варење?:0,7,6,8", "Који је први део пробавног канала који прима храну и производи пљувачку?:1,2,6,5", "Кроз који орган храна прелази из ждрела у стомак?:2,6,9,7", "Који орган је последњи део дигестивног система?:3,4,7,8", "Где се одвија највећа апсорпција хранљивих материја и минерала из хране?:4,5,3,0", "Који орган лучи дигестивне ензиме и желудачну киселину да би помогао у варењу хране?:5,4,7,3", "Како се зове део грла иза усне и носне шупљине?:6,2,9,8", "Где се жуч складишти и концентрише пре него што се пусти у танко црево?:7,6,9,8", "Одакле се лучи инсулин?:8,0,7,6", "Који орган се налази у доњем десном делу стомака?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Која је структура кости која формира главу?:0,1,9,7", "Шта је познато и као рамена кост?:1,9,11,6", "Шта је полукрута коштана и хрскавична структура која окружује торакалну дупљу?:2,7,8,11", "Која је дефинитивна карактеристика кичмењака?:3,0,11,2", "Која је већа од две кости у нози испод колена?:4,6,9,5", "Која је најдужа и најјача кост у вашем телу?:5,6,9,1", "Шта је дуга кост у руци која иде од рамена до лакта?:6,5,1,7", "Шта је група од пет костију шаке између фаланги и ручног зглоба?:7,5,1,3", "Које кости чине зглоб?:8,7,9,10", "Шта је скуп од седам зглобних костију у сваком стопалу?:9,7,8,1", "Шта је група од пет дугих костију у стопалу?:10,8,7,4", "Шта је доњи део трупа?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Који је мишић који формира заобљену контуру људског рамена?:0,1,3,5", "Шта је велики мишић који лежи на предњој страни надлактице између рамена и лакта?:1,0,2,3", "Који мишић се налази на грудима људског тела?:2,3,5,1", "Шта је троугласти мишић који се налази на задњој страни врата?:3,1,2,5", "Који мишић је највећи од бочних трбушних мишића?:4,1,2,0", "Који је највећи од 4 мишића у предњем делу ноге?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Шта је мишићни орган који пумпа крв кроз крвне судове циркулаторног система?:0,1,3,5", "Која је главна и највећа артерија у људском телу?:1,4,3,2", "Шта су вене које дренирају бубрег?:2,5,4,1", "Шта су упарене артерије које снабдевају бубреге крвљу?:3,2,1,5", "Које су то вене које одводе деоксигенисану крв из главе назад у срце?:4,2,5,1", "Шта је велика вена која се налази дубоко унутар бутине?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Шта је орган који служи као центар нервног система?:0,1,2,5", "Која је главна карактеристика задњег мозга свих кичмењака?:1,5,0,2", "Шта је дуга, танка, цеваста структура састављена од нервног ткива?:2,1,3,4", "Шта је велики нерв који иде уз зглоб кука?:3,2,1,5", "Шта је грана ишијадичног нерва?:4,5,2,1", "Шта је група неуронских ћелија у периферном нервном систему?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Шта су мишићни набори који окружују уста?:0,1,4,7", "Шта је меснати наставак који виси изнад грла?:1,4,0,7", "Шта су равни зуби на задњем делу уста?:2,3,5,6", "Шта су предњи зуби?:3,2,5,6", "Шта је мишићни орган у устима?:4,5,6,1", "Који органи играју важну улогу у имунолошком систему?:5,1,4,0", "Шта је танка хоризонтална коштана плоча коју чине две кости скелета лица?:6,7,2,5", "Шта је меко ткиво које чини задњи део усног крова?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Који је највећи од четири главна режња мозга?:0,3,1,4", "Шта се налази иза ушију и да ли је други највећи режањ?:1,0,3,2", "Шта је укључено у перцепцију сензација, укључујући додир, температуру, бол?:2,0,3,5", "Шта је центар за визуелну обраду мозга?:3,0,1,4", "Шта игра важну улогу у контроли равнотеже?:4,5,0,1", "Шта помаже у контроли откуцаја срца и дисања?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Који је видљиви део уха који се налази изван главе?:0,3,6,2", "Шта је пут који иде од спољашњег ува до средњег уха?:1,2,3,0", "Шта је то танки преклоп коже који је чврсто затегнут као бубањ и вибрира када звук удари у њега?:2,0,5,3", "Које су три кости у средњем уху које су међу најмањим костима у људском телу?:3,0,6,2", "Шта личи на шкољку пужа?:4,2,0,6", "Шта преноси слушне сензорне информације из пужнице унутрашњег уха директно у мозак?:5,2,0,6", "Шта је такође познато као слушна цев?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Која је главна и највећа артерија у људском телу?:0,3,8,6", "Која вена носи крв из главе, врата, руку и груди назад до срца?:1,3,0,2", "Која вена носи крв из доњег дела тела назад у срце?:2,1,0,3", "Која је горња комора кроз коју крв улази у коморе срца?:3,5,6,2", "која срчана комора прима оксигенисану крв из плућа?:4,3,6,8", "Који вентил раздваја две коморе леве стране срца?:5,8,7,3", "Шта је мишићна комора која пумпа крв из срца у циркулаторни систем?:6,5,8,2", "Која је једна од четири коморе срца?:7,0,1,2", "Његова улога је да спречи повратни ток крви из десне коморе у десну преткомору.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Шта је танка структура у оку, одговорна за контролу пречника и величине зенице?:0,1,3,2", "Који је провидни предњи део ока који прекрива ирис?:1,2,3,0", "Шта је то провидна структура у оку која помаже преламању светлости да се фокусира на мрежњачу?:2,3,0,1", "Шта је најдубљи слој ткива ока који је осетљив на светлост?:3,1,0,2", "Шта преноси визуелне информације од мрежњаче до мозга?:4,6,5,3", "Који је предњи део ока између рожњаче и шаренице?:5,6,2,3", "Која очна комора се налази иза сочива и испред оптичког нерва?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Шта се налази у средини ћелије и садржи ДНК распоређену у хромозоме?:0,1,2,3", "Који регион унутар ћелије се бави производњом ћелијских рибозома?:1,2,3,4", "Шта је желатинаста течност која испуњава унутрашњост ћелије?:2,3,4,5", "Шта штити ћелију од спољашње средине?:3,4,2,1", "Која је ћелијска структура која производи протеин?:4,3,2,1", "Шта претвара хемијску енергију у облик енергије који ћелија може да користи?:5,4,3,2", "Који је транспортни систем еукариотске ћелије?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Шта се користи за оксидацију наше хране, у процесу ћелијског дисања, чиме се ослобађа енергија?:0,1,2,3", "Који је други најзаступљенији елемент у људском телу?:1,2,3,4", "Шта се користи за одржавање хидратације људског тела?:2,3,4,5", "Шта се користи за стварање аминокиселина у нашем телу које заузврат стварају протеине?:3,5,4", "Шта се користи за изградњу и одржавање јаких костију?:4,0,1,2", "Шта се користи у формирању костију и зуба?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Која је болест у којој се ваша јетра упали?:Хепатитис::", "Која је болест у којој паразит инфицира гастроинтестинални тракт људи?:Интестинални паразити::", "Која је болест у којој се ваш панкреас упали?:Панкреатитис::", "Која је болест која узрокује ломљење унутрашње слузнице желуца?:Чир на желуцу::", "Која је болест у којој се ваше слепо црево упали?:Апендицитис::", "Која је болест у којој се ваша унутрашња слузница желуца упали?:Гастритис::", "Која болест узрокује отечене вене у доњем ректуму?:Хемороиди::", "Шта су тврде наслаге од минерала и соли?:Камен у бубрегу::", "Шта су ожиљци на јетри узроковани дуготрајним оштећењем јетре?:цироза::", "Која је врста инфламаторне болести црева?:кронова болест::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Која болест узрокује бол и упалу у зглобу?:Артритис::", "Шта је прекид континуитета кости?:Прелом костију::", "Која болест слаби кости, чинећи их крхким и вјероватнијим да ће се поломити?:Остеопороза::", "Која болест узрокује бочну кривину кичме?:Сколиоза::", "Која је врста артритиса која изазива изненадни, јак бол у зглобовима?:гихт::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Која болест узрокује прогресивну слабост и губитак мишићне масе?:дистрофија мишића::", "Која болест је узрокована недостатком физичке активности?:мишићна атрофија::", "Која болест изазива упалу или иритацију тетиве?:тендинитис::", "Шта је изненадна и невољна контракција једног од ваших мишића?:мишићни грчеви::", "Шта се дешава када вам је мишић пренатегнут или поцепан?:руптура мишића::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Која је врста рака која почиње у ћелијама које су део имуног система тела?:Лимфом::", "Која је врста рака која обично почиње у коштаној сржи?:леукемија::", "Шта је узроковано продуженим излагањем веома ниским температурама?:хипотермија::", "Шта је отврднуће ваших артерија узроковано постепеним накупљањем плака?:Атеросклероза::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Шта је акутна упала заштитних мембрана које покривају мозак и кичмену мождину?:Менингитис::", "Која је то болест која може да утиче на ваш мозак и кичмену мождину и може да изазове проблеме са видом, равнотежом, контролом мишића?:Мултипла склероза::", "Шта је поремећај мозга који доводи до дрхтања, укочености и потешкоћа са ходањем, равнотежом и координацијом?:Паркинсонова болест::", "Шта карактеришу вишеструки тикови покрета и најмање један вокални тик?:Тоуреттеов синдром::", "Шта је неизлечиви, наследни поремећај мозга који оштећује мождане ћелије?:Хантингтонова болест::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Шта је озбиљна инфекција десни која оштећује меко ткиво и која може уништити кост која подржава ваше зубе?:Пародонтитис::", "Који је благи облик болести десни који изазива иритацију, црвенило и отицање гингиве?:гингивитис::", "Која су трајно оштећена подручја на тврдој површини ваших зуба?:Каријес::", "Шта је инфекција крајника на задњем делу грла?:Тонзилитис::", "Шта се дешава ако се ткиво које чини усну не споји у потпуности пре рођења?:Расцеп усне::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Који поремећај мозга уништава памћење и вештине размишљања и, на крају, способност извршавања најједноставнијих задатака?:Алцхајмерова болест::", "Шта је неуобичајено, али озбиљно стање у којем се мозак упали?:Енцефалитис::", "Шта је поремећај главобоље који се карактерише понављајућим главобољама које су умерене до тешке?:мигрена::", "Која је болест која погађа мозак и изазива честе нападе?:Епилепсија::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Шта се дешава када вирус или бактерија изазову упалу подручја иза бубне опне?:Отитис::", "Шта се односи на потпуну или делимичну немогућност да се чују звукови?:Глувоћа::", "У ком стању чујете звукове када не постоји спољашњи извор звукова?:Тинитус::", "Који је поремећај унутрашњег уха који може довести до вртоглавице (вртоглавице) и губитка слуха?:менијерова болест::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Шта је бол у грудима узрокован смањеним протоком крви у срчаним мишићима?:Ангина::", "Шта је крвни притисак који је виши од нормалног?:Хипертензија::", "Шта се дешава када се проток крви смањи или заустави у коронарној артерији срца?:Инфаркт миокарда::", "Шта је озбиљно стање у којем срце не пумпа крв онолико ефикасно колико би требало?:Конгестивна срчана инсуфицијенција::", "Шта је реч за висок ниво холестерола у крви?:Хиперхолестеролемија::", "Шта је абнормалност срчаног ритма?:Аритмија::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Шта је замућено подручје у очном сочиву које доводи до смањења вида?:Катаракта::", "Шта је стање ока узроковано инфекцијом или алергијом?:Коњунктивитис::", "Које је стање ока када се оптички нерв, који повезује око са мозгом, оштети?:Глауком::", "Шта је поремећај вида у којем мозак не успева у потпуности да обради уносе са једног ока и временом фаворизује друго око?:Амблиопиа::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Која је врста рака која може укључивати квржицу у дојци или промену облика дојке?:Карцином дојке::", "Који је најчешћи тип рака који погађа само мушкарце?:Карцином простате::", "Која је врста рака у којој ћелије у дебелом цреву или ректуму расту ван контроле?:Колоректални канцер::", "Коју врсту рака изазива дуготрајно пушење дувана?:Рак плућа::", "Која врста рака је узрокована прекомерним излагањем ултраљубичастим зрацима сунца?:Рак коже::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Како се зове ниво кисеоника испод нормалног у вашој крви, посебно у артеријама?:Хипоксемија::", "Како се зове ниво калцијума у ​​крви испод нормалног?:Хипокалцемија::", "Како се зове ниво калцијума у ​​крви изнад нормалног?:Хиперкалцемија::", "Како се зове ниво фосфата у крви испод нормалног?:хипофосфатемија::", "Како се зове ниво фосфата у крви изнад нормалног?:Хиперфосфатемија::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Жутило коже и беланчевина очију:Хепатитис:3,4,5:", "Осип или свраб око ректума:Интестинални паразити:2,7,8:", "Умерен до јак бол у стомаку који се може проширити на леђа:Панкреатитис:1,3,4:", "Тешки бол у стомаку:Чир на желуцу:6,7,8:", "Изненадни бол који почиње на десној страни доњег абдомена:Апендицитис:0,3,7:", "Мучнина или понављајући узнемирени стомак:Гастритис:4,2,1:", "Екстремни свраб око ануса:Хемороиди:0,2,3:", "Бол или пецкање током мокрења:Камен у бубрегу:3,9,1:", "Жутило коже и беланчевина очију:цироза:7,5,4:", "Крв у столици:кронова болест:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["бол у зглобовима:Артритис:1,2,3:", "тренутни, јаки бол:Прелом костију:2,3:", "Губитак висине током времена:Остеопороза:1,3,4:", "видно закривљену кичму:Сколиоза:0,1,2:", "црвена, сјајна кожа преко захваћеног зглоба:гихт:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Велики мишићи телади:дистрофија мишића:2,3,4:", "Једна рука или једна нога је мања од друге:мишићна атрофија:2,3,4:", "бол у тетиви који се погоршава када се крећете:тендинитис:1,3,4:", "Изненадни, оштар бол:мишићни грчеви:1,2:", "изненадни бол који се погоршава током контракције мишића:руптура мишића:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Безболно отицање лимфних чворова на врату, пазуха или препона:Лимфом:2,3:", "Отечени лимфни чворови, увећана јетра или слезина:леукемија:2,3:", "Дрхтање:хипотермија:0,1:", "Утрнулост или слабост у рукама или ногама:Атеросклероза:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Изненадна висока температура, јака главобоља која изгледа другачије од нормалне:Менингитис:1,2,3:", "слепило на једно око:Мултипла склероза:0,3,4:", "Тремор у рукама:Паркинсонова болест:0,3,4:", "тикови покрета:Тоуреттеов синдром:0,1,4:", "потешкоће у концентрацији и пропусте у памћењу:Хантингтонова болест:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Црвене или отечене десни:Пародонтитис:2,3,4:", "Црвене или отечене десни:гингивитис:2,3,4:", "Зубобоља:Каријес:0,4,3:", "проблеми са гутањем:Тонзилитис:0,2,4:", "Деформитети горње вилице:Расцеп усне:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["течност која цури из уха:Отитис:1,2,3:", "Губитак слуха:Глувоћа:0,2,3:", "зујање у ушима:Тинитус:0,1,3:", "вртоглавица:менијерова болест:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Замагљен вид:Катаракта:1,2,3:", "Ружичаста или црвена боја у белом оку:Коњунктивитис:0,2,3:", "интензиван бол у очима:Глауком:0,1,3:", "Лоша перцепција дубине и периферни вид:Амблиопиа:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Нова квржица у дојци или испод пазуха:Карцином дојке:1,2,3:", "Крв у урину:Карцином простате:2,3,4:", "Промена навика црева:Колоректални канцер:1,3,4:", "кашаљ који не нестаје након 2 или 3 недеље:Рак плућа:1,2,4:", "Младеж који мења боју, величину или крвари:Рак коже:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Плавкаста боја коже, ноктију и усана:Хипоксемија:1,2,3:", "Трзање у рукама, лицу и стопалима:Хипокалцемија:0,2,4:", "Чешће мокрење и жеђ:Хиперкалцемија:0,1:", "слабљење костију:хипофосфатемија:0,4:", "мишићни грчеви или грчеви:Хиперфосфатемија:0,1:"]);
  }

  void addSV(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.sv;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Lever:1,2,3:29.2,45", "Mun:4,2,9:28.1,81.6", "Matstrupe:1,8,5:48.6,58.6", "Tjocktarmen:4,2,6:20.5,21", "tunntarmen:8,7,1:52.4,19", "Magsäck:4,6,7:66,41", "Svalg:5,2,9:48.6,81", "Gallblåsa:6,9,4:31.3,39.6", "Bukspottkörtel:2,1,0:50,35.1", "blindtarms:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Kranium:11,8,6:48,97", "Skulderblad:5,4,3:61.1,80.2", "Revben:11,7,0:56,74.1", "Ryggrad:8,10,1:45.9,65.2", "Skenben:5,9,3:51.4,23.6", "Lårben:4,10,7:54.9,35.5", "Överarmsben:2,7,9:69.1,66.2", "Metacarpus:6,0,1:81.3,44.8", "Karpala ben:5,4,2:77.1,48.7", "Fotrotsben:4,3,1:49.3,6.9", "Mellanfot:0,3,5:54.2,2.8", "Bäcken:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltamuskel:4,1,5:65.3,80.2", "Biceps:5,0,4:67.3,71.5", "Pectoral muskel:5,0,4:52.5,76.4", "Trapezius:1,5,4:51.4,85.5", "Yttre sneda bukmuskeln:1,5,0:54.2,65.9", "Tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Hjärta:4,2,5:65.3,73", "Aorta:4,2,5:62.9,77.6", "Njurar:0,4,5:57.3,59.1", "Njurartär:0,5,4:61.5,59.1", "Halsven:0,2,5:60.4,86.1", "Femoral ven:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Hjärna:5,4,3:50.4,96.8", "Lillhjärnan:5,4,3:56,92.6", "Ryggmärg:0,4,3:50.7,86.8", "Ischiasnerv:0,4,5:59.4,37.6", "Tibial nerv:1,5,3:61.1,19.4", "Ganglion:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Läpp:1,2,4:61.4,96.6", "Gomspene:6,2,0:48.6,51.8", "Molarer:0,6,1:76.1,33", "Framtand:0,4,1:50.4,83", "Tunga:7,2,0:48.2,27.6", "Tonsill:4,0,6:69.5,46.8", "Hårda gommen:1,2,0:48.6,73.8", "Mjuka gommen:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Frontallob:1,2,4:25,58.5", "Temporallob:0,2,3:51.2,42.2", "Parietallob:0,1,3:66,69", "Occipitallob:0,1,2:91,46", "Lillhjärnan:1,2,0:72.8,26.1", "Hjärnstammen:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Ytteröra:1,2,4:8,31", "Örkanal:0,2,6:33.5,42.1", "Örontrumma:1,5,6:55.6,42", "hörselbenen:1,0,6:54.3,52.9", "Hörselsnäckan:6,1,5:75.8,45.7", "Auditiv nerv:6,2,1:91.8,48", "Eustachian rör:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aorta:8,6,3:51.7,84.7", "Övre hålvenen:6,7,4:27.3,92", "Undre hålvenen:1,4,3:27.8,6.8", "Höger atrium:4,7,0:31,54.4", "Vänster atrium:7,6,0:59.6,55.5", "Mitralventil:8,2,0:69.5,43.7", "höger kammare:0,1,3:47.8,38.9", "Vänster kammare:1,8,3:58.1,43", "Trikuspidventil:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["regnbågshinna:6,3,4:11.3,57", "hornhinna:2,6,4:1.7,50.5", "Lins:1,4,6:19,51.3", "näthinna:1,6,4:64.6,76.8", "Optisk nerv:0,6,3:87.9,36.2", "främre kammaren:6,4,3:7.2,51.4", "Glaskropp:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Cellkärna:5,3,2:57.3,75.5", "Nukleol:2,6,4:44.5,67.9,8", "Cytoplasma:1,4,6:93.08,50.09,9", "Cellmembran:2,5,1:90,24,14", "Ribosom:2,1,3:80.929,75.844,14", "Mitokondrie:1,2,3:51.4,90.35,18", "Endoplasmatisk retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Syre:1,2,4:74.5,29,25", "Kol:2,0,4:74.5,57,25", "Väte:1,0,5:74.5,73.2,25", "Kväve:1,0,2:74.5,83.5,25", "Kalcium:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Vilket organ producerar galla som behövs för matsmältningen?:0,7,6,8", "Vilken är den första delen av matsmältningskanalen som tar emot mat och producerar saliv?:1,2,6,5", "Genom vilket organ passerar mat från svalget till magen?:2,6,9,7", "Vilket organ är den sista delen av matsmältningssystemet?:3,4,7,8", "Var sker mest upptag av näringsämnen och mineraler från maten?:4,5,3,0", "Vilket organ utsöndrar matsmältningsenzymer och magsyra för att hjälpa matsmältningen?:5,4,7,3", "Vad heter delen av halsen bakom munnen och näshålan?:6,2,9,8", "Var lagras och koncentreras gallan innan den släpps ut i tunntarmen?:7,6,9,8", "Var utsöndras insulin ifrån?:8,0,7,6", "Vilket organ finns i nedre högra buken?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Vad är en benstruktur som bildar huvudet?:0,1,9,7", "Vad kallas även skulderbenet?:1,9,11,6", "Vad är en halvstyv ben- och broskstruktur som omger brösthålan?:2,7,8,11", "Vad är kännetecknet för ett ryggradsdjur?:3,0,11,2", "Vilket är det största av de två benen i benet under knät?:4,6,9,5", "Vilket är det längsta och starkaste benet i din kropp?:5,6,9,1", "Vad är ett långt ben i armen som löper från axeln till armbågen?:6,5,1,7", "Vad är en grupp av fem handben mellan falangerna och handleden?:7,5,1,3", "Vilka ben utgör handleden?:8,7,9,10", "Vad är ett kluster av sju artikulerande ben i varje fot?:9,7,8,1", "Vad är en grupp med fem långa ben i foten?:10,8,7,4", "Vad är den nedre delen av bålen?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Vilken muskel bildar den rundade konturen av den mänskliga axeln?:0,1,3,5", "Vad är en stor muskel som ligger på framsidan av överarmen mellan axeln och armbågen?:1,0,2,3", "Vilken muskel sitter vid människokroppens bröst?:2,3,5,1", "Vad är en triangulär muskel placerad på den bakre delen av nacken?:3,1,2,5", "Vilken muskel är den största av de laterala magmusklerna?:4,1,2,0", "Vilken är den största av 4 muskler i benets främre del?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Vad är ett muskelorgan som pumpar blod genom blodkärlen i cirkulationssystemet?:0,1,3,5", "Vilken är den största och största artären i människokroppen?:1,4,3,2", "Vad är vener som dränerar njuren?:2,5,4,1", "Vilka är parade artärer som förser njurarna med blod?:3,2,1,5", "Vad är vener som tar syrefattigt blod från huvudet tillbaka till hjärtat?:4,2,5,1", "Vad är en stor ven som ligger djupt inne i låret?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Vad är ett organ som fungerar som centrum i nervsystemet?:0,1,2,5", "Vad är en viktig egenskap hos bakhjärnan hos alla ryggradsdjur?:1,5,0,2", "Vad är en lång, tunn, rörformig struktur som består av nervvävnad?:2,1,3,4", "Vad är en stor nerv som löper längs höftleden?:3,2,1,5", "Vad är en gren av ischiasnerven?:4,5,2,1", "Vad är en grupp av neuroncellkroppar i det perifera nervsystemet?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Vad är muskelveck som omger munnen?:0,1,4,7", "Vad är en köttig förlängning som hänger ovanför halsen?:1,4,0,7", "Vad är platta tänder på baksidan av munnen?:2,3,5,6", "Vilka är framtänderna?:3,2,5,6", "Vad är ett muskelorgan i munnen?:4,5,6,1", "Vilka organ spelar en viktig roll i immunförsvaret?:5,1,4,0", "Vad är en tunn horisontell benplatta som består av två ben i ansiktsskelettet?:6,7,2,5", "Vad är den mjuka vävnaden som utgör baksidan av muntaket?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Vilken är den största av de fyra stora loberna i hjärnan?:0,3,1,4", "Vad sitter bakom öronen och är den näst största loben?:1,0,3,2", "Vad är involverat i uppfattningen av känsel, inklusive beröring, temperatur, smärta?:2,0,3,5", "Vad är hjärnans visuella bearbetningscentrum?:3,0,1,4", "Vad spelar en viktig roll för balanskontroll?:4,5,0,1", "Vad hjälper till att kontrollera puls och andningsfrekvens?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Vilken är den synliga delen av örat som är utanför huvudet?:0,3,6,2", "Vad är en väg som går från ytterörat till mellanörat?:1,2,3,0", "Vad är en tunn hudflik som sträcks hårt som en trumma och vibrerar när ljudet träffar den?:2,0,5,3", "Vilka är tre ben i mellanörat som är bland de minsta benen i människokroppen?:3,0,6,2", "Vad liknar skalet på en snigel?:4,2,0,6", "Vad bär auditiv sensorisk information från snäckan i innerörat direkt till hjärnan?:5,2,0,6", "Vad är också känt som hörselröret?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Vilken är den största och största artären i människokroppen?:0,3,8,6", "Vilken ven transporterar blod från ditt huvud, nacke, armar och bröstkorg tillbaka till ditt hjärta?:1,3,0,2", "Vilken ven transporterar blod från underkroppen tillbaka till ditt hjärta?:2,1,0,3", "Vilken är den övre kammaren genom vilken blod kommer in i hjärtats ventriklar?:3,5,6,2", "vilken hjärtkammare tar emot syresatt blod från lungorna?:4,3,6,8", "Vilken ventil skiljer de två kamrarna i hjärtats vänstra sida?:5,8,7,3", "Vad är muskelkammare som pumpar blod ut ur hjärtat och in i cirkulationssystemet?:6,5,8,2", "Vilken är en av hjärtats fyra kammare?:7,0,1,2", "Dess roll är att förhindra tillbakaflöde av blod från höger kammare till höger förmak.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Vad är en tunn struktur i ögat, ansvarig för att kontrollera pupillens diameter och storlek?:0,1,3,2", "Vad är den genomskinliga främre delen av ögat som täcker iris?:1,2,3,0", "Vad är en transparent struktur i ögat som hjälper till att bryta ljus för att fokusera på näthinnan?:2,3,0,1", "Vilket är det innersta, ljuskänsliga lagret av vävnad i ögat?:3,1,0,2", "Vad överför visuell information från näthinnan till hjärnan?:4,6,5,3", "Vilken är den främre delen av ögat mellan hornhinnan och iris?:5,6,2,3", "Vilken ögonkammare finns bakom linsen och framför synnerven?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Vad finns i mitten av cellen och det innehåller DNA ordnat i kromosomer?:0,1,2,3", "Vilken region i cellen är angelägen om att producera cellribosomerna?:1,2,3,4", "Vad är en gelatinös vätska som fyller insidan av en cell?:2,3,4,5", "Vad skyddar cellen från dess yttre miljö?:3,4,2,1", "Vad är en cellstruktur som producerar protein?:4,3,2,1", "Vad omvandlar kemisk energi till en energiform som cellen kan använda?:5,4,3,2", "Vilket transportsystem har den eukaryota cellen?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Vad används för att oxidera vår mat, i processen för cellandning, och på så sätt frigöra energi?:0,1,2,3", "Vilket är det näst vanligaste elementet i människokroppen?:1,2,3,4", "Vad används för att hålla människokroppen hydrerad?:2,3,4,5", "Vad används för att göra aminosyror i vår kropp som i sin tur gör proteiner?:3,5,4", "Vad används för att bygga och underhålla starka ben?:4,0,1,2", "Vad används vid bildandet av ben och tänder?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Vad är en sjukdom där din lever blir inflammerad?:Hepatit::", "Vad är en sjukdom där en parasit infekterar mag-tarmkanalen hos människor?:Tarmparasiter::", "Vad är en sjukdom där din bukspottkörtel blir inflammerad?:Pankreatit::", "Vad är en sjukdom som orsakar brott i magslemhinnan?:Magsår::", "Vad är en sjukdom där din blindtarm blir inflammerad?:Appendicit::", "Vad är en sjukdom där din inre slemhinna i magen blir inflammerad?:Gastrit::", "Vilken sjukdom orsakar svullna vener i din nedre ändtarm?:Hemorrojder::", "Vad är hårda avlagringar gjorda av mineraler och salter?:Njursten::", "Vad är ärrbildning i levern orsakad av långvarig leverskada?:Cirros::", "Vad är en typ av inflammatorisk tarmsjukdom?:Crohns sjukdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Vilken sjukdom orsakar smärta och inflammation i en led?:Artrit::", "Vad är ett brott i kontinuiteten hos ett ben?:Benfraktur::", "Vilken sjukdom försvagar benen, gör dem ömtåliga och mer benägna att gå sönder?:Osteoporos::", "Vilken sjukdom orsakar en sidledes krökning av ryggraden?:Skolios::", "Vad är en typ av artrit som orsakar plötslig, svår ledvärk?:Gikt::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Vilken sjukdom orsakar progressiv svaghet och förlust av muskelmassa?:muskeldystrofi::", "Vilken sjukdom orsakas av bristande fysisk aktivitet?:muskelatrofi::", "Vilken sjukdom orsakar inflammation eller irritation av en sena?:tendinit::", "Vad är en plötslig och ofrivillig sammandragning av en av dina muskler?:muskelkramper::", "Vad händer när din muskel är översträckt eller sliten?:muskelbristning::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Vad är en typ av cancer som börjar i celler som är en del av kroppens immunförsvar?:Lymfom::", "Vad är en typ av cancer som vanligtvis börjar i benmärgen?:Leukemi::", "Vad orsakas av långvarig exponering för mycket kalla temperaturer?:Hypotermi::", "Vad är en förhårdnad av dina artärer som orsakas av gradvis plackuppbyggnad?:Åderförkalkning::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Vad är en akut inflammation i de skyddande hinnorna som täcker hjärnan och ryggmärgen?:Hjärnhinneinflammation::", "Vad är en sjukdom som kan påverka din hjärna och ryggmärg, och kan orsaka problem med syn, balans, muskelkontroll?:Multipel skleros::", "Vad är en hjärnstörning som leder till skakningar, stelhet och svårigheter med gång, balans och koordination?:Parkinsons sjukdom::", "Vad kännetecknas av tics med flera rörelser och minst en vokal tics?:Tourettes syndrom::", "Vad är en obotlig, ärftlig hjärnsjukdom som skadar hjärnceller?:Huntingtons sjukdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Vad är en allvarlig tandköttsinfektion som skadar mjukvävnaden och som kan förstöra benet som stöder dina tänder?:Parodontit::", "Vad är en mild form av tandköttssjukdom som orsakar irritation, rodnad och svullnad av din gingiva?:gingivit::", "Vilka är permanent skadade områden på den hårda ytan på dina tänder?:Karies::", "Vad är en infektion i halsmandlarna på baksidan av halsen?:Halsfluss::", "Vad händer om vävnaden som utgör läppen inte går ihop helt innan födseln?:Kluven läpp::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Vilken hjärnstörning förstör minnet och tankeförmågan och, så småningom, förmågan att utföra de enklaste uppgifterna?:Alzheimers sjukdom::", "Vad är ett ovanligt men allvarligt tillstånd där hjärnan blir inflammerad?:Encefalit::", "Vad kännetecknar en huvudvärkstörning av återkommande huvudvärk som är måttlig till svår?:Migrän::", "Vad är en sjukdom som påverkar hjärnan och orsakar frekventa anfall?:Epilepsi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Vad händer när ett virus eller en bakterie gör att området bakom trumhinnan blir inflammerat?:Öroninflammation::", "Vad avser den totala eller partiella oförmågan att höra ljud?:Dövhet::", "Vad är ett tillstånd där du hör ljud när det inte finns någon extern källa till ljuden?:Tinnitus::", "Vad är en störning i innerörat som kan leda till yrsel (yrsel) och hörselnedsättning?:Ménières sjukdom::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Vad är en bröstsmärta som orsakas av minskat blodflöde till hjärtmusklerna?:Angina::", "Vad är blodtrycket som är högre än normalt?:Hypertoni::", "Vad händer när blodflödet minskar eller stannar till hjärtats kransartär?:Hjärtinfarkt::", "Vad är ett allvarligt tillstånd där hjärtat inte pumpar blod så effektivt som det borde?:Hjärtsvikt::", "Vad är ett ord för höga nivåer av kolesterol i blodet?:Hyperkolesterolemi::", "Vad är en avvikelse i hjärtats rytm?:Arytmi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Vad är ett grumligt område i ögats lins som leder till nedsatt syn?:Grå starr::", "Vad är ett ögonsjukdom som orsakas av infektion eller allergi?:Konjunktivit::", "Vad är ett ögonsjukdom där synnerven, som förbinder ögat med hjärnan, skadas?:Glaukom::", "Vad är en synstörning där hjärnan misslyckas med att fullständigt bearbeta input från ett öga och med tiden gynnar det andra ögat?:Amblyopi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Vad är en typ av cancer som kan innehålla en knöl i bröstet eller en förändring i bröstformen?:Bröstcancer::", "Vilken är den vanligaste typen av cancer som bara drabbar män?:Prostatacancer::", "Vad är en typ av cancer där celler i tjocktarmen eller ändtarmen växer utom kontroll?:Kolorektal cancer::", "Vilken typ av cancer orsakas av långvarig tobaksrökning?:Lungcancer::", "Vilken typ av cancer orsakas av överexponering för ultravioletta strålar från solen?:Hudcancer::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Vad kallas en undernormal nivå av syre i ditt blod, speciellt i artärerna?:Hypoxemi::", "Vad kallas en undernormal nivå av kalcium i ditt blod?:Hypokalcemi::", "Vad kallas en över normal nivå av kalcium i ditt blod?:Hyperkalcemi::", "Vad kallas en undernormal nivå av fosfat i ditt blod?:hypofosfatemi::", "Vad kallas en över normal nivå av fosfat i ditt blod?:Hyperfosfatemi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Gulfärgning av huden och det vita i ögonen:Hepatit:3,4,5:", "Utslag eller klåda runt ändtarmen:Tarmparasiter:2,7,8:", "Måttlig till svår buksmärta som kan sprida sig till ryggen:Pankreatit:1,3,4:", "Svår magsmärta:Magsår:6,7,8:", "Plötslig smärta som börjar på höger sida av nedre delen av buken:Appendicit:0,3,7:", "Illamående eller återkommande orolig mage:Gastrit:4,2,1:", "Extrem klåda runt anus:Hemorrojder:0,2,3:", "Smärta eller brännande känsla vid urinering:Njursten:3,9,1:", "Gulfärgning av huden och det vita i ögonen:Cirros:7,5,4:", "Blod i avföringen:Crohns sjukdom:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["ledvärk:Artrit:1,2,3:", "omedelbar, svår smärta:Benfraktur:2,3:", "Förlust av höjd över tid:Osteoporos:1,3,4:", "en synligt böjd ryggrad:Skolios:0,1,2:", "röd, glänsande hud över den drabbade leden:Gikt:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Stora vadmuskler:muskeldystrofi:2,3,4:", "En arm eller ett ben är mindre än det andra:muskelatrofi:2,3,4:", "smärta i en sena som blir värre när du rör på dig:tendinit:1,3,4:", "En plötslig, skarp smärta:muskelkramper:1,2:", "plötslig smärta som förvärras när muskeln dras samman:muskelbristning:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Smärtfri svullnad av lymfkörtlar i nacke, armhålor eller ljumskar:Lymfom:2,3:", "Svullna lymfkörtlar, förstorad lever eller mjälte:Leukemi:2,3:", "Ryser:Hypotermi:0,1:", "Domningar eller svaghet i dina armar eller ben:Åderförkalkning:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Plötslig hög feber, svår huvudvärk som verkar annorlunda än normalt:Hjärnhinneinflammation:1,2,3:", "blindhet i ena ögat:Multipel skleros:0,3,4:", "Tremor i händerna:Parkinsons sjukdom:0,3,4:", "rörelsetics:Tourettes syndrom:0,1,4:", "koncentrationssvårigheter och minnesbortfall:Huntingtons sjukdom:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Rött eller svullet tandkött:Parodontit:2,3,4:", "Rött eller svullet tandkött:gingivit:2,3,4:", "Tandvärk:Karies:0,4,3:", "problem med att svälja:Halsfluss:0,2,4:", "Missbildningar i överkäken:Kluven läpp:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["vätska som rinner från örat:Öroninflammation:1,2,3:", "Förlust av hörsel:Dövhet:0,2,3:", "ett ringande ljud i öronen:Tinnitus:0,1,3:", "vertigo:Ménières sjukdom:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Grumlad syn:Grå starr:1,2,3:", "Rosa eller röd färg i ögonvitan:Konjunktivit:0,2,3:", "intensiv ögonsmärta:Glaukom:0,1,3:", "Dålig djupuppfattning och perifert seende:Amblyopi:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["En ny knöl i bröstet eller armhålan:Bröstcancer:1,2,3:", "Blod i urinen:Prostatacancer:2,3,4:", "En förändring i tarmvanor:Kolorektal cancer:1,3,4:", "en hosta som inte går över efter 2 eller 3 veckor:Lungcancer:1,2,4:", "En födelsemärken som ändrar färg, storlek eller som blöder:Hudcancer:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Blåaktig färg i hud, fingernaglar och läppar:Hypoxemi:1,2,3:", "Ryckningar i händer, ansikte och fötter:Hypokalcemi:0,2,4:", "Mer frekvent urinering och törst:Hyperkalcemi:0,1:", "försvagning av ben:hypofosfatemi:0,4:", "muskelkramper eller spasmer:Hyperfosfatemi:0,1:"]);
  }

  void addTH(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.th;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["ตับ:1,2,3:29.2,45", "ปาก:4,2,9:28.1,81.6", "หลอดอาหาร:1,8,5:48.6,58.6", "ลำไส้ใหญ่:4,2,6:20.5,21", "ลำไส้เล็ก:8,7,1:52.4,19", "กระเพาะอาหาร:4,6,7:66,41", "หลอดลม:5,2,9:48.6,81", "ถุงน้ำดี:6,9,4:31.3,39.6", "ตับอ่อน:2,1,0:50,35.1", "ไส้ติ่ง:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["กะโหลกศีรษะ:11,8,6:48,97", "สะบัก:5,4,3:61.1,80.2", "ซี่โครง:11,7,0:56,74.1", "กระดูกสันหลัง:8,10,1:45.9,65.2", "กระดูกแข้ง:5,9,3:51.4,23.6", "ขาอ่อน:4,10,7:54.9,35.5", "กระดูกต้นแขน:2,7,9:69.1,66.2", "กระดูกฝ่ามือ:6,0,1:81.3,44.8", "กระดูกข้อมือ:5,4,2:77.1,48.7", "ทาร์ซัส:4,3,1:49.3,6.9", "กระดูกฝ่าเท้า:0,3,5:54.2,2.8", "กระดูกเชิงกราน:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["กล้ามเนื้อเดลทอยด์:4,1,5:65.3,80.2", "ลูกหนู:5,0,4:67.3,71.5", "กล้ามเนื้อหน้าอก:5,0,4:52.5,76.4", "กล้ามเนื้อทราพีเซียส:1,5,4:51.4,85.5", "ช่องท้องภายนอกเอียง:1,5,0:54.2,65.9", "กล้ามเนื้อหน้าแข้งส่วนหน้า:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["หัวใจ:4,2,5:65.3,73", "เอออร์ตา:4,2,5:62.9,77.6", "เส้นเลือดไต:0,4,5:57.3,59.1", "หลอดเลือดแดงไต:0,5,4:61.5,59.1", "เกี่ยวกับคอ เส้นเลือด:0,2,5:60.4,86.1", "เส้นเลือดแดง:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["สมอง:5,4,3:50.4,96.8", "สมองน้อย:5,4,3:56,92.6", "ไขสันหลัง:0,4,3:50.7,86.8", "ประสาท ไซแอติก:0,4,5:59.4,37.6", "กระดูกแข้ง:1,5,3:61.1,19.4", "ปมประสาท:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["ริมฝีปาก:1,2,4:61.4,96.6", "ลิ้นไก่:6,2,0:48.6,51.8", "ฟันกราม:0,6,1:76.1,33", "ฟันหน้า:0,4,1:50.4,83", "ลิ้น:7,2,0:48.2,27.6", "ต่อมทอนซิล:4,0,6:69.5,46.8", "เพดานแข็ง:1,2,0:48.6,73.8", "เพดานอ่อน:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["กลีบหน้า:1,2,4:25,58.5", "กลีบขมับ:0,2,3:51.2,42.2", "กลีบข้าง:0,1,3:66,69", "กลีบท้ายทอย:0,1,2:91,46", "สมองน้อย:1,2,0:72.8,26.1", "ก้านสมอง:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["ใบหู:1,2,4:8,31", "ช่องหู:0,2,6:33.5,42.1", "กลองหู:1,5,6:55.6,42", "กระดูกหู:1,0,6:54.3,52.9", "หูชั้นในรูปหอยโข่ง:6,1,5:75.8,45.7", "ประสาทการได้ยิน:6,2,1:91.8,48", "หลอดยูสเตเชียน:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["เอออร์ตา:8,6,3:51.7,84.7", "หลอดเลือดดําใหญ่ส่วนบน:6,7,4:27.3,92", "หลอดเลือดดําใหญ่ส่วนล่าง:1,4,3:27.8,6.8", "หัวใจห้องบนขวา:4,7,0:31,54.4", "หัวใจห้องบนซ้าย:7,6,0:59.6,55.5", "ลิ้นไมตรัล:8,2,0:69.5,43.7", "หัวใจห้องล่างขวา:0,1,3:47.8,38.9", "หัวใจห้องล่างซ้าย:1,8,3:58.1,43", "ลิ้นไตรคัสปิด:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["ม่านตา:6,3,4:11.3,57", "กระจกตา:2,6,4:1.7,50.5", "เลนส์:1,4,6:19,51.3", "จอตา:1,6,4:64.6,76.8", "เส้นประสาทตา:0,6,3:87.9,36.2", "ช่องหน้าม่านตา:6,4,3:7.2,51.4", "น้ำเลี้ยงลูกตา:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["นิวเคลียสของเซลล์:5,3,2:57.3,75.5", "นิวคลีโอลัส:2,6,4:44.5,67.9,8", "ไซโตพลาสซึม:1,4,6:93.08,50.09,9", "เยื่อหุ้มเซลล์:2,5,1:90,24,14", "ไรโบโซม:2,1,3:80.929,75.844,14", "ไมโตคอนเดรีย:1,2,3:51.4,90.35,18", "เอนโดพลาสมิกเรติคูลัม:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["ออกซิเจน:1,2,4:74.5,29,25", "คาร์บอน:2,0,4:74.5,57,25", "ไฮโดรเจน:1,0,5:74.5,73.2,25", "ไนโตรเจน:1,0,2:74.5,83.5,25", "แคลเซียม:0,1,2:74.5,91.2,25", "ฟอสฟอรัส:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["อวัยวะใดผลิตน้ำดีที่จำเป็นสำหรับการย่อยอาหาร?:0,7,6,8", "อะไรคือส่วนแรกของทางเดินอาหารที่ได้รับอาหารและผลิตน้ำลาย?:1,2,6,5", "อาหารอวัยวะใดผ่านจากคอหอยไปยังกระเพาะอาหาร?:2,6,9,7", "อวัยวะใดเป็นส่วนสุดท้ายของระบบย่อยอาหาร?:3,4,7,8", "การดูดซึมสารอาหารและแร่ธาตุจากอาหารเกิดขึ้นที่ใดมากที่สุด?:4,5,3,0", "อวัยวะใดหลั่งเอนไซม์ย่อยอาหารและกรดในกระเพาะอาหารเพื่อช่วยย่อยอาหาร?:5,4,7,3", "ส่วนคอหลังปากและโพรงจมูกเรียกว่าอะไร?:6,2,9,8", "น้ำดีถูกเก็บไว้ที่ไหนและเข้มข้นก่อนที่จะปล่อยลงลำไส้เล็ก?:7,6,9,8", "อินซูลินหลั่งจากที่ไหน?:8,0,7,6", "อวัยวะใดอยู่ในช่องท้องด้านขวาล่าง?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["โครงสร้างกระดูกที่สร้างศีรษะคืออะไร?:0,1,9,7", "สิ่งที่เรียกว่ากระดูกไหล่?:1,9,11,6", "กระดูกกึ่งแข็งและโครงสร้างกระดูกอ่อนที่ล้อมรอบช่องทรวงอกคืออะไร?:2,7,8,11", "ลักษณะเฉพาะของสัตว์มีกระดูกสันหลังคืออะไร?:3,0,11,2", "กระดูกทั้งสองข้างที่ขาใต้เข่ามีขนาดใหญ่แค่ไหน?:4,6,9,5", "กระดูกที่ยาวและแข็งแรงที่สุดในร่างกายของคุณคืออะไร?:5,6,9,1", "กระดูกยาวที่แขนที่ลากจากไหล่ถึงข้อศอกคืออะไร?:6,5,1,7", "กระดูกห้าชิ้นของมือระหว่าง phalanges และข้อมือคืออะไร?:7,5,1,3", "กระดูกอะไรประกอบเป็นข้อมือ?:8,7,9,10", "กระดูกที่ประกบกันเจ็ดก้อนในแต่ละเท้าคืออะไร?:9,7,8,1", "กระดูกยาวห้าชิ้นที่เท้าคืออะไร?:10,8,7,4", "ส่วนล่างของลำตัวคืออะไร?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["กล้ามเนื้อที่สร้างส่วนโค้งมนของไหล่มนุษย์คืออะไร?:0,1,3,5", "กล้ามเนื้อขนาดใหญ่ที่อยู่ด้านหน้าของต้นแขนระหว่างไหล่กับข้อศอกคืออะไร?:1,0,2,3", "กล้ามเนื้อใดอยู่ที่หน้าอกของร่างกายมนุษย์?:2,3,5,1", "กล้ามเนื้อสามเหลี่ยมที่อยู่ด้านหลังของคอคืออะไร?:3,1,2,5", "กล้ามเนื้อใดมีขนาดใหญ่ที่สุดของกล้ามเนื้อหน้าท้องด้านข้าง?:4,1,2,0", "กล้ามเนื้อส่วนหน้าของขาใหญ่ที่สุดในบรรดากล้ามเนื้อ 4 มัด คือข้อใด:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["อวัยวะของกล้ามเนื้อที่สูบฉีดเลือดผ่านหลอดเลือดของระบบไหลเวียนเลือดคืออะไร?:0,1,3,5", "หลอดเลือดแดงหลักและใหญ่ที่สุดในร่างกายมนุษย์คืออะไร?:1,4,3,2", "เส้นเลือดที่ระบายไตคืออะไร?:2,5,4,1", "หลอดเลือดแดงคู่ที่ให้เลือดกับไตคืออะไร?:3,2,1,5", "เส้นเลือดที่นำเลือดดีออกซิเจนจากศีรษะกลับสู่หัวใจคืออะไร?:4,2,5,1", "หลอดเลือดดำขนาดใหญ่ที่อยู่ลึกเข้าไปในต้นขาคืออะไร?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["อวัยวะที่ทำหน้าที่เป็นศูนย์กลางของระบบประสาทคืออะไร?:0,1,2,5", "ลักษณะสำคัญของสมองส่วนหลังของสัตว์มีกระดูกสันหลังทั้งหมดคืออะไร?:1,5,0,2", "โครงสร้างท่อยาวบางและยาวประกอบด้วยเนื้อเยื่อประสาทคืออะไร?:2,1,3,4", "เส้นประสาทขนาดใหญ่ที่วิ่งควบคู่ไปกับข้อสะโพกคืออะไร?:3,2,1,5", "เส้นประสาท sciatic คืออะไร?:4,5,2,1", "กลุ่มของเซลล์ประสาทในระบบประสาทส่วนปลายคืออะไร?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["รอยพับของกล้ามเนื้อที่ล้อมรอบปากคืออะไร?:0,1,4,7", "ส่วนขยายเนื้อที่ห้อยอยู่เหนือคอคืออะไร?:1,4,0,7", "ฟันแบนที่หลังปากคืออะไร?:2,3,5,6", "ฟันหน้าคืออะไร?:3,2,5,6", "อวัยวะของกล้ามเนื้อในปากคืออะไร?:4,5,6,1", "อวัยวะใดมีบทบาทสำคัญในระบบภูมิคุ้มกัน?:5,1,4,0", "แผ่นกระดูกแนวนอนบาง ๆ ที่ประกอบด้วยกระดูกสองชิ้นของโครงกระดูกใบหน้าคืออะไร?:6,7,2,5", "เนื้อเยื่ออ่อนที่อยู่ด้านหลังหลังคาปากคืออะไร?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["สมองสี่กลีบใหญ่ที่สุดในสี่ส่วนคือข้อใด:0,3,1,4", "อะไรอยู่หลังใบหูและเป็นกลีบที่ใหญ่เป็นอันดับสอง?:1,0,3,2", "อะไรคือสิ่งที่เกี่ยวข้องกับการรับรู้ความรู้สึก รวมทั้งการสัมผัส อุณหภูมิ ความเจ็บปวด?:2,0,3,5", "ศูนย์ประมวลผลภาพของสมองคืออะไร?:3,0,1,4", "อะไรมีบทบาทสำคัญในการควบคุมสมดุล?:4,5,0,1", "อะไรช่วยควบคุมอัตราการเต้นของหัวใจและอัตราการหายใจ?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["อะไรคือส่วนที่มองเห็นได้ของหูที่อยู่นอกศีรษะ?:0,3,6,2", "ทางเดินจากหูชั้นนอกไปยังหูชั้นกลางคืออะไร?:1,2,3,0", "แผ่นหนังบาง ๆ ที่ยืดออกแน่นเหมือนกลองและสั่นเมื่อเสียงกระทบมันคืออะไร?:2,0,5,3", "กระดูกสามชิ้นในหูชั้นกลางที่อยู่ในกระดูกที่เล็กที่สุดในร่างกายมนุษย์คืออะไร?:3,0,6,2", "สิ่งที่คล้ายกับเปลือกของหอยทาก?:4,2,0,6", "อะไรนำข้อมูลประสาทสัมผัสการได้ยินจากหูชั้นในไปยังสมองโดยตรง?:5,2,0,6", "สิ่งที่เรียกว่าหลอดหู?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["หลอดเลือดแดงหลักและใหญ่ที่สุดในร่างกายมนุษย์คืออะไร?:0,3,8,6", "เส้นเลือดใดที่นำเลือดจากศีรษะ คอ แขน และหน้าอกกลับไปยังหัวใจของคุณ?:1,3,0,2", "เส้นเลือดใดนำเลือดจากร่างกายส่วนล่างของคุณกลับสู่หัวใจ?:2,1,0,3", "ห้องบนที่เลือดเข้าสู่โพรงหัวใจคืออะไร?:3,5,6,2", "หัวใจห้องไหนได้รับเลือดออกซิเจนจากปอด?:4,3,6,8", "ลิ้นหัวใจอะไรกั้นห้องสองห้องด้านซ้ายของหัวใจ?:5,8,7,3", "ห้องกล้ามเนื้อที่สูบฉีดเลือดออกจากหัวใจและเข้าสู่ระบบไหลเวียนเลือดคืออะไร?:6,5,8,2", "ข้อใดเป็นหนึ่งในสี่ห้องของหัวใจ:7,0,1,2", "มีหน้าที่ป้องกันไม่ให้เลือดไหลย้อนกลับจากหัวใจห้องล่างขวาไปยังห้องโถงด้านขวา:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["โครงสร้างบางในดวงตามีหน้าที่ควบคุมขนาดและเส้นผ่าศูนย์กลางของรูม่านตาคืออะไร?:0,1,3,2", "อะไรคือส่วนหน้าโปร่งใสของดวงตาที่ปิดม่านตา?:1,2,3,0", "โครงสร้างตาโปร่งแสงที่ช่วยหักเหแสงเพื่อโฟกัสที่เรตินาคืออะไร?:2,3,0,1", "ชั้นในสุดของเนื้อเยื่อตาที่ไวต่อแสงคืออะไร?:3,1,0,2", "อะไรส่งข้อมูลภาพจากเรตินาไปยังสมอง?:4,6,5,3", "อะไรคือส่วนหน้าของดวงตาระหว่างกระจกตากับม่านตา?:5,6,2,3", "ช่องตาใดอยู่หลังเลนส์และด้านหน้าเส้นประสาทตา:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["อะไรอยู่ตรงกลางเซลล์และประกอบด้วย DNA ที่อยู่ในโครโมโซม?:0,1,2,3", "บริเวณใดภายในเซลล์ที่เกี่ยวข้องกับการผลิตไรโบโซมของเซลล์?:1,2,3,4", "ของเหลวเจลาตินที่เติมภายในเซลล์คืออะไร?:2,3,4,5", "อะไรปกป้องเซลล์จากสภาพแวดล้อมภายนอก?:3,4,2,1", "โครงสร้างเซลล์ที่ผลิตโปรตีนคืออะไร?:4,3,2,1", "อะไรเปลี่ยนพลังงานเคมีให้เป็นพลังงานที่เซลล์สามารถใช้ได้?:5,4,3,2", "ระบบขนส่งของเซลล์ยูคาริโอตคืออะไร?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["อะไรที่ใช้ในการออกซิไดซ์อาหารของเราในกระบวนการหายใจระดับเซลล์จึงปล่อยพลังงานออกมา?:0,1,2,3", "องค์ประกอบที่มีมากที่สุดเป็นอันดับสองในร่างกายมนุษย์คืออะไร?:1,2,3,4", "ใช้อะไรเพื่อให้ร่างกายมนุษย์ชุ่มชื้น?:2,3,4,5", "กรดอมิโนในร่างกายของเราใช้สร้างโปรตีนอะไร?:3,5,4", "อะไรใช้ในการสร้างและรักษากระดูกให้แข็งแรง?:4,0,1,2", "ใช้อะไรในการสร้างกระดูกและฟัน?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["โรคอะไรที่ทำให้ตับของคุณอักเสบ?:โรคตับอักเสบ::", "โรคที่ปรสิตติดเชื้อในทางเดินอาหารของมนุษย์คืออะไร?:ปรสิตในลำไส้::", "โรคที่ตับอ่อนของคุณเกิดการอักเสบคืออะไร?:ตับอ่อนอักเสบ::", "โรคอะไรที่ทำให้เยื่อบุชั้นในของกระเพาะแตก?:แผลในกระเพาะอาหาร::", "โรคที่ไส้ติ่งของคุณอักเสบคืออะไร?:ไส้ติ่งอักเสบ::", "โรคที่เยื่อบุชั้นในของกระเพาะอาหารอักเสบคืออะไร?:โรคกระเพาะ::", "โรคอะไรทำให้เกิดเส้นเลือดโป่งพองในทวารหนักส่วนล่างของคุณ?:ริดสีดวงทวาร::", "แร่และเกลือแร่ชนิดแข็งคืออะไร?:นิ่วในไต::", "รอยแผลเป็นที่ตับเกิดจากความเสียหายของตับในระยะยาวคืออะไร?:โรคตับแข็ง::", "โรคลำไส้อักเสบชนิดใด?:โรคโครห์น::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["โรคอะไรทำให้เกิดอาการปวดและอักเสบในข้อ?:ข้ออักเสบ::", "การแตกในความต่อเนื่องของกระดูกคืออะไร?:กระดูกหัก::", "โรคอะไรทำให้กระดูกเปราะบางและแตกหักง่าย?:โรคกระดูกพรุน::", "โรคอะไรที่ทำให้กระดูกสันหลังโค้งไปด้านข้าง?:กระดูกสันหลังคด::", "โรคข้ออักเสบชนิดใดที่ทำให้เกิดอาการปวดข้ออย่างฉับพลันและรุนแรง?:โรคเกาต์::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["โรคอะไรทำให้เกิดความอ่อนแอและการสูญเสียมวลกล้ามเนื้อมากขึ้น?:กล้ามเนื้อเสื่อม::", "โรคอะไรเกิดจากการไม่ออกกำลังกาย?:กล้ามเนื้อลีบ::", "โรคอะไรทำให้เกิดการอักเสบหรือระคายเคืองของเส้นเอ็น?:เอ็นอักเสบ::", "การหดตัวของกล้ามเนื้ออย่างกะทันหันและไม่สมัครใจคืออะไร?:ปวดกล้ามเนื้อ::", "จะเกิดอะไรขึ้นเมื่อกล้ามเนื้อของคุณยืดออกหรือฉีกขาด?:กล้ามเนื้อแตก::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["มะเร็งชนิดใดที่เริ่มต้นในเซลล์ที่เป็นส่วนหนึ่งของระบบภูมิคุ้มกันของร่างกาย:มะเร็งต่อมน้ำเหลือง::", "มะเร็งชนิดใดที่มักเริ่มในไขกระดูก:มะเร็งเม็ดเลือดขาว::", "อะไรเกิดจากการสัมผัสกับอุณหภูมิที่เย็นจัดเป็นเวลานาน?:อุณหภูมิต่ำกว่าปกติ::", "อะไรคือการแข็งตัวของหลอดเลือดแดงของคุณที่เกิดจากการสะสมของคราบจุลินทรีย์ทีละน้อย?:หลอดเลือด::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["การอักเสบเฉียบพลันของเยื่อหุ้มป้องกันที่ครอบคลุมสมองและไขสันหลังคืออะไร?:เยื่อหุ้มสมองอักเสบ::", "โรคอะไรที่อาจส่งผลต่อสมองและไขสันหลังของคุณ และทำให้เกิดปัญหากับการมองเห็น การทรงตัว การควบคุมกล้ามเนื้อ?:หลายเส้นโลหิตตีบ::", "โรคทางสมองที่นำไปสู่การสั่น ตึง และเดินลำบาก ทรงตัว และการประสานงานลำบากคืออะไร?:โรคพาร์กินสัน::", "ลักษณะเฉพาะของอาการแสดงการเคลื่อนไหวหลายอย่างและอาการกระตุกของเสียงอย่างน้อยหนึ่งครั้งมีลักษณะอย่างไร:ทูเร็ตต์ ซินโดรม::", "โรคทางสมองที่รักษาไม่หายและถ่ายทอดทางพันธุกรรมที่ทำลายเซลล์สมองคืออะไร?:โรคฮันติงตัน::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["การติดเชื้อที่เหงือกอย่างร้ายแรงที่ทำลายเนื้อเยื่ออ่อนและสามารถทำลายกระดูกที่รองรับฟันของคุณคืออะไร?:โรคปริทันต์::", "โรคเหงือกรูปแบบที่ไม่รุนแรงที่ทำให้เกิดอาการระคายเคือง แดง และบวมที่เหงือกของคุณคืออะไร?:โรคเหงือกอักเสบ::", "พื้นที่ที่เสียหายถาวรในพื้นผิวแข็งของฟันของคุณคืออะไร?:ฟันผุ::", "การติดเชื้อที่ต่อมทอนซิลที่คอของคุณคืออะไร?:ต่อมทอนซิลอักเสบ::", "จะเกิดอะไรขึ้นถ้าเนื้อเยื่อที่ประกอบเป็นริมฝีปากไม่สนิทกันก่อนคลอด?:ปากแหว่ง::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["ความผิดปกติของสมองชนิดใดที่ทำลายความจำและทักษะการคิด และในที่สุด ความสามารถในการทำงานที่ง่ายที่สุด?:โรคอัลไซเมอร์::", "อาการผิดปกติแต่ร้ายแรงที่สมองอักเสบคืออะไร?:โรคไข้สมองอักเสบ::", "โรคปวดศีรษะที่มีลักษณะเป็นอาการปวดศีรษะซ้ำๆ ในระดับปานกลางถึงรุนแรงคืออะไร?:ไมเกรน::", "โรคที่ส่งผลต่อสมองและทำให้เกิดอาการชักบ่อยคืออะไร?:โรคลมบ้าหมู::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["จะเกิดอะไรขึ้นเมื่อไวรัสหรือแบคทีเรียทำให้บริเวณหลังแก้วหูอักเสบ?:โรคหูน้ำหนวก::", "อะไรคือความไม่ได้ยินเสียงทั้งหมดหรือบางส่วน?:หูหนวก::", "เงื่อนไขที่คุณได้ยินเสียงเมื่อไม่มีเสียงภายนอกคืออะไร?:หูอื้อ::", "ความผิดปกติของหูชั้นในที่อาจนำไปสู่อาการวิงเวียนศีรษะ (เวียนศีรษะ) และการสูญเสียการได้ยินคืออะไร?:โรคเมเนียร์::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["อาการเจ็บหน้าอกที่เกิดจากการไหลเวียนของเลือดลดลงไปยังกล้ามเนื้อหัวใจคืออะไร?:โรคหลอดเลือดหัวใจตีบ::", "ความดันโลหิตที่สูงกว่าปกติคืออะไร?:ความดันโลหิตสูง::", "จะเกิดอะไรขึ้นเมื่อการไหลเวียนของเลือดลดลงหรือหยุดไปยังหลอดเลือดหัวใจของหัวใจ?:กล้ามเนื้อหัวใจตาย::", "ภาวะร้ายแรงที่หัวใจไม่สูบฉีดเลือดอย่างมีประสิทธิภาพเท่าที่ควรคืออะไร?:หัวใจล้มเหลว::", "ระดับคอเลสเตอรอลในเลือดสูงคืออะไร?:ไขมันในเลือดสูง::", "การเต้นของหัวใจผิดปกติคืออะไร?:หัวใจเต้นผิดจังหวะ::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["บริเวณที่มีเมฆมากในเลนส์ตาที่ทำให้การมองเห็นลดลงคืออะไร?:ต้อกระจก::", "ภาวะตาที่เกิดจากการติดเชื้อหรือภูมิแพ้คืออะไร?:ตาแดง::", "สภาพตาที่เส้นประสาทตาซึ่งเชื่อมต่อตากับสมองได้รับความเสียหายคืออะไร?:ต้อหิน::", "อะไรคือความผิดปกติของการมองเห็นที่สมองไม่สามารถประมวลผลอินพุตจากตาข้างหนึ่งได้อย่างเต็มที่และเมื่อเวลาผ่านไปจะเป็นประโยชน์ต่อตาอีกข้างหนึ่ง?:มัว::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["มะเร็งชนิดใดที่อาจรวมถึงก้อนเนื้อที่เต้านมหรือรูปร่างของเต้านมเปลี่ยนแปลง:โรคมะเร็งเต้านม::", "มะเร็งชนิดใดที่พบบ่อยที่สุดที่ส่งผลกระทบต่อผู้ชายเท่านั้น?:มะเร็งต่อมลูกหมาก::", "มะเร็งชนิดใดที่เซลล์ในลำไส้ใหญ่หรือทวารหนักเติบโตโดยควบคุมไม่ได้:มะเร็งลำไส้ใหญ่และทวารหนัก::", "มะเร็งชนิดใดที่เกิดจากการสูบบุหรี่เป็นเวลานาน?:โรคมะเร็งปอด::", "มะเร็งชนิดใดที่เกิดจากการได้รับรังสีอัลตราไวโอเลตจากดวงอาทิตย์มากเกินไป?:มะเร็งผิวหนัง::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["ระดับออกซิเจนในเลือดต่ำกว่าปกติเรียกว่าเท่าใด โดยเฉพาะในหลอดเลือดแดง:ภาวะขาดออกซิเจน::", "ระดับแคลเซียมในเลือดของคุณต่ำกว่าปกติเรียกว่าอะไร?:ภาวะแคลเซียมในเลือดต่ำ::", "ระดับแคลเซียมในเลือดของคุณสูงกว่าปกติเรียกว่าอะไร?:แคลเซียมในเลือดสูง::", "ระดับฟอสเฟตในเลือดต่ำกว่าปกติเรียกว่าอะไร?:ไฮโปฟอสเฟตเมีย::", "ระดับฟอสเฟตในเลือดของคุณสูงกว่าปกติเรียกว่าอะไร?:ไฮเปอร์ฟอสเฟตเมีย::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["ผิวเหลืองและตาขาว:โรคตับอักเสบ:3,4,5:", "ผื่นหรือคันบริเวณทวารหนัก:ปรสิตในลำไส้:2,7,8:", "ปวดท้องปานกลางถึงรุนแรงที่อาจลามไปถึงหลังของคุณ:ตับอ่อนอักเสบ:1,3,4:", "ปวดท้องรุนแรง:แผลในกระเพาะอาหาร:6,7,8:", "อาการปวดกะทันหันที่ด้านขวาของช่องท้องส่วนล่าง:ไส้ติ่งอักเสบ:0,3,7:", "คลื่นไส้หรือปวดท้องกำเริบ:โรคกระเพาะ:4,2,1:", "อาการคันรุนแรงบริเวณทวารหนัก:ริดสีดวงทวาร:0,2,3:", "ปวดหรือแสบร้อนขณะปัสสาวะ:นิ่วในไต:3,9,1:", "ผิวเหลืองและตาขาว:โรคตับแข็ง:7,5,4:", "เลือดในอุจจาระ:โรคโครห์น:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["ปวดข้อ:ข้ออักเสบ:1,2,3:", "เจ็บทันทีทันใด:กระดูกหัก:2,3:", "สูญเสียความสูงเมื่อเวลาผ่านไป:โรคกระดูกพรุน:1,3,4:", "กระดูกสันหลังโค้งอย่างเห็นได้ชัด:กระดูกสันหลังคด:0,1,2:", "ผิวสีแดงเป็นมันเงาบริเวณข้อต่อที่ได้รับผลกระทบ:โรคเกาต์:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["กล้ามน่องใหญ่:กล้ามเนื้อเสื่อม:2,3,4:", "แขนข้างหนึ่งหรือขาข้างหนึ่งเล็กกว่าอีกข้างหนึ่ง:กล้ามเนื้อลีบ:2,3,4:", "ปวดในเส้นเอ็นที่แย่ลงเมื่อคุณเคลื่อนไหว:เอ็นอักเสบ:1,3,4:", "ปวดฉี่กะทันหัน:ปวดกล้ามเนื้อ:1,2:", "ปวดกะทันหันที่แย่ลงในขณะที่เกร็งกล้ามเนื้อ:กล้ามเนื้อแตก:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["ต่อมน้ำเหลืองที่คอ รักแร้ หรือขาหนีบบวมโดยไม่เจ็บปวด:มะเร็งต่อมน้ำเหลือง:2,3:", "ต่อมน้ำเหลืองโต ตับหรือม้ามโต:มะเร็งเม็ดเลือดขาว:2,3:", "ตัวสั่น:อุณหภูมิต่ำกว่าปกติ:0,1:", "อาการชาหรืออ่อนแรงที่แขนหรือขา:หลอดเลือด:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["ไข้สูงกะทันหัน ปวดศีรษะรุนแรง ที่ดูต่างจากปกติ:เยื่อหุ้มสมองอักเสบ:1,2,3:", "ตาบอดข้างเดียว:หลายเส้นโลหิตตีบ:0,3,4:", "มือสั่น:โรคพาร์กินสัน:0,3,4:", "สำบัดสำนวนการเคลื่อนไหว:ทูเร็ตต์ ซินโดรม:0,1,4:", "สมาธิยากและความจำเสื่อม:โรคฮันติงตัน:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["เหงือกแดงหรือบวม:โรคปริทันต์:2,3,4:", "เหงือกแดงหรือบวม:โรคเหงือกอักเสบ:2,3,4:", "ปวดฟัน:ฟันผุ:0,4,3:", "ปัญหาการกลืน:ต่อมทอนซิลอักเสบ:0,2,4:", "ความผิดปกติของขากรรไกรบน:ปากแหว่ง:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["ของเหลวที่ไหลออกจากหู:โรคหูน้ำหนวก:1,2,3:", "สูญเสียการได้ยิน:หูหนวก:0,2,3:", "เสียงดังในหู:หูอื้อ:0,1,3:", "อาการเวียนศีรษะ:โรคเมเนียร์:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["วิสัยทัศน์ที่มีเมฆมาก:ต้อกระจก:1,2,3:", "สีชมพูหรือสีแดงในตาขาว:ตาแดง:0,2,3:", "ปวดตาอย่างรุนแรง:ต้อหิน:0,1,3:", "การรับรู้ความลึกต่ำและการมองเห็นรอบข้าง:มัว:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["ก้อนใหม่ที่เต้านมหรือใต้วงแขน:โรคมะเร็งเต้านม:1,2,3:", "เลือดในปัสสาวะ:มะเร็งต่อมลูกหมาก:2,3,4:", "นิสัยการขับถ่ายเปลี่ยนไป:มะเร็งลำไส้ใหญ่และทวารหนัก:1,3,4:", "อาการไอที่ไม่หายไปหลังจาก 2 หรือ 3 สัปดาห์:โรคมะเร็งปอด:1,2,4:", "ไฝที่เปลี่ยนสี ขนาด หรือเลือดออก:มะเร็งผิวหนัง:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["สีผิว เล็บ และริมฝีปากเป็นสีน้ำเงิน:ภาวะขาดออกซิเจน:1,2,3:", "ตัวสั่นในมือ ใบหน้า และเท้า:ภาวะแคลเซียมในเลือดต่ำ:0,2,4:", "ปัสสาวะและกระหายน้ำบ่อยขึ้น:แคลเซียมในเลือดสูง:0,1:", "กระดูกอ่อนลง:ไฮโปฟอสเฟตเมีย:0,4:", "ปวดกล้ามเนื้อหรือกระตุก:ไฮเปอร์ฟอสเฟตเมีย:0,1:"]);
  }

  void addTR(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.tr;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Karaciğer:1,2,3:29.2,45", "Ağız:4,2,9:28.1,81.6", "Yemek borusu:1,8,5:48.6,58.6", "Kalın bağırsak:4,2,6:20.5,21", "İnce bağırsak:8,7,1:52.4,19", "Mide:4,6,7:66,41", "Yutak:5,2,9:48.6,81", "Safra kesesi:6,9,4:31.3,39.6", "Pankreas:2,1,0:50,35.1", "Apandis:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Kafatası:11,8,6:48,97", "Kürek kemiği:5,4,3:61.1,80.2", "kaburga:11,7,0:56,74.1", "Omurga:8,10,1:45.9,65.2", "Kaval kemiği:5,9,3:51.4,23.6", "Uyluk:4,10,7:54.9,35.5", "humerus:2,7,9:69.1,66.2", "Metakarpal kemikler:6,0,1:81.3,44.8", "Karpal kemikler:5,4,2:77.1,48.7", "tarsal kemikleri:4,3,1:49.3,6.9", "Metatarsal kemikler:0,3,5:54.2,2.8", "Pelvis:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Deltoid:4,1,5:65.3,80.2", "pazı kas:5,0,4:67.3,71.5", "Göğüs kası:5,0,4:52.5,76.4", "Trapezius:1,5,4:51.4,85.5", "Karın dış eğik kas:1,5,0:54.2,65.9", "Musculus tibialis anterior:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Kalp:4,2,5:65.3,73", "Aort:4,2,5:62.9,77.6", "Renal venler:0,4,5:57.3,59.1", "Renal arter:0,5,4:61.5,59.1", "Juguler damarlar:0,2,5:60.4,86.1", "Femoral ven:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Beyin:5,4,3:50.4,96.8", "Beyincik:5,4,3:56,92.6", "Omurilik:0,4,3:50.7,86.8", "Siyatik sinir:0,4,5:59.4,37.6", "Tibial sinir:1,5,3:61.1,19.4", "Gangliyon:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Dudaklar:1,2,4:61.4,96.6", "küçük dil:6,2,0:48.6,51.8", "azıdişi:0,6,1:76.1,33", "kesici diş:0,4,1:50.4,83", "Dil:7,2,0:48.2,27.6", "Bademcik:4,0,6:69.5,46.8", "Sert damak:1,2,0:48.6,73.8", "Yumuşak damak:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Frontal lob:1,2,4:25,58.5", "Geçici lob:0,2,3:51.2,42.2", "Parietal lob:0,1,3:66,69", "Oksipital lob:0,1,2:91,46", "Beyincik:1,2,0:72.8,26.1", "Beyinsapı:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["kulak kepçesi:1,2,4:8,31", "Kulak kanalı:0,2,6:33.5,42.1", "Kulak davul:1,5,6:55.6,42", "kemikçikleri:1,0,6:54.3,52.9", "Koklea:6,1,5:75.8,45.7", "İşitsel sinir:6,2,1:91.8,48", "Östaki borusu:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Aort:8,6,3:51.7,84.7", "Üstün Vena Kava:6,7,4:27.3,92", "Düşük vena kava:1,4,3:27.8,6.8", "Sağ atriyum:4,7,0:31,54.4", "Sol atriyum:7,6,0:59.6,55.5", "Mitral kapak:8,2,0:69.5,43.7", "Sağ ventrikül:0,1,3:47.8,38.9", "Sol ventrikül:1,8,3:58.1,43", "Triküspit kapak:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["İris:6,3,4:11.3,57", "Kornea:2,6,4:1.7,50.5", "mercek:1,4,6:19,51.3", "ağ kat:1,6,4:64.6,76.8", "Optik sinir:0,6,3:87.9,36.2", "ön odasında:6,4,3:7.2,51.4", "Vitre:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Hücre çekirdeği:5,3,2:57.3,75.5", "Çekirdekçik:2,6,4:44.5,67.9,8", "Sitoplazma:1,4,6:93.08,50.09,9", "Hücre zarı:2,5,1:90,24,14", "Ribozom:2,1,3:80.929,75.844,14", "Mitokondri:1,2,3:51.4,90.35,18", "Endoplazmik retikulum:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oksijen:1,2,4:74.5,29,25", "Karbon:2,0,4:74.5,57,25", "Hidrojen:1,0,5:74.5,73.2,25", "Azot:1,0,2:74.5,83.5,25", "Kalsiyum:0,1,2:74.5,91.2,25", "Fosfor:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Sindirim için gerekli olan safrayı hangi organ üretir?:0,7,6,8", "Sindirim kanalının yiyecekleri alan ve tükürük üreten ilk kısmı nedir?:1,2,6,5", "Besinler yutaktan mideye hangi organdan geçer?:2,6,9,7", "Sindirim sisteminin son kısmı hangi organdır?:3,4,7,8", "Besinlerin ve minerallerin besinlerden en fazla emilimi nerede gerçekleşir?:4,5,3,0", "Besinlerin sindirimine yardımcı olmak için sindirim enzimleri ve mide asidi salgılayan organ hangisidir?:5,4,7,3", "Boğazın ağız ve burun boşluğunun arkasında kalan kısmına ne ad verilir?:6,2,9,8", "Safra ince bağırsağa salınmadan önce nerede depolanır ve konsantre edilir?:7,6,9,8", "İnsülin nereden salgılanır?:8,0,7,6", "Sağ alt karında hangi organ bulunur?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Kafayı oluşturan kemik yapısı nedir?:0,1,9,7", "Omuz kemiği olarak da bilinen nedir?:1,9,11,6", "Göğüs boşluğunu çevreleyen yarı sert kemikli ve kıkırdaklı yapı nedir?:2,7,8,11", "Omurgalıların belirleyici özelliği nedir?:3,0,11,2", "Bacakta diz altında bulunan iki kemikten en büyüğü hangisidir?:4,6,9,5", "Vücudunuzdaki en uzun ve en güçlü kemik hangisidir?:5,6,9,1", "Kolda omuzdan dirseğe uzanan uzun kemik nedir?:6,5,1,7", "Falankslar ve bilek arasındaki elin beş kemiğinden oluşan bir grup nedir?:7,5,1,3", "Bileği hangi kemikler oluşturur?:8,7,9,10", "Her ayaktaki yedi eklemli kemik kümesi nedir?:9,7,8,1", "Ayaktaki beş uzun kemikten oluşan bir grup nedir?:10,8,7,4", "Gövdenin alt kısmı nedir?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["İnsan omzunun yuvarlak hatlarını oluşturan kas nedir?:0,1,3,5", "Omuz ve dirsek arasında üst kolun ön tarafında yer alan büyük kas nedir?:1,0,2,3", "İnsan vücudunun göğsünde hangi kas bulunur?:2,3,5,1", "Boynun arka yüzünde yer alan üçgen kas nedir?:3,1,2,5", "Yan karın kaslarının en büyüğü hangisidir?:4,1,2,0", "Bacağın ön kompartmanındaki 4 kastan en büyüğü hangisidir?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Dolaşım sistemindeki kan damarlarından kan pompalayan kaslı organ nedir?:0,1,3,5", "İnsan vücudundaki ana ve en büyük arter nedir?:1,4,3,2", "Böbreği boşaltan damarlar nelerdir?:2,5,4,1", "Böbreğe kan sağlayan eşleşmiş arterler nelerdir?:3,2,1,5", "Oksijeni giderilmiş kanı kafadan kalbe geri götüren damarlar nelerdir?:4,2,5,1", "Uyluğun derinliklerinde bulunan büyük bir damar nedir?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Sinir sisteminin merkezi olarak görev yapan organ nedir?:0,1,2,5", "Tüm omurgalıların arka beyinlerinin ana özelliği nedir?:1,5,0,2", "Sinir dokusundan oluşan uzun, ince, boru şeklinde bir yapı nedir?:2,1,3,4", "Kalça eklemi boyunca uzanan büyük bir sinir nedir?:3,2,1,5", "Siyatik sinirin bir dalı nedir?:4,5,2,1", "Periferik sinir sistemindeki bir grup nöron hücre gövdesi nedir?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Ağzı çevreleyen kas kıvrımları nelerdir?:0,1,4,7", "Boğazın üzerinde sarkan etli uzantı nedir?:1,4,0,7", "Ağzın arkasındaki düz dişler nelerdir?:2,3,5,6", "Ön dişler nelerdir?:3,2,5,6", "Ağızdaki kaslı organ nedir?:4,5,6,1", "Bağışıklık sisteminde hangi organlar önemli rol oynar?:5,1,4,0", "Yüz iskeletinin iki kemiğinden oluşan ince bir yatay kemik plakası nedir?:6,7,2,5", "Ağız çatısının arkasını oluşturan yumuşak doku nedir?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Beynin dört ana lobunun en büyüğü hangisidir?:0,3,1,4", "Kulakların arkasına ne oturur ve ikinci en büyük lob nedir?:1,0,3,2", "Dokunma, sıcaklık, ağrı dahil olmak üzere duyu algısına neler dahildir?:2,0,3,5", "Beynin görsel işlem merkezi nedir?:3,0,1,4", "Denge kontrolünde önemli bir rol oynayan nedir?:4,5,0,1", "Kalp atış hızını ve solunum hızını kontrol etmeye ne yardımcı olur?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Kulağın başın dışında görünen kısmı nedir?:0,3,6,2", "Dış kulaktan orta kulağa uzanan yol nedir?:1,2,3,0", "Bir davul gibi gerilmiş ve ses çarptığında titreyen ince bir deri parçası nedir?:2,0,5,3", "İnsan vücudundaki en küçük kemikler arasında yer alan orta kulaktaki üç kemik nedir?:3,0,6,2", "Salyangoz kabuğuna ne benzer?:4,2,0,6", "İşitsel duyusal bilgileri iç kulaktaki kokleadan doğrudan beyne taşıyan nedir?:5,2,0,6", "İşitme tüpü olarak da bilinen nedir?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["İnsan vücudundaki ana ve en büyük arter nedir?:0,3,8,6", "Başınız, boynunuz, kollarınız ve göğsünüzden gelen kanı kalbinize geri taşıyan damar hangisidir?:1,3,0,2", "Alt vücudunuzdaki kanı kalbe geri taşıyan damar hangisidir?:2,1,0,3", "Kanın kalbin karıncıklarına girdiği üst oda nedir?:3,5,6,2", "Oksijenli kanı akciğerlerden hangi kalp odası alır?:4,3,6,8", "Kalbin sol tarafındaki iki odacığı ayıran kapakçık hangisidir?:5,8,7,3", "Kanın kalpten dolaşım sistemine pompalanmasını sağlayan kas odası nedir?:6,5,8,2", "Hangisi kalbin dört odasından biridir?:7,0,1,2", "Görevi, kanın sağ ventrikülden sağ atriyuma geri akışını önlemektir.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Göz bebeğinin çapını ve boyutunu kontrol etmekten sorumlu olan gözdeki ince yapı nedir?:0,1,3,2", "Gözün irisi örten şeffaf ön kısmı nedir?:1,2,3,0", "Gözdeki ışığı kırarak retinaya odaklamaya yardımcı olan saydam yapı nedir?:2,3,0,1", "Gözün en içteki ışığa duyarlı doku tabakası nedir?:3,1,0,2", "Görsel bilgiyi retinadan beyne ileten nedir?:4,6,5,3", "Gözün kornea ile iris arasındaki ön kısmı nedir?:5,6,2,3", "Lensin arkasında ve optik sinirin önünde hangi göz odası bulunur?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Hücrenin ortasında bulunan ve kromozomlar halinde düzenlenmiş DNA&#39;yı içeren nedir?:0,1,2,3", "Hücredeki hangi bölge hücre ribozomlarının üretilmesiyle ilgilidir?:1,2,3,4", "Hücrenin içini dolduran jelatinimsi sıvı nedir?:2,3,4,5", "Hücreyi dış ortamdan koruyan nedir?:3,4,2,1", "Protein üreten hücre yapısı nedir?:4,3,2,1", "Kimyasal enerjiyi hücrenin kullanabileceği bir enerji formuna çeviren nedir?:5,4,3,2", "Ökaryot hücrenin taşıma sistemi nedir?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Hücresel solunum sürecinde besinlerimizi oksitlemek ve böylece enerji açığa çıkarmak için ne kullanılır?:0,1,2,3", "İnsan vücudunda en çok bulunan ikinci element hangisidir?:1,2,3,4", "İnsan vücudunu nemli tutmak için ne kullanılır?:2,3,4,5", "Vücudumuzda protein yapan amino asitleri yapmak için ne kullanılır?:3,5,4", "Güçlü kemikler oluşturmak ve korumak için ne kullanılır?:4,0,1,2", "Kemiklerin ve dişlerin oluşumunda ne kullanılır?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Karaciğerinizin iltihaplandığı bir hastalık nedir?:Hepatit::", "Bir parazitin insanların mide-bağırsak sistemini enfekte ettiği bir hastalık nedir?:Bağırsak parazitleri::", "Pankreasın iltihaplandığı bir hastalık nedir?:pankreatit::", "Midenin iç zarının yırtılmasına neden olan hastalık nedir?:Mide ülseri::", "Apandisinizin iltihaplandığı bir hastalık nedir?:Apandisit::", "Midenizin iç zarının iltihaplandığı bir hastalık nedir?:Gastrit::", "Alt rektumda damarların şişmesine hangi hastalık neden olur?:Hemoroid::", "Mineraller ve tuzlardan oluşan sert tortular nelerdir?:Böbrek taşı::", "Uzun süreli karaciğer hasarının neden olduğu karaciğer skarı nedir?:Siroz::", "Bir tür inflamatuar bağırsak hastalığı nedir?:Crohn hastalığı::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Eklemde ağrı ve iltihaplanmaya neden olan hastalık nedir?:Artrit::", "Kemiğin devamlılığında bozulma nedir?:Kemik kırığı::", "Hangi hastalık kemikleri zayıflatır, kırılgan hale getirir ve kırılma olasılığını artırır?:osteoporoz::", "Omurganın yana doğru eğriliğine hangi hastalık neden olur?:skolyoz::", "Ani, şiddetli eklem ağrısına neden olan bir artrit türü nedir?:Gut::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Hangi hastalık ilerleyici zayıflığa ve kas kütlesi kaybına neden olur?:kas distrofisi::", "Fiziksel aktivite eksikliği hangi hastalığa neden olur?:kas atrofisi::", "Bir tendonun iltihaplanmasına veya tahriş olmasına hangi hastalık neden olur?:tendinit::", "Kaslarınızdan birinin ani ve istemsiz kasılması nedir?:kas krampları::", "Kasınız aşırı gerildiğinde veya yırtıldığında ne olur?:kas yırtılması::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Vücudun bağışıklık sisteminin bir parçası olan hücrelerde başlayan kanser türü nedir?:Lenfoma::", "Genellikle kemik iliğinde başlayan kanser türü nedir?:Lösemi::", "Çok soğuk sıcaklıklara uzun süre maruz kalmanın nedeni nedir?:hipotermi::", "Kademeli plak oluşumunun neden olduğu atardamarlarınızın sertleşmesi nedir?:ateroskleroz::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Beyni ve omuriliği kaplayan koruyucu zarların akut iltihabı nedir?:Menenjit::", "Beyninizi ve omuriliğinizi etkileyebilen, görme, denge, kas kontrolünde sorunlara neden olabilen bir hastalık nedir?:Multipl skleroz::", "Titreme, katılık ve yürüme, denge ve koordinasyon güçlüğüne yol açan bir beyin bozukluğu nedir?:Parkinson hastalığı::", "Çoklu hareket tikleri ve en az bir vokal tik ile karakterize edilen nedir?:Tourette sendromu::", "Beyin hücrelerine zarar veren tedavisi olmayan, kalıtsal bir beyin bozukluğu nedir?:Huntington hastalığı::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Yumuşak dokuya zarar veren ve dişlerinizi destekleyen kemiği tahrip edebilen ciddi bir diş eti enfeksiyonu nedir?:periodontitis::", "Diş etinde tahrişe, kızarıklığa ve şişmeye neden olan hafif bir diş eti hastalığı şekli nedir?:diş eti iltihabı::", "Dişlerinizin sert yüzeyinde kalıcı olarak hasar görmüş alanlar nelerdir?:Diş çürüğü::", "Boğazınızın arkasındaki bademciklerin enfeksiyonu nedir?:Bademcik iltihabı::", "Dudağı oluşturan doku doğumdan önce tam olarak birleşmezse ne olur?:Yarık dudak::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Hangi beyin bozukluğu hafızayı ve düşünme becerilerini ve nihayetinde en basit görevleri yerine getirme yeteneğini yok eder?:Alzheimer hastalığı::", "Beynin iltihaplandığı nadir fakat ciddi bir durum nedir?:ensefalit::", "Orta ila şiddetli tekrarlayan baş ağrıları ile karakterize bir baş ağrısı bozukluğu nedir?:Migren::", "Beyni etkileyen ve sık nöbetlere neden olan bir hastalık nedir?:Epilepsi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Bir virüs veya bakteri kulak zarının arkasındaki alanın iltihaplanmasına neden olduğunda ne olur?:otit‎::", "Sesleri tamamen veya kısmen duyamama durumu ne anlama gelir?:Sağırlık::", "Seslerin dışarıdan bir kaynağı olmadığında sesleri duymanız durumu nedir?:kulak çınlaması::", "Baş dönmesi (vertigo) ve işitme kaybına yol açabilen iç kulak bozukluğu nedir?:Meniere hastalığı::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Kalp kaslarına giden kan akışının azalmasından kaynaklanan göğüs ağrısı nedir?:Anjina, göğüs ağrısı::", "Normalden daha yüksek olan tansiyon nedir?:Hipertansiyon::", "Kalbin koroner arterine giden kan akışı azaldığında veya durduğunda ne olur?:Miyokardiyal enfarktüs::", "Kalbin kanı gerektiği kadar verimli pompalayamadığı ciddi bir durum nedir?:Konjestif kalp yetmezliği::", "Kandaki yüksek kolesterol düzeyine ne ad verilir?:hiperkolesterolemi::", "Kalbin ritmindeki anormallik nedir?:aritmi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Göz merceğinde görme azalmasına neden olan bulanık bir alan nedir?:Katarakt::", "Enfeksiyon veya alerjiden kaynaklanan göz rahatsızlığı nedir?:konjonktivit::", "Gözü beyne bağlayan görme sinirinin hasar görmesi durumu nedir?:glokom::", "Beynin bir gözden gelen girdileri tam olarak işleyemediği ve zamanla diğer gözü tercih ettiği görme bozukluğu nedir?:ambliyopi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Memede bir yumru veya meme şeklinde bir değişiklik içerebilen bir kanser türü nedir?:Meme kanseri::", "Sadece erkekleri etkileyen en yaygın kanser türü hangisidir?:Prostat kanseri::", "Kolon veya rektumdaki hücrelerin kontrolden çıktığı bir kanser türü nedir?:Kolorektal kanser::", "Uzun süreli tütün kullanımı ne tür bir kansere neden olur?:Akciğer kanseri::", "Güneşten gelen ultraviyole ışınlarına aşırı maruz kalmak ne tür kansere neden olur?:Cilt kanseri::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Kanınızdaki, özellikle atardamarlardaki oksijen seviyesinin normalin altında olmasına ne denir?:hipoksemi::", "Kanınızdaki normalin altındaki kalsiyum düzeyine ne denir?:hipokalsemi::", "Kanınızdaki normalin üzerindeki kalsiyum düzeyine ne denir?:hiperkalsemi::", "Kanınızdaki normalin altındaki fosfat düzeyine ne denir?:hipofosfatemi::", "Kanınızdaki normalin üzerinde fosfat düzeyine ne denir?:hiperfosfatemi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Cildin ve gözlerin beyazlarının sararması:Hepatit:3,4,5:", "Rektum çevresinde döküntü veya kaşıntı:Bağırsak parazitleri:2,7,8:", "Sırtınıza yayılabilen orta ila şiddetli karın ağrısı:pankreatit:1,3,4:", "Şiddetli mide ağrısı:Mide ülseri:6,7,8:", "Alt karnın sağ tarafında başlayan ani ağrı:Apandisit:0,3,7:", "Mide bulantısı veya tekrarlayan mide rahatsızlığı:Gastrit:4,2,1:", "Anüs çevresinde aşırı kaşıntı:Hemoroid:0,2,3:", "İdrar yaparken ağrı veya yanma hissi:Böbrek taşı:3,9,1:", "Cildin ve gözlerin beyazlarının sararması:Siroz:7,5,4:", "Dışkıda kan:Crohn hastalığı:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["eklem ağrısı:Artrit:1,2,3:", "ani, şiddetli ağrı:Kemik kırığı:2,3:", "Zamanla yükseklik kaybı:osteoporoz:1,3,4:", "gözle görülür şekilde kavisli bir omurga:skolyoz:0,1,2:", "etkilenen eklem üzerinde kırmızı, parlak cilt:Gut:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Büyük baldır kasları:kas distrofisi:2,3,4:", "Bir kol veya bir bacak diğerinden daha küçük:kas atrofisi:2,3,4:", "hareket ettiğinizde kötüleşen bir tendonda ağrı:tendinit:1,3,4:", "Ani, keskin bir ağrı:kas krampları:1,2:", "kas kasılırken kötüleşen ani ağrı:kas yırtılması:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Boynunuzdaki, koltuk altınızdaki veya kasıktaki lenf düğümlerinin ağrısız şişmesi:Lenfoma:2,3:", "Şişmiş lenf düğümleri, genişlemiş karaciğer veya dalak:Lösemi:2,3:", "Titreme:hipotermi:0,1:", "Kollarınızda veya bacaklarınızda uyuşma veya güçsüzlük:ateroskleroz:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Ani yüksek ateş, normalden farklı görünen şiddetli baş ağrısı:Menenjit:1,2,3:", "tek gözde körlük:Multipl skleroz:0,3,4:", "Ellerde titreme:Parkinson hastalığı:0,3,4:", "hareket tikleri:Tourette sendromu:0,1,4:", "konsantre olma zorluğu ve hafıza kaybı:Huntington hastalığı:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Kırmızı veya şiş diş etleri:periodontitis:2,3,4:", "Kırmızı veya şiş diş etleri:diş eti iltihabı:2,3,4:", "Diş ağrısı:Diş çürüğü:0,4,3:", "yutma sorunları:Bademcik iltihabı:0,2,4:", "Üst çenedeki şekil bozuklukları:Yarık dudak:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["kulaktan akan sıvı:otit‎:1,2,3:", "Sağırlık:Sağırlık:0,2,3:", "kulaklarda çınlama sesi:kulak çınlaması:0,1,3:", "baş dönmesi:Meniere hastalığı:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Bulutlu görüş:Katarakt:1,2,3:", "Göz beyazında pembe veya kırmızı renk:konjonktivit:0,2,3:", "yoğun göz ağrısı:glokom:0,1,3:", "Zayıf derinlik algısı ve çevresel görüş:ambliyopi:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Memede veya koltuk altında yeni bir yumru:Meme kanseri:1,2,3:", "İdrarda kan:Prostat kanseri:2,3,4:", "Bağırsak alışkanlıklarında değişiklik:Kolorektal kanser:1,3,4:", "2 veya 3 hafta sonra geçmeyen bir öksürük:Akciğer kanseri:1,2,4:", "Rengi, boyutu değişen veya kanayan bir ben:Cilt kanseri:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Ciltte, tırnaklarda ve dudaklarda mavimsi renk:hipoksemi:1,2,3:", "Ellerinizde, yüzünüzde ve ayaklarınızda seğirme:hipokalsemi:0,2,4:", "Daha sık idrara çıkma ve susuzluk:hiperkalsemi:0,1:", "kemiklerin zayıflaması:hipofosfatemi:0,4:", "kas krampları veya spazmları:hiperfosfatemi:0,1:"]);
  }

  void addUK(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.uk;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Печінка:1,2,3:29.2,45", "Рот:4,2,9:28.1,81.6", "Стравохід:1,8,5:48.6,58.6", "Товста кишка:4,2,6:20.5,21", "Тонка кишка:8,7,1:52.4,19", "Шлунок:4,6,7:66,41", "глотка:5,2,9:48.6,81", "жовчний міхур:6,9,4:31.3,39.6", "Підшлункова залоза:2,1,0:50,35.1", "Апендикс:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Череп:11,8,6:48,97", "Скапула:5,4,3:61.1,80.2", "Ребра:11,7,0:56,74.1", "Хребет:8,10,1:45.9,65.2", "Тібія:5,9,3:51.4,23.6", "Фемур:4,10,7:54.9,35.5", "Хамерус:2,7,9:69.1,66.2", "Метакарпальні кістки:6,0,1:81.3,44.8", "Кістки зап'ястя:5,4,2:77.1,48.7", "Заплесно:4,3,1:49.3,6.9", "Метатарзальні кістки:0,3,5:54.2,2.8", "таз:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["Дельтовидний м'яз:4,1,5:65.3,80.2", "Біцепси:5,0,4:67.3,71.5", "Грудна мускулатура:5,0,4:52.5,76.4", "Трапеція:1,5,4:51.4,85.5", "Зовнішній косий м'яз живота:1,5,0:54.2,65.9", "Тібіаліс передня:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Серце:4,2,5:65.3,73", "Аорта:4,2,5:62.9,77.6", "Ниркові вени:0,4,5:57.3,59.1", "Ниркова артерія:0,5,4:61.5,59.1", "яремні вени:0,2,5:60.4,86.1", "Стегнова вена:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Мозок:5,4,3:50.4,96.8", "Мозочок:5,4,3:56,92.6", "Спинний мозок:0,4,3:50.7,86.8", "Сідничний нерв:0,4,5:59.4,37.6", "великогомілковий нерв:1,5,3:61.1,19.4", "Гангліон:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Губи:1,2,4:61.4,96.6", "Увула:6,2,0:48.6,51.8", "Моляри:0,6,1:76.1,33", "Інцизор:0,4,1:50.4,83", "Язик:7,2,0:48.2,27.6", "Тонзил:4,0,6:69.5,46.8", "Тверде піднебіння:1,2,0:48.6,73.8", "М'яке піднебіння:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Лобова частка:1,2,4:25,58.5", "Скронева частка:0,2,3:51.2,42.2", "Парієтальна частка:0,1,3:66,69", "потилична частка:0,1,2:91,46", "Мозочок:1,2,0:72.8,26.1", "Стовбур мозку:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["Вушна раковина:1,2,4:8,31", "Вушний канал:0,2,6:33.5,42.1", "Вушний барабан:1,5,6:55.6,42", "Слухові кістки:1,0,6:54.3,52.9", "Кохлія:6,1,5:75.8,45.7", "Слуховий нерв:6,2,1:91.8,48", "Євстахієва трубка:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Аорта:8,6,3:51.7,84.7", "Верхня порожниста вена:6,7,4:27.3,92", "Нижня порожниста вена:1,4,3:27.8,6.8", "Праве передсердя:4,7,0:31,54.4", "Ліве передсердя:7,6,0:59.6,55.5", "Мітральний клапан:8,2,0:69.5,43.7", "Правий шлуночок:0,1,3:47.8,38.9", "Лівий шлуночок:1,8,3:58.1,43", "Тристулковий клапан:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["Ірис:6,3,4:11.3,57", "Рогівка:2,6,4:1.7,50.5", "Кришталик:1,4,6:19,51.3", "Сітківка:1,6,4:64.6,76.8", "Оптичний нерв:0,6,3:87.9,36.2", "передня камера:6,4,3:7.2,51.4", "Склисте тіло:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Ядро:5,3,2:57.3,75.5", "Ядерце:2,6,4:44.5,67.9,8", "Цитоплазма:1,4,6:93.08,50.09,9", "Клітинна мембрана:2,5,1:90,24,14", "Рибосома:2,1,3:80.929,75.844,14", "Мітохондрія:1,2,3:51.4,90.35,18", "Ендоплазматичний ретикулум:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Кисень:1,2,4:74.5,29,25", "Вуглець:2,0,4:74.5,57,25", "Водень:1,0,5:74.5,73.2,25", "Азот:1,0,2:74.5,83.5,25", "Кальцій:0,1,2:74.5,91.2,25", "Фосфор:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Який орган виробляє жовч, необхідну для травлення?:0,7,6,8", "Яка перша частина травного тракту отримує їжу і виробляє слину?:1,2,6,5", "Через який орган їжа проходить із глотки в шлунок?:2,6,9,7", "Який орган є останньою частиною травної системи?:3,4,7,8", "Де відбувається найбільше поглинання поживних речовин і мінералів з їжі?:4,5,3,0", "Який орган виділяє травні ферменти та шлункову кислоту для сприяння перетравленню їжі?:5,4,7,3", "Як називається частина горла за ротовою і носовою порожниною?:6,2,9,8", "Де зберігається і концентрується жовч перед тим, як вона потрапляє в тонку кишку?:7,6,9,8", "Звідки виділяється інсулін?:8,0,7,6", "Який орган розташований у нижній правій частині живота?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Яка структура кістки утворює голову?:0,1,9,7", "Що також називають плечовою кісткою?:1,9,11,6", "Що таке напівтверда кістково-хрящова структура, яка оточує грудну порожнину?:2,7,8,11", "Яка визначальна характеристика хребетних тварин?:3,0,11,2", "Яка більша з двох кісток гомілки нижче коліна?:4,6,9,5", "Яка найдовша і найміцніша кістка у вашому тілі?:5,6,9,1", "Що таке довга кістка на руці, що проходить від плеча до ліктя?:6,5,1,7", "Що таке група з п’яти кісток кисті між фалангами та зап’ястям?:7,5,1,3", "З яких кісток складається зап&#39;ястя?:8,7,9,10", "Що таке скупчення семи суглобових кісток у кожній стопі?:9,7,8,1", "Що таке група з п’яти довгих кісток стопи?:10,8,7,4", "Що таке нижня частина тулуба?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Який м’яз утворює округлий контур людського плеча?:0,1,3,5", "Що таке великий м’яз, який лежить на передній частині надпліччя між плечем і ліктем?:1,0,2,3", "Який м’яз розташований на грудній клітці тіла людини?:2,3,5,1", "Що таке трикутний м’яз, розташований на задній частині шиї?:3,1,2,5", "Який м’яз є найбільшим з бічних м’язів живота?:4,1,2,0", "Яка найбільша з 4 м’язів переднього відділу гомілки?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Що таке м’язовий орган, який перекачує кров по кровоносних судинах кровоносної системи?:0,1,3,5", "Яка головна і найбільша артерія в організмі людини?:1,4,3,2", "Які вени дренують нирку?:2,5,4,1", "Які парні артерії забезпечують нирки кров’ю?:3,2,1,5", "Які вени несуть знекиснену кров від голови назад до серця?:4,2,5,1", "Що таке велика вена, розташована глибоко всередині стегна?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Що таке орган, який служить центром нервової системи?:0,1,2,5", "Яка головна особливість заднього мозку всіх хребетних?:1,5,0,2", "Що таке довга тонка трубчаста структура, що складається з нервової тканини?:2,1,3,4", "Що таке великий нерв, що проходить поряд з тазостегновим суглобом?:3,2,1,5", "Що таке гілка сідничного нерва?:4,5,2,1", "Що таке група тіл нейронів периферичної нервової системи?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Що таке м’язові складки, що оточують рот?:0,1,4,7", "Що таке м’ясисте розширення, яке висить над горлом?:1,4,0,7", "Що таке плоскі зуби в задній частині рота?:2,3,5,6", "Які передні зуби?:3,2,5,6", "Що таке м’язовий орган у роті?:4,5,6,1", "Які органи відіграють важливу роль в імунній системі?:5,1,4,0", "Що таке тонка горизонтальна кісткова пластинка, що складається з двох кісток лицьового скелета?:6,7,2,5", "Яка м’яка тканина є задньою частиною даху рота?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Яка найбільша з чотирьох великих часток мозку?:0,3,1,4", "Що знаходиться за вухами і є другою за величиною мочкою?:1,0,3,2", "Що бере участь у сприйнятті відчуттів, включаючи дотик, температуру, біль?:2,0,3,5", "Що таке зоровий центр обробки мозку?:3,0,1,4", "Що відіграє важливу роль у контролі балансу?:4,5,0,1", "Що допомагає контролювати частоту серцевих скорочень і дихання?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Яка видима частина вуха знаходиться поза головою?:0,3,6,2", "Що таке шлях, що проходить від зовнішнього вуха до середнього?:1,2,3,0", "Що таке тонкий клапоть шкіри, який туго натягується, як барабан, і вібрує, коли на нього потрапляє звук?:2,0,5,3", "Які три кістки в середньому вусі є одними з найменших кісток в тілі людини?:3,0,6,2", "Що нагадує панцир равлика?:4,2,0,6", "Що переносить слухову сенсорну інформацію від равлики внутрішнього вуха безпосередньо до мозку?:5,2,0,6", "Що ще називають слуховою трубою?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Яка головна і найбільша артерія в організмі людини?:0,3,8,6", "Яка вена несе кров від голови, шиї, рук і грудної клітки назад до серця?:1,3,0,2", "Яка вена несе кров від нижньої частини тіла назад до серця?:2,1,0,3", "Яка верхня камера, через яку кров надходить у шлуночки серця?:3,5,6,2", "Яка камера серця отримує кров, насичену киснем з легенів?:4,3,6,8", "Який клапан розділяє дві камери лівої частини серця?:5,8,7,3", "Що таке м’язова камера, яка перекачує кров із серця в кровоносну систему?:6,5,8,2", "Яка одна з чотирьох камер серця?:7,0,1,2", "Його роль полягає в запобіганні зворотному току крові з правого шлуночка в праве передсердя.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Що таке тонка структура в оці, що відповідає за контроль діаметра і розміру зіниці?:0,1,3,2", "Яка прозора передня частина ока закриває райдужну оболонку?:1,2,3,0", "Що таке прозора структура в оці, яка допомагає заломлювати світло, щоб сфокусуватися на сітківці?:2,3,0,1", "Який внутрішній, світлочутливий шар тканини ока?:3,1,0,2", "Що передає візуальну інформацію від сітківки до мозку?:4,6,5,3", "Яка передня частина ока між рогівкою та райдужною оболонкою?:5,6,2,3", "Яка очна камера розташована позаду кришталика і перед зоровим нервом?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Що знаходиться в середині клітини і містить ДНК, розташовану в хромосомах?:0,1,2,3", "Яка область всередині клітини займається утворенням клітинних рибосом?:1,2,3,4", "Що таке драглиста рідина, яка заповнює внутрішню частину клітини?:2,3,4,5", "Що захищає клітину від зовнішнього середовища?:3,4,2,1", "Яка структура клітини виробляє білок?:4,3,2,1", "Що перетворює хімічну енергію в форму енергії, яку може використовувати клітина?:5,4,3,2", "Яка транспортна система еукаріотичної клітини?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Що використовується для окислення нашої їжі в процесі клітинного дихання, вивільняючи при цьому енергія?:0,1,2,3", "Який елемент є другим за поширеністю в організмі людини?:1,2,3,4", "Що використовується для зволоження організму людини?:2,3,4,5", "Що використовується для утворення амінокислот в нашому організмі, які, у свою чергу, утворюють білки?:3,5,4", "Що використовується для побудови та підтримки міцних кісток?:4,0,1,2", "Що використовується для формування кісток і зубів?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Яке захворювання, при якому у вас запалюється печінка?:гепатит::", "Що таке захворювання, при якому паразит вражає шлунково-кишковий тракт людини?:Кишкові паразити::", "Яке захворювання, при якому запалюється підшлункова залоза?:панкреатит::", "Яке захворювання викликає розрив внутрішньої оболонки шлунка?:Виразка шлунка::", "Яке захворювання, при якому запалюється червоподібний відросток?:Апендицит::", "Яке захворювання, при якому запалюється внутрішня оболонка шлунка?:Гастрит::", "Яке захворювання викликає набряк вен у нижній частині прямої кишки?:Геморой::", "Що таке тверді родовища мінералів і солей?:Камені в нирках::", "Які рубці на печінці викликані тривалим пошкодженням печінки?:цироз печінки::", "Який тип запального захворювання кишечника?:хвороба Крона::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Яке захворювання викликає біль і запалення в суглобі?:артрит::", "Що таке розрив безперервності кістки?:Перелом кістки::", "Яка хвороба послаблює кістки, роблячи їх крихкими і частіше ламаються?:Остеопороз::", "Яке захворювання викликає викривлення хребта вбік?:сколіоз::", "Який тип артриту викликає раптовий, сильний біль у суглобах?:Подагра::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Яке захворювання викликає прогресуючу слабкість і втрату м’язової маси?:м'язова дистрофія::", "Яке захворювання виникає через недостатню фізичну активність?:м'язова атрофія::", "Яке захворювання викликає запалення або подразнення сухожилля?:тендиніт::", "Що таке раптове та мимовільне скорочення одного з ваших м’язів?:м'язові судоми::", "Що відбувається, коли ваші м’язи перенапружені або розірвані?:розрив м’язів::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Який тип раку починається в клітинах, що є частиною імунної системи організму?:Лімфома::", "Який тип раку зазвичай починається в кістковому мозку?:Лейкемія::", "Що викликається тривалим впливом дуже низьких температур?:Гіпотермія::", "Що таке затвердіння артерій, викликане поступовим накопиченням бляшок?:Атеросклероз::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Що таке гостре запалення захисних оболонок головного та спинного мозку?:менінгіт::", "Яке захворювання може вразити ваш головний і спинний мозок і спричинити проблеми із зором, рівновагою, контролем м’язів?:Розсіяний склероз::", "Що таке порушення мозку, яке призводить до тремтіння, скутості та труднощів з ходьбою, рівновагою та координацією?:хвороба Паркінсона::", "Чим характерні множинні рухові тики та хоча б один голосовий тик?:Синдром Туретта::", "Що таке невиліковне, спадкове захворювання мозку, яке пошкоджує клітини мозку?:Хвороба Хантінгтона::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Що таке серйозна інфекція ясен, яка пошкоджує м’які тканини і може зруйнувати кістку, яка підтримує ваші зуби?:Пародонтит::", "Яка легка форма захворювання ясен викликає подразнення, почервоніння та набряк ясен?:гінгівіт::", "Які постійно пошкоджені ділянки на твердій поверхні ваших зубів?:Карієс::", "Що таке інфекція мигдалин у задній частині горла?:Тонзиліт::", "Що станеться, якщо тканина, з якої складається губа, не з’єднається повністю до народження?:Заяча губа::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Який розлад мозку руйнує пам’ять і навички мислення і, зрештою, здатність виконувати найпростіші завдання?:хвороба Альцгеймера::", "Що таке незвичайний, але серйозний стан, при якому запалюється мозок?:Енцефаліт::", "Що таке розлад головного болю, що характеризується повторюваними головними болями від середньої до сильної?:мігрень::", "Яке захворювання вражає мозок і викликає часті судоми?:епілепсія::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Що відбувається, коли вірус або бактерія спричиняють запалення в області за барабанною перетинкою?:Отит::", "Що означає повна чи часткова нездатність чути звуки?:Приглухуватість::", "У якому стані ви чуєте звуки, коли немає зовнішнього джерела звуків?:Шум у вухах::", "Який розлад внутрішнього вуха може призвести до запаморочення (вертиго) і втрати слуху?:хвороба Меньєра::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Що таке біль у грудях, викликаний зниженням припливу крові до серцевих м’язів?:Ангіна::", "Який артеріальний тиск вище норми?:Гіпертонія::", "Що відбувається, коли приплив крові до коронарної артерії серця зменшується або припиняється?:Інфаркт міокарда::", "Який серйозний стан, при якому серце не качає кров так ефективно, як повинно було б?:Застійна серцева недостатність::", "Що означає високий рівень холестерину в крові?:Гіперхолестеринемія::", "Що таке аномалія серцевого ритму?:Аритмія::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Що таке каламутна ділянка в кришталику ока, що призводить до зниження зору?:катаракта::", "Що таке захворювання очей, викликане інфекцією чи алергією?:Кон'юнктивіт::", "Що таке захворювання очей, при якому зоровий нерв, який з’єднує око з мозком, пошкоджується?:глаукома::", "Що таке розлад зору, при якому мозок не в змозі повністю обробити сигнали з одного ока і з часом надає перевагу другому оку?:Амбліопія::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Який тип раку може включати ущільнення в грудях або зміну форми грудей?:Рак молочної залози::", "Який найпоширеніший тип раку вражає тільки чоловіків?:Рак простати::", "Який тип раку, при якому клітини товстої або прямої кишки ростуть неконтрольовано?:Колоректальний рак::", "Який тип раку викликається тривалим курінням?:Рак легенів::", "Який тип раку викликається надмірним впливом ультрафіолетових променів сонця?:Рак шкіри::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Як називається рівень кисню в крові нижче норми, зокрема в артеріях?:Гіпоксемія::", "Як називається рівень кальцію в крові нижче норми?:Гіпокальціємія::", "Як називається рівень кальцію в крові вище норми?:Гіперкальціємія::", "Як називається рівень фосфату в крові нижче норми?:гіпофосфатемія::", "Як називається рівень фосфату в крові вище норми?:Гіперфосфатемія::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Пожовтіння шкіри та білків очей:гепатит:3,4,5:", "Висип або свербіж навколо прямої кишки:Кишкові паразити:2,7,8:", "Помірний або сильний біль у животі, який може поширюватися на спину:панкреатит:1,3,4:", "Сильний біль у животі:Виразка шлунка:6,7,8:", "Раптовий біль, що починається з правого боку внизу живота:Апендицит:0,3,7:", "Нудота або періодичне розлад шлунка:Гастрит:4,2,1:", "Сильний свербіж навколо ануса:Геморой:0,2,3:", "Біль або печіння під час сечовипускання:Камені в нирках:3,9,1:", "Пожовтіння шкіри та білків очей:цироз печінки:7,5,4:", "Кров в калі:хвороба Крона:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["болі в суглобах:артрит:1,2,3:", "негайний, сильний біль:Перелом кістки:2,3:", "Втрата висоти з часом:Остеопороз:1,3,4:", "помітно вигнутий хребет:сколіоз:0,1,2:", "червона, блискуча шкіра над ураженим суглобом:Подагра:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Великі литкові м’язи:м'язова дистрофія:2,3,4:", "Одна рука або одна нога менше за іншу:м'язова атрофія:2,3,4:", "біль у сухожиллі, яка посилюється під час руху:тендиніт:1,3,4:", "Раптовий, різкий біль:м'язові судоми:1,2:", "раптовий біль, що посилюється під час скорочення м’яза:розрив м’язів:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Безболісне збільшення лімфатичних вузлів на шиї, пахв або паху:Лімфома:2,3:", "Набрякання лімфатичних вузлів, збільшення печінки або селезінки:Лейкемія:2,3:", "Тремтіння:Гіпотермія:0,1:", "Оніміння або слабкість в руках або ногах:Атеросклероз:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Раптова висока температура, сильний головний біль, який виглядає відмінно від звичайного:менінгіт:1,2,3:", "сліпота на одне око:Розсіяний склероз:0,3,4:", "Тремтіння в руках:хвороба Паркінсона:0,3,4:", "рухові тики:Синдром Туретта:0,1,4:", "труднощі з концентрацією уваги і провали в пам&#39;яті:Хвороба Хантінгтона:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Червоні або набряклі ясна:Пародонтит:2,3,4:", "Червоні або набряклі ясна:гінгівіт:2,3,4:", "Зубний біль:Карієс:0,4,3:", "проблеми з ковтанням:Тонзиліт:0,2,4:", "Деформації верхньої щелепи:Заяча губа:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["рідина, що витікає з вуха:Отит:1,2,3:", "Втрата слуху:Приглухуватість:0,2,3:", "дзвін у вухах:Шум у вухах:0,1,3:", "запаморочення:хвороба Меньєра:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Затуманений зір:катаракта:1,2,3:", "Рожевий або червоний колір в білку ока:Кон'юнктивіт:0,2,3:", "інтенсивний біль в очах:глаукома:0,1,3:", "Погане сприйняття глибини і периферичний зір:Амбліопія:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Нова шишка в грудях або під пахвою:Рак молочної залози:1,2,3:", "Кров в сечі:Рак простати:2,3,4:", "Зміна звичок кишечника:Колоректальний рак:1,3,4:", "кашель, який не проходить через 2-3 тижні:Рак легенів:1,2,4:", "Родимка, яка змінює колір, розмір або кровоточить:Рак шкіри:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Синюватий колір шкіри, нігтів і губ:Гіпоксемія:1,2,3:", "Посмикування рук, обличчя та ніг:Гіпокальціємія:0,2,4:", "Частіше сечовипускання і спрага:Гіперкальціємія:0,1:", "ослаблення кісток:гіпофосфатемія:0,4:", "м&#39;язові судоми або спазми:Гіперфосфатемія:0,1:"]);
  }

  void addVI(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.vi;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["Gan:1,2,3:29.2,45", "Miệng:4,2,9:28.1,81.6", "Thực quản:1,8,5:48.6,58.6", "Ruột già:4,2,6:20.5,21", "Ruột non:8,7,1:52.4,19", "Dạ dày:4,6,7:66,41", "Cổ họng:5,2,9:48.6,81", "Túi mật:6,9,4:31.3,39.6", "Tuyến tụy:2,1,0:50,35.1", "Ruột thừa:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["Sọ:11,8,6:48,97", "Xương vai:5,4,3:61.1,80.2", "Xương sườn:11,7,0:56,74.1", "Cột sống:8,10,1:45.9,65.2", "xương ống chân:5,9,3:51.4,23.6", "xương đùi:4,10,7:54.9,35.5", "Xương cánh tay:2,7,9:69.1,66.2", "Xương móc:6,0,1:81.3,44.8", "Xương ống cổ tay:5,4,2:77.1,48.7", "xương cổ chân:4,3,1:49.3,6.9", "phần giữa bàn chân:0,3,5:54.2,2.8", "Xương chậu:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["cơ hình tam giác:4,1,5:65.3,80.2", "Bắp tay:5,0,4:67.3,71.5", "Cơ ngực:5,0,4:52.5,76.4", "Hình thang:1,5,4:51.4,85.5", "Xiên ngoài bụng:1,5,0:54.2,65.9", "Tibialis trước:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["Tim:4,2,5:65.3,73", "Động mạch chủ:4,2,5:62.9,77.6", "Tĩnh mạch thận:0,4,5:57.3,59.1", "Động mạch thận:0,5,4:61.5,59.1", "Tĩnh mạch cảnh:0,2,5:60.4,86.1", "Tĩnh mạch đùi:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["Não:5,4,3:50.4,96.8", "Tiểu não:5,4,3:56,92.6", "Tủy sống:0,4,3:50.7,86.8", "Dây thần kinh tọa:0,4,5:59.4,37.6", "Thần kinh chày:1,5,3:61.1,19.4", "Hạch thần kinh:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["Môi:1,2,4:61.4,96.6", "lưỡi gà:6,2,0:48.6,51.8", "Răng hàm:0,6,1:76.1,33", "Răng cửa:0,4,1:50.4,83", "Lưỡi:7,2,0:48.2,27.6", "Amidan:4,0,6:69.5,46.8", "vòm miệng cứng:1,2,0:48.6,73.8", "vòm miệng mềm:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["Thùy trán:1,2,4:25,58.5", "Thùy thái dương:0,2,3:51.2,42.2", "Thùy đỉnh:0,1,3:66,69", "Thùy chẩm:0,1,2:91,46", "Tiểu não:1,2,0:72.8,26.1", "Thân não:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["vành tai:1,2,4:8,31", "Ống tai:0,2,6:33.5,42.1", "Trống tai:1,5,6:55.6,42", "xương nhỏ:1,0,6:54.3,52.9", "Nam Kỳ:6,1,5:75.8,45.7", "Dây thần kinh thính giác:6,2,1:91.8,48", "Ống Eustachian:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["Động mạch chủ:8,6,3:51.7,84.7", "tĩnh mạch chủ trên:6,7,4:27.3,92", "tĩnh mạch chủ dưới:1,4,3:27.8,6.8", "Tâm nhĩ phải:4,7,0:31,54.4", "Tâm nhĩ trái:7,6,0:59.6,55.5", "Van hai lá:8,2,0:69.5,43.7", "Tâm thất phải:0,1,3:47.8,38.9", "Tâm thất trái:1,8,3:58.1,43", "Van ba lá:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["tròng đen:6,3,4:11.3,57", "giác mạc:2,6,4:1.7,50.5", "thủy tinh thể:1,4,6:19,51.3", "võng mạc:1,6,4:64.6,76.8", "thần kinh thị giác:0,6,3:87.9,36.2", "Khoang phía trước:6,4,3:7.2,51.4", "Pha lê dịch:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["Hạt nhân:5,3,2:57.3,75.5", "Hạt nhân:2,6,4:44.5,67.9,8", "Tế bào chất:1,4,6:93.08,50.09,9", "Màng tế bào:2,5,1:90,24,14", "Ribosome:2,1,3:80.929,75.844,14", "Ti thể:1,2,3:51.4,90.35,18", "Lưới nội chất:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["Oxy:1,2,4:74.5,29,25", "Carbon:2,0,4:74.5,57,25", "Hydro:1,0,5:74.5,73.2,25", "Nitơ:1,0,2:74.5,83.5,25", "Canxi:0,1,2:74.5,91.2,25", "Phốtpho:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["Cơ quan nào sản xuất mật cần thiết cho quá trình tiêu hóa?:0,7,6,8", "Phần đầu tiên của ống sinh vật nhận thức ăn và sản xuất nước bọt là gì?:1,2,6,5", "Thức ăn từ yết hầu xuống dạ dày qua cơ quan nào?:2,6,9,7", "Phần cuối cùng của hệ tiêu hóa là cơ quan nào?:3,4,7,8", "Quá trình hấp thụ chất dinh dưỡng và chất khoáng từ thức ăn diễn ra ở đâu?:4,5,3,0", "Cơ quan nào tiết ra enzim tiêu hoá và axit dịch vị để hỗ trợ quá trình tiêu hoá thức ăn?:5,4,7,3", "Bộ phận của họng nằm sau miệng và khoang mũi tên là gì?:6,2,9,8", "Mật được lưu trữ và cô đặc ở đâu trước khi được thải vào ruột non?:7,6,9,8", "Insulin được tiết ra từ đâu?:8,0,7,6", "Cơ quan nào nằm ở vùng bụng dưới bên phải?:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["Cấu trúc xương tạo nên đầu là gì?:0,1,9,7", "Cái gì còn được gọi là xương vai?:1,9,11,6", "Cấu trúc sụn và xương nửa cứng bao quanh khoang ngực là gì?:2,7,8,11", "Đặc điểm xác định của động vật có xương sống là gì?:3,0,11,2", "Xương nào lớn hơn trong hai xương ở cẳng chân dưới đầu gối?:4,6,9,5", "Xương dài nhất và khỏe nhất trong cơ thể bạn là gì?:5,6,9,1", "Xương dài ở cánh tay chạy từ vai đến khuỷu tay là gì?:6,5,1,7", "Nhóm năm xương của bàn tay nằm giữa phalanges và cổ tay là gì?:7,5,1,3", "Những xương nào tạo nên cổ tay?:8,7,9,10", "Một cụm bảy xương khớp ở mỗi bàn chân là gì?:9,7,8,1", "Nhóm năm xương dài ở bàn chân là gì?:10,8,7,4", "Phần dưới của thân là gì?:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["Cơ tạo nên đường viền tròn của vai người là gì?:0,1,3,5", "Cơ lớn nằm ở mặt trước của cánh tay giữa vai và khuỷu tay là gì?:1,0,2,3", "Cơ nào nằm ở ngực của cơ thể con người?:2,3,5,1", "Cơ tam giác nằm ở mặt sau của cổ là gì?:3,1,2,5", "Cơ nào là cơ lớn nhất trong số các cơ ở bụng bên?:4,1,2,0", "Cơ nào lớn nhất trong 4 cơ ở ngăn trước của chân?:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["Cơ quan cơ bắp bơm máu qua các mạch máu của hệ tuần hoàn là gì?:0,1,3,5", "Động mạch chính và lớn nhất trong cơ thể con người là gì?:1,4,3,2", "Tĩnh mạch dẫn lưu thận là gì?:2,5,4,1", "Những động mạch ghép nối cung cấp máu cho thận là gì?:3,2,1,5", "Các tĩnh mạch đưa máu đã khử oxy từ đầu trở về tim là gì?:4,2,5,1", "Một tĩnh mạch lớn nằm sâu trong đùi là gì?:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["Cơ quan nào đóng vai trò là trung tâm của hệ thần kinh?:0,1,2,5", "Đặc điểm chính của não sau của tất cả các động vật có xương sống là gì?:1,5,0,2", "Cấu trúc hình ống dài, mỏng, được tạo thành từ mô thần kinh là gì?:2,1,3,4", "Dây thần kinh lớn chạy dọc theo khớp háng là gì?:3,2,1,5", "Một nhánh của dây thần kinh tọa là gì?:4,5,2,1", "Nhóm tế bào thần kinh thuộc hệ thần kinh ngoại vi là gì?:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["Các nếp cơ bao quanh miệng là gì?:0,1,4,7", "Phần mở rộng thịt treo phía trên cổ họng là gì?:1,4,0,7", "Răng khểnh ở phía sau miệng là gì?:2,3,5,6", "Răng cửa là gì?:3,2,5,6", "Cơ quan cơ trong miệng là gì?:4,5,6,1", "Những cơ quan nào đóng vai trò quan trọng trong hệ thống miễn dịch?:5,1,4,0", "Thế nào là bản xương mỏng nằm ngang được tạo thành từ hai xương của khung xương mặt?:6,7,2,5", "Mô mềm cấu tạo phần sau của vòm miệng là gì?:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["Thùy nào lớn nhất trong bốn thùy chính của não?:0,3,1,4", "Cái gì nằm sau tai và là thùy lớn thứ hai?:1,0,3,2", "Điều gì liên quan đến nhận thức về cảm giác, bao gồm xúc giác, nhiệt độ, cảm giác đau?:2,0,3,5", "Trung tâm xử lý thị giác của não là gì?:3,0,1,4", "Điều gì đóng vai trò quan trọng trong việc kiểm soát cân bằng?:4,5,0,1", "Điều gì giúp kiểm soát nhịp tim và nhịp thở?:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["Phần nhìn thấy của tai nằm ngoài đầu là gì?:0,3,6,2", "Một con đường chạy từ tai ngoài đến tai giữa là gì?:1,2,3,0", "Vạt da mỏng căng như trống và rung lên khi âm thanh chạm vào là gì?:2,0,5,3", "Ba xương ở tai giữa nằm trong số những xương nhỏ nhất trong cơ thể con người là gì?:3,0,6,2", "Điều gì giống với vỏ của một con ốc?:4,2,0,6", "Điều gì mang thông tin cảm giác thính giác từ ốc tai của tai trong trực tiếp đến não?:5,2,0,6", "Cái gì còn được gọi là ống thính giác?:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["Động mạch chính và lớn nhất trong cơ thể con người là gì?:0,3,8,6", "Tĩnh mạch nào đưa máu từ đầu, cổ, cánh tay và ngực về tim?:1,3,0,2", "Tĩnh mạch nào đưa máu từ phần dưới cơ thể trở về tim?:2,1,0,3", "Khoang trên mà máu đi vào tâm thất của tim là gì?:3,5,6,2", "buồng tim nào nhận máu có oxy từ phổi?:4,3,6,8", "Van nào ngăn cách hai buồng tim bên trái?:5,8,7,3", "Buồng cơ bơm máu ra khỏi tim và vào hệ tuần hoàn là gì?:6,5,8,2", "Ngăn nào là một trong bốn ngăn của tim?:7,0,1,2", "Nó có vai trò là ngăn chặn dòng chảy ngược của máu từ tâm thất phải vào tâm nhĩ phải.:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["Cấu trúc mỏng trong mắt, chịu trách nhiệm kiểm soát đường kính và kích thước của đồng tử là gì?:0,1,3,2", "Phần trước trong suốt của mắt bao phủ mống mắt là gì?:1,2,3,0", "Cấu tạo trong suốt của mắt giúp khúc xạ ánh sáng được hội tụ trên võng mạc là gì?:2,3,0,1", "Lớp mô trong cùng, nhạy cảm với ánh sáng của mắt là gì?:3,1,0,2", "Cái gì truyền thông tin thị giác từ võng mạc đến não?:4,6,5,3", "Phần trước của mắt nằm giữa giác mạc và mống mắt là gì?:5,6,2,3", "Buồng mắt nào nằm sau thủy tinh thể và trước thần kinh thị giác?:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["Cái gì được tìm thấy ở giữa tế bào và nó chứa ADN được sắp xếp trong các nhiễm sắc thể?:0,1,2,3", "Khu vực nào trong tế bào liên quan đến việc sản xuất ribosome của tế bào?:1,2,3,4", "Chất lỏng sền sệt lấp đầy bên trong tế bào là gì?:2,3,4,5", "Cái gì bảo vệ tế bào khỏi môi trường bên ngoài?:3,4,2,1", "Cấu trúc tế bào tạo ra protein là gì?:4,3,2,1", "Điều gì biến đổi năng lượng hóa học thành một dạng năng lượng mà tế bào có thể sử dụng?:5,4,3,2", "Hệ thống vận chuyển của tế bào nhân thực là gì?:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["Chất gì được sử dụng để oxy hóa thức ăn của chúng ta, trong quá trình hô hấp tế bào, do đó giải phóng năng lượng?:0,1,2,3", "Nguyên tố phong phú thứ hai trong cơ thể con người là gì?:1,2,3,4", "Những gì được sử dụng để giữ cho cơ thể con người ngậm nước?:2,3,4,5", "Cái gì được sử dụng để tạo ra các axit amin trong cơ thể chúng ta mà lần lượt tạo ra protein?:3,5,4", "Những gì được sử dụng để xây dựng và duy trì xương chắc khỏe?:4,0,1,2", "Những gì được sử dụng trong sự hình thành của xương và răng?:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["Căn bệnh mà gan của bạn bị viêm là gì?:Viêm gan::", "Bệnh do ký sinh trùng lây nhiễm qua đường tiêu hóa ở người là bệnh gì?:Ký sinh trùng đường ruột::", "Căn bệnh mà tuyến tụy của bạn bị viêm là gì?:Viêm tụy::", "Bệnh gây vỡ lớp niêm mạc bên trong dạ dày là bệnh gì?:Loét dạ dày::", "Căn bệnh mà ruột thừa của bạn bị viêm là gì?:Viêm ruột thừa::", "Căn bệnh nào khiến lớp niêm mạc bên trong dạ dày của bạn bị viêm?:Viêm dạ dày::", "Bệnh gì gây ra sưng tĩnh mạch ở trực tràng dưới của bạn?:Bệnh trĩ::", "Cặn cứng được tạo thành từ khoáng chất và muối nào?:Sỏi thận::", "Gan bị sẹo do gan bị tổn thương lâu ngày là bệnh gì?:Xơ gan::", "Một loại bệnh viêm ruột là gì?:Bệnh Crohn::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["Bệnh gì gây đau và viêm ở khớp?:Viêm khớp::", "Sự phá vỡ tính liên tục của xương là gì?:Gãy xương::", "Bệnh gì làm yếu xương, dễ gãy và dễ gãy?:Loãng xương::", "Bệnh gì khiến cột sống bị cong vẹo sang một bên?:Vẹo cột sống::", "Loại viêm khớp gây đau khớp đột ngột, dữ dội là gì?:Bệnh Gout::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["Bệnh gì gây suy nhược dần dần và mất khối lượng cơ?:loạn dưỡng cơ bắp::", "Bệnh gì do lười vận động?:teo cơ::", "Bệnh gì gây ra tình trạng viêm hoặc kích ứng của gân?:viêm gân::", "Sự co lại đột ngột và không tự chủ của một trong các cơ của bạn là gì?:chuột rút cơ bắp::", "Điều gì xảy ra khi cơ của bạn bị căng quá mức hoặc bị rách?:đứt cơ::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["Loại ung thư bắt đầu từ các tế bào thuộc hệ thống miễn dịch của cơ thể là gì?:Lymphoma::", "Loại ung thư thường bắt đầu trong tủy xương là gì?:Bệnh bạch cầu::", "Nguyên nhân do tiếp xúc lâu với nhiệt độ quá lạnh là gì?:Hạ thân nhiệt::", "Tình trạng xơ cứng động mạch của bạn do mảng bám dần dần tích tụ là gì?:Xơ vữa động mạch::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["Tình trạng viêm cấp tính của màng bảo vệ bao phủ não và tủy sống là gì?:Viêm màng não::", "Căn bệnh nào có thể ảnh hưởng đến não và tủy sống của bạn, và có thể gây ra các vấn đề về thị lực, thăng bằng, kiểm soát cơ bắp?:Đa xơ cứng::", "Rối loạn não dẫn đến run, cứng và khó đi lại, thăng bằng và phối hợp là gì?:bệnh Parkinson::", "Đặc điểm của nhiều tic chuyển động và ít nhất một tic thanh âm là gì?:hội chứng Tourette::", "Rối loạn não không thể chữa khỏi, di truyền làm tổn thương tế bào não là gì?:bệnh Huntington::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["Nhiễm trùng nướu nghiêm trọng làm tổn thương mô mềm và có thể phá hủy xương nâng đỡ răng của bạn là gì?:Viêm nha chu::", "Một dạng bệnh nướu răng nhẹ gây kích ứng, đỏ và sưng nướu răng của bạn là gì?:viêm lợi::", "Những vùng bị tổn thương vĩnh viễn trên bề mặt cứng của răng là gì?:Sâu răng::", "Viêm amidan hốc mủ là bệnh gì?:Viêm amiđan::", "Điều gì xảy ra nếu các mô tạo nên môi không kết hợp hoàn toàn trước khi sinh?:Sứt môi::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["Rối loạn não nào phá hủy trí nhớ, kỹ năng tư duy và cuối cùng là khả năng thực hiện những công việc đơn giản nhất?:Bệnh Alzheimer::", "Tình trạng không phổ biến nhưng nghiêm trọng trong đó não bị viêm là gì?:Viêm não::", "Rối loạn đau đầu có đặc điểm là đau đầu tái phát từ mức độ trung bình đến nặng là gì?:Chứng đau nửa đầu::", "Căn bệnh ảnh hưởng đến não bộ và gây ra những cơn co giật thường xuyên là gì?:Động kinh::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["Điều gì xảy ra khi vi-rút hoặc vi khuẩn khiến vùng sau màng nhĩ bị viêm?:Viêm tai giữa::", "Điều gì đề cập đến việc không thể nghe được toàn bộ hoặc một phần âm thanh?:Điếc::", "Tình trạng mà bạn nghe được âm thanh khi không có nguồn âm thanh bên ngoài là gì?:Ù tai::", "Rối loạn tai trong có thể dẫn đến chóng mặt (chóng mặt) và mất thính giác là gì?:Bệnh Meniere::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["Đau ngực do giảm lượng máu đến cơ tim là bệnh gì?:Đau thắt ngực::", "Huyết áp cao hơn bình thường là bệnh gì?:Tăng huyết áp::", "Điều gì xảy ra khi lưu lượng máu giảm hoặc ngừng đến động mạch vành của tim?:Nhồi máu cơ tim::", "Tình trạng nghiêm trọng mà tim không bơm máu hiệu quả như bình thường là gì?:Suy tim sung huyết::", "Một từ để chỉ mức độ cao của cholesterol trong máu là gì?:Tăng cholesterol máu::", "Bất thường về nhịp tim là gì?:Rối loạn nhịp tim::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["Một vùng bị vẩn đục trong thủy tinh thể của mắt dẫn đến giảm thị lực là gì?:Đục thủy tinh thể::", "Tình trạng mắt do nhiễm trùng hoặc dị ứng là gì?:Viêm kết mạc::", "Tình trạng mắt mà dây thần kinh thị giác, nối mắt với não, bị tổn thương là gì?:Bệnh tăng nhãn áp::", "Rối loạn thị giác trong đó não không thể xử lý đầy đủ thông tin đầu vào từ một mắt và theo thời gian chuyển sang mắt còn lại?:Nhược thị::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["Loại ung thư có thể bao gồm một khối u trong vú hoặc thay đổi hình dạng vú là gì?:Ung thư vú::", "Loại ung thư phổ biến nhất chỉ ảnh hưởng đến nam giới là gì?:Ung thư tuyến tiền liệt::", "Loại ung thư mà các tế bào trong ruột kết hoặc trực tràng phát triển ngoài tầm kiểm soát là gì?:Ung thư đại trực tràng::", "Loại ung thư nào do hút thuốc lá lâu dài?:Ung thư phổi::", "Loại ung thư nào là do tiếp xúc quá nhiều với tia cực tím từ ánh nắng mặt trời?:Ung thư da::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["Mức oxy dưới mức bình thường trong máu của bạn được gọi là gì, cụ thể là trong các động mạch?:Hạ oxy máu::", "Mức canxi trong máu của bạn dưới mức bình thường được gọi là gì?:Hạ calci huyết::", "Mức canxi trên mức bình thường trong máu của bạn được gọi là gì?:Tăng calci huyết::", "Mức độ phốt phát dưới mức bình thường trong máu của bạn được gọi là gì?:giảm phosphate huyết::", "Mức độ phốt phát cao hơn bình thường trong máu của bạn được gọi là gì?:Tăng phốt phát huyết::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["Vàng da và tròng trắng mắt của bạn:Viêm gan:3,4,5:", "Phát ban hoặc ngứa xung quanh trực tràng:Ký sinh trùng đường ruột:2,7,8:", "Đau bụng từ vừa đến nặng có thể lan ra sau lưng:Viêm tụy:1,3,4:", "Đau bụng dữ dội:Loét dạ dày:6,7,8:", "Đau đột ngột bắt đầu ở bên phải của bụng dưới:Viêm ruột thừa:0,3,7:", "Buồn nôn hoặc đau bụng tái phát:Viêm dạ dày:4,2,1:", "Cực kỳ ngứa quanh hậu môn:Bệnh trĩ:0,2,3:", "Đau hoặc cảm giác nóng rát khi đi tiểu:Sỏi thận:3,9,1:", "Vàng da và tròng trắng mắt của bạn:Xơ gan:7,5,4:", "Máu trong phân:Bệnh Crohn:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["đau khớp:Viêm khớp:1,2,3:", "cơn đau dữ dội, tức thì:Gãy xương:2,3:", "Mất chiều cao theo thời gian:Loãng xương:1,3,4:", "xương sống cong rõ ràng:Vẹo cột sống:0,1,2:", "da đỏ, bóng trên khớp bị ảnh hưởng:Bệnh Gout:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["Bắp chân to:loạn dưỡng cơ bắp:2,3,4:", "Một cánh tay hoặc một chân nhỏ hơn chân kia:teo cơ:2,3,4:", "đau ở gân trở nên tồi tệ hơn khi bạn di chuyển:viêm gân:1,3,4:", "Một cơn đau đột ngột, sắc nét:chuột rút cơ bắp:1,2:", "cơn đau đột ngột trầm trọng hơn trong khi co cơ:đứt cơ:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["Sưng hạch bạch huyết không đau ở cổ, nách hoặc bẹn:Lymphoma:2,3:", "Sưng hạch bạch huyết, gan hoặc lá lách to:Bệnh bạch cầu:2,3:", "Rùng mình:Hạ thân nhiệt:0,1:", "Tê hoặc yếu ở cánh tay hoặc chân của bạn:Xơ vữa động mạch:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["Sốt cao đột ngột, đau đầu dữ dội có vẻ khác với bình thường:Viêm màng não:1,2,3:", "mù một mắt:Đa xơ cứng:0,3,4:", "Tay run:bệnh Parkinson:0,3,4:", "chuyển động tics:hội chứng Tourette:0,1,4:", "khó tập trung và trí nhớ mất hiệu lực:bệnh Huntington:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["Nướu đỏ hoặc sưng:Viêm nha chu:2,3,4:", "Nướu đỏ hoặc sưng:viêm lợi:2,3,4:", "Bệnh đau răng:Sâu răng:0,4,3:", "vấn đề nuốt:Viêm amiđan:0,2,4:", "Dị tật của hàm trên:Sứt môi:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["chất lỏng chảy ra từ tai:Viêm tai giữa:1,2,3:", "Mất thính giác:Điếc:0,2,3:", "một tiếng ồn ào trong tai:Ù tai:0,1,3:", "chóng mặt:Bệnh Meniere:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["Tầm nhìn có mây:Đục thủy tinh thể:1,2,3:", "Màu hồng hoặc đỏ trong lòng trắng của mắt:Viêm kết mạc:0,2,3:", "đau mắt dữ dội:Bệnh tăng nhãn áp:0,1,3:", "Nhận thức độ sâu và tầm nhìn ngoại vi kém:Nhược thị:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["Một khối u mới ở vú hoặc dưới cánh tay:Ung thư vú:1,2,3:", "Có máu trong nước tiểu:Ung thư tuyến tiền liệt:2,3,4:", "Thay đổi thói quen đi tiêu:Ung thư đại trực tràng:1,3,4:", "ho không biến mất sau 2 hoặc 3 tuần:Ung thư phổi:1,2,4:", "Nốt ruồi thay đổi về màu sắc, kích thước hoặc chảy máu:Ung thư da:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["Màu hơi xanh ở da, móng tay và môi:Hạ oxy máu:1,2,3:", "Co giật ở tay, mặt và chân:Hạ calci huyết:0,2,4:", "Đi tiểu thường xuyên hơn và khát:Tăng calci huyết:0,1:", "xương yếu đi:giảm phosphate huyết:0,4:", "chuột rút hoặc co thắt cơ:Tăng phốt phát huyết:0,1:"]);
  }

  void addZH(Map<Language, Map<CategoryDifficulty, List<Question>>> result,
      AnatomyGameQuestionConfig questionConfig) {
    var language = Language.zh;
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff0, //
        ["肝:1,2,3:29.2,45", "口:4,2,9:28.1,81.6", "食道:1,8,5:48.6,58.6", "大肠:4,2,6:20.5,21", "小肠:8,7,1:52.4,19", "胃:4,6,7:66,41", "咽:5,2,9:48.6,81", "胆囊:6,9,4:31.3,39.6", "胰腺:2,1,0:50,35.1", "阑尾:2,8,3:35.1,9.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff0, //
        ["头骨:11,8,6:48,97", "肩胛骨:5,4,3:61.1,80.2", "肋骨:11,7,0:56,74.1", "脊柱:8,10,1:45.9,65.2", "胫骨:5,9,3:51.4,23.6", "股骨:4,10,7:54.9,35.5", "肱骨:2,7,9:69.1,66.2", "掌骨:6,0,1:81.3,44.8", "腕骨:5,4,2:77.1,48.7", "跗骨:4,3,1:49.3,6.9", "跖骨:0,3,5:54.2,2.8", "骨盆:0,6,9:59,58.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff0, //
        ["三角肌:4,1,5:65.3,80.2", "二头肌:5,0,4:67.3,71.5", "胸肌:5,0,4:52.5,76.4", "斜方肌:1,5,4:51.4,85.5", "腹外斜:1,5,0:54.2,65.9", "胫骨前骨:1,0,3:59.7,21.8"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff0, //
        ["心脏:4,2,5:65.3,73", "主动脉:4,2,5:62.9,77.6", "肾静脉:0,4,5:57.3,59.1", "肾动脉:0,5,4:61.5,59.1", "颈静脉:0,2,5:60.4,86.1", "股静脉:0,2,4:67.4,37"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff0, //
        ["大脑:5,4,3:50.4,96.8", "小脑:5,4,3:56,92.6", "脊髓:0,4,3:50.7,86.8", "坐骨神经:0,4,5:59.4,37.6", "胫神经:1,5,3:61.1,19.4", "神经节:4,3,1:49,70"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff0, //
        ["嘴唇:1,2,4:61.4,96.6", "悬雍垂:6,2,0:48.6,51.8", "大臼齿:0,6,1:76.1,33", "门牙:0,4,1:50.4,83", "舌头:7,2,0:48.2,27.6", "扁桃体:4,0,6:69.5,46.8", "硬颚:1,2,0:48.6,73.8", "软腭:4,2,0:56.3,61"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff0, //
        ["额叶:1,2,4:25,58.5", "颞叶:0,2,3:51.2,42.2", "顶叶:0,1,3:66,69", "枕叶:0,1,2:91,46", "小脑:1,2,0:72.8,26.1", "脑干:1,2,0:63.3,17.6"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff0, //
        ["耳廓:1,2,4:8,31", "耳道:0,2,6:33.5,42.1", "耳鼓:1,5,6:55.6,42", "听小骨:1,0,6:54.3,52.9", "耳蜗:6,1,5:75.8,45.7", "听觉神经:6,2,1:91.8,48", "咽鼓管:5,1,3:77.3,28.3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff0, //
        ["主动脉:8,6,3:51.7,84.7", "上腔静脉:6,7,4:27.3,92", "下腔静脉:1,4,3:27.8,6.8", "右心房:4,7,0:31,54.4", "左心房:7,6,0:59.6,55.5", "二尖瓣:8,2,0:69.5,43.7", "右心室:0,1,3:47.8,38.9", "左心室:1,8,3:58.1,43", "三尖瓣:1,0,5:41,27"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff0, //
        ["鸢尾花:6,3,4:11.3,57", "角膜:2,6,4:1.7,50.5", "晶状体:1,4,6:19,51.3", "视网膜:1,6,4:64.6,76.8", "视神经:0,6,3:87.9,36.2", "前房:6,4,3:7.2,51.4", "玻璃体:1,4,3:49.3,65"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff0, //
        ["细胞核:5,3,2:57.3,75.5", "核仁:2,6,4:44.5,67.9,8", "细胞质:1,4,6:93.08,50.09,9", "细胞膜:2,5,1:90,24,14", "核糖体:2,1,3:80.929,75.844,14", "线粒体:1,2,3:51.4,90.35,18", "内质网:2,4,1:63.9,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff0, //
        ["氧气:1,2,4:74.5,29,25", "碳:2,0,4:74.5,57,25", "氢:1,0,5:74.5,73.2,25", "氮:1,0,2:74.5,83.5,25", "钙:0,1,2:74.5,91.2,25", "磷:1,2,0:74.5,96.82,25"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff1, //
        ["什么器官产生消化所需的胆汁？:0,7,6,8", "消化道的第一部分接受食物并产生唾液是什么？:1,2,6,5", "食物从咽部通过哪个器官进入胃部？:2,6,9,7", "消化系统的最后一部分是什么器官？:3,4,7,8", "从食物中吸收最多的营养素和矿物质的地方在哪里？:4,5,3,0", "什么器官分泌消化酶和胃酸来帮助食物消化？:5,4,7,3", "嘴巴和鼻腔后面的喉咙部分叫什么？:6,2,9,8", "胆汁在释放到小肠之前在哪里储存和浓缩？:7,6,9,8", "胰岛素是从哪里分泌的？:8,0,7,6", "什么器官位于右下腹部？:9,0,7,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff1, //
        ["构成头部的骨骼结构是什么？:0,1,9,7", "什么也被称为肩骨？:1,9,11,6", "什么是围绕胸腔的半刚性骨和软骨结构？:2,7,8,11", "脊椎动物的定义特征是什么？:3,0,11,2", "膝盖以下腿的两块骨头中哪块骨头较大？:4,6,9,5", "你身体里最长、最强壮的骨头是什么？:5,6,9,1", "从肩膀到肘部的手臂长骨是什么？:6,5,1,7", "指骨和手腕之间的手的五块骨头是什么？:7,5,1,3", "什么骨头组成了手腕？:8,7,9,10", "每只脚的七块关节骨是什么？:9,7,8,1", "什么是足部的五根长骨？:10,8,7,4", "躯干的下半部分是什么？:11,6,3,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff1, //
        ["构成人体肩部圆形轮廓的肌肉是什么？:0,1,3,5", "位于肩部和肘部之间的上臂前部的一块大肌肉是什么？:1,0,2,3", "人体胸部位于哪块肌肉？:2,3,5,1", "位于颈部后侧的三角肌是什么？:3,1,2,5", "侧腹肌中哪块肌肉最大？:4,1,2,0", "腿前部的 4 块肌肉中最大的是哪块？:5,3,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff1, //
        ["什么是通过循环系统血管泵送血液的肌肉器官？:0,1,3,5", "人体主要和最大的动脉是什么？:1,4,3,2", "引流肾的静脉是什么？:2,5,4,1", "为肾脏供血的成对动脉是什么？:3,2,1,5", "将脱氧血液从头部带回心脏的静脉是什么？:4,2,5,1", "位于大腿深处的大静脉是什么？:5,2,1,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff1, //
        ["充当神经系统中心的器官是什么？:0,1,2,5", "所有脊椎动物后脑的主要特征是什么？:1,5,0,2", "什么是由神经组织组成的细长管状结构？:2,1,3,4", "沿着髋关节延伸的大神经是什么？:3,2,1,5", "什么是坐骨神经的一个分支？:4,5,2,1", "什么是周围神经系统中的一组神经元细胞体？:5,1,0,2"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff1, //
        ["什么是环绕嘴巴的肌肉褶皱？:0,1,4,7", "挂在喉咙上方的肉质延伸是什么？:1,4,0,7", "什么是口腔后部的扁平牙齿？:2,3,5,6", "什么是门牙？:3,2,5,6", "什么是口腔中的肌肉器官？:4,5,6,1", "哪些器官在免疫系统中起重要作用？:5,1,4,0", "什么是由面部骨骼的两块骨头组成的薄水平骨板？:6,7,2,5", "构成上颚后部的软组织是什么？:7,5,1,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff1, //
        ["大脑四大叶中最大的是哪个？:0,3,1,4", "什么位于耳朵后面并且是第二大耳垂？:1,0,3,2", "包括触觉、温度、疼痛在内的感觉感知涉及什么？:2,0,3,5", "大脑的视觉处理中心是什么？:3,0,1,4", "什么在平衡控制中起重要作用？:4,5,0,1", "什么有助于控制心率和呼吸频率？:5,0,4,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff1, //
        ["耳朵在头外的可见部分是什么？:0,3,6,2", "从外耳到中耳的通路是什么？:1,2,3,0", "什么是薄薄的皮瓣，像鼓一样绷得紧紧的，当声音响起时会振动？:2,0,5,3", "中耳中的三块骨头是人体最小的骨头之一？:3,0,6,2", "什么类似于蜗牛的壳？:4,2,0,6", "是什么将听觉感觉信息从内耳的耳蜗直接传送到大脑？:5,2,0,6", "什么也被称为听管？:6,1,4,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff1, //
        ["人体主要和最大的动脉是什么？:0,3,8,6", "哪条静脉将血液从头部、颈部、手臂和胸部输送回心脏？:1,3,0,2", "哪条静脉将下半身的血液输送回心脏？:2,1,0,3", "血液进入心室的上腔是什么？:3,5,6,2", "哪个心腔从肺部接收含氧血液？:4,3,6,8", "什么瓣膜将心脏左侧的两个腔室分开？:5,8,7,3", "将血液从心脏泵出并进入循环系统的肌肉腔是什么？:6,5,8,2", "心脏的四个腔室之一是哪一个？:7,0,1,2", "它的作用是防止血液从右心室回流到右心房。:8,2,5,4"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff1, //
        ["眼睛中负责控制瞳孔直径和大小的薄结构是什么？:0,1,3,2", "覆盖虹膜的透明前部是什么？:1,2,3,0", "什么是眼睛中的透明结构，有助于折射光线以聚焦在视网膜上？:2,3,0,1", "眼睛最里面的感光层是什么？:3,1,0,2", "什么将视觉信息从视网膜传输到大脑？:4,6,5,3", "角膜和虹膜之间的眼睛前部是什么？:5,6,2,3", "什么眼腔位于晶状体后面和视神经前面？:6,5,3,0"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff1, //
        ["在细胞中间发现了什么，它包含排列在染色体中的 DNA？:0,1,2,3", "细胞内的哪个区域与产生细胞核糖体有关？:1,2,3,4", "填充细胞内部的凝胶状液体是什么？:2,3,4,5", "是什么保护细胞免受外部环境的影响？:3,4,2,1", "产生蛋白质的细胞结构是什么？:4,3,2,1", "是什么将化学能转化为细胞可以使用的能量形式？:5,4,3,2", "真核细胞的运输系统是什么？:6,5,0,1"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff1, //
        ["什么是用来氧化我们的食物，在细胞呼吸过程中，从而释放能量？:0,1,2,3", "人体中含量第二高的元素是什么？:1,2,3,4", "什么是用来保持人体水分的？:2,3,4,5", "我们体内用什么来制造氨基酸，进而制造蛋白质？:3,5,4", "什么用于构建和维持强壮的骨骼？:4,0,1,2", "什么用于形成骨骼和牙齿？:5,1,2,3"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff2, //
        ["什么是肝脏发炎的疾病？:肝炎::", "寄生虫感染人类胃肠道的疾病是什么？:肠道寄生虫::", "什么是胰腺发炎的疾病？:胰腺炎::", "导致胃内壁破裂的疾病是什么？:胃溃疡::", "阑尾发炎是什么病？:阑尾炎::", "什么是胃内壁发炎的疾病？:胃炎::", "什么疾病会导致直肠下段静脉肿胀？:痔疮::", "什么是由矿物质和盐构成的硬质沉积物？:肾结石::", "长期肝损伤引起的肝脏瘢痕是什么？:肝硬化::", "什么是炎症性肠病？:克罗恩病::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff2, //
        ["什么疾病会导致关节疼痛和发炎？:关节炎::", "什么是骨骼连续性的中断？:骨折::", "什么疾病会削弱骨骼，使它们变得脆弱并且更容易折断？:骨质疏松症::", "什么疾病会导致脊柱侧弯？:脊柱侧弯::", "什么类型的关节炎会导致突然的、严重的关节疼痛？:痛风::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff2, //
        ["什么疾病会导致进行性虚弱和肌肉质量下降？:肌营养不良症::", "缺乏运动会导致什么疾病？:肌肉萎缩::", "什么疾病会导致肌腱发炎或发炎？:肌腱炎::", "什么是你的一块肌肉突然和不自主的收缩？:肌肉痉挛::", "当你的肌肉过度拉伸或撕裂时会发生什么？:肌肉破裂::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff2, //
        ["什么是从作为身体免疫系统一部分的细胞开始的癌症？:淋巴瘤::", "什么是通常从骨髓开始的癌症？:白血病::", "长时间暴露在极冷的温度下会导致什么？:低温::", "什么是由逐渐形成的斑块引起的动脉硬化？:动脉粥样硬化::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff2, //
        ["什么是覆盖大脑和脊髓的保护膜的急性炎症？:脑膜炎::", "什么疾病会影响您的大脑和脊髓，并可能导致视力、平衡、肌肉控制问题？:多发性硬化症::", "什么是导致颤抖、僵硬和行走、平衡和协调困难的大脑疾病？:帕金森病::", "多重运动抽动和至少一种声音抽动的特征是什么？:抽动秽语综合征::", "什么是损害脑细胞的无法治愈的遗传性脑部疾病？:亨廷顿氏病::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff2, //
        ["什么是严重的牙龈感染，会损害软组织并破坏支撑牙齿的骨骼？:牙周炎::", "引起牙龈发炎、发红和肿胀的轻度牙龈疾病是什么？:牙龈炎::", "牙齿坚硬表面的永久受损区域是什么？:蛀牙::", "什么是喉咙后部的扁桃体感染？:扁桃体炎::", "如果构成嘴唇的组织在出生前没有完全接合会发生什么？:唇裂::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff2, //
        ["什么脑部疾病会破坏记忆力和思维能力，并最终破坏执行最简单任务的能力？:阿尔茨海默氏病::", "什么是大脑发炎的罕见但严重的情况？:脑炎::", "以中度至重度反复性头痛为特征的头痛疾病是什么？:偏头痛::", "什么是影响大脑并导致频繁癫痫发作的疾病？:癫痫::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff2, //
        ["当病毒或细菌导致鼓膜后面的区域发炎时会发生什么？:中耳炎‎::", "什么是指完全或部分无法听到声音？:耳聋::", "当没有声音的外部来源时，您听到声音的情况是什么？:耳鸣::", "什么是内耳疾病会导致头晕（眩晕）和听力损失？:梅尼埃病::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff2, //
        ["什么是由流向心肌的血流量减少引起的胸痛？:心绞痛::", "什么是血压高于正常值？:高血压::", "当流向心脏冠状动脉的血流减少或停止时会发生什么？:心肌梗塞::", "什么是心脏不能有效泵血的严重疾病？:充血性心力衰竭::", "什么是血液中高水平的胆固醇？:高胆固醇血症::", "什么是心律异常？:心律失常::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff2, //
        ["什么是导致视力下降的晶状体混浊区域？:白内障::", "什么是由感染或过敏引起的眼部疾病？:结膜炎::", "连接眼睛和大脑的视神经受损是什么眼睛状况？:青光眼::", "什么是视觉障碍，其中大脑无法完全处理来自一只眼睛的输入并且随着时间的推移偏爱另一只眼睛？:弱视::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff2, //
        ["什么类型的癌症可能包括乳房肿块或乳房形状改变？:乳腺癌::", "仅影响男性的最常见癌症类型是什么？:前列腺癌::", "什么是结肠或直肠细胞失控生长的癌症类型？:大肠癌::", "长期吸烟会导致什么类型的癌症？:肺癌::", "过度暴露于来自太阳的紫外线会导致哪种癌症？:皮肤癌::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff2, //
        ["什么是血液中低于正常水平的氧气，特别是在动脉中？:低氧血症::", "什么是血液中低于正常水平的钙？:低钙血症::", "什么是血液中高于正常水平的钙？:高钙血症::", "什么是血液中低于正常水平的磷酸盐？:低磷血症::", "什么是血液中高于正常水平的磷酸盐？:高磷血症::"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat0, //
        questionConfig.diff3, //
        ["皮肤和眼白变黄:肝炎:3,4,5:", "直肠周围出现皮疹或瘙痒:肠道寄生虫:2,7,8:", "中度至重度腹痛，可能会扩散到您的背部:胰腺炎:1,3,4:", "严重的胃痛:胃溃疡:6,7,8:", "从下腹部右侧开始的突然疼痛:阑尾炎:0,3,7:", "恶心或反复胃部不适:胃炎:4,2,1:", "肛门周围极度瘙痒:痔疮:0,2,3:", "排尿时疼痛或烧灼感:肾结石:3,9,1:", "皮肤和眼白变黄:肝硬化:7,5,4:", "便血:克罗恩病:2,7,8:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat1, //
        questionConfig.diff3, //
        ["关节疼痛:关节炎:1,2,3:", "立即的剧烈疼痛:骨折:2,3:", "随着时间的推移身高下降:骨质疏松症:1,3,4:", "明显弯曲的脊椎:脊柱侧弯:0,1,2:", "受影响关节上的红色、有光泽的皮肤:痛风:1,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat2, //
        questionConfig.diff3, //
        ["大小腿肌肉:肌营养不良症:2,3,4:", "一只手臂或一只腿比另一只小:肌肉萎缩:2,3,4:", "移动时肌腱疼痛加剧:肌腱炎:1,3,4:", "突然的剧烈疼痛:肌肉痉挛:1,2:", "肌肉收缩时突然疼痛加剧:肌肉破裂:1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat3, //
        questionConfig.diff3, //
        ["颈部、腋窝或腹股沟淋巴结无痛肿胀:淋巴瘤:2,3:", "淋巴结肿大，肝脏或脾脏肿大:白血病:2,3:", "发抖:低温:0,1:", "手臂或腿部麻木或虚弱:动脉粥样硬化:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat4, //
        questionConfig.diff3, //
        ["突然高烧、剧烈头痛，似乎与正常情况不同:脑膜炎:1,2,3:", "一只眼睛失明:多发性硬化症:0,3,4:", "手颤抖:帕金森病:0,3,4:", "运动抽动:抽动秽语综合征:0,1,4:", "注意力不集中和记忆力下降:亨廷顿氏病:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat5, //
        questionConfig.diff3, //
        ["牙龈发红或肿胀:牙周炎:2,3,4:", "牙龈发红或肿胀:牙龈炎:2,3,4:", "牙疼:蛀牙:0,4,3:", "吞咽问题:扁桃体炎:0,2,4:", "上颌畸形:唇裂:0,2,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat6, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat7, //
        questionConfig.diff3, //
        ["从耳朵流出的液体:中耳炎‎:1,2,3:", "听力丧失:耳聋:0,2,3:", "耳鸣:耳鸣:0,1,3:", "眩晕:梅尼埃病:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat8, //
        questionConfig.diff3, //
        []);
    addQuestions(
        result, //
        language, //
        questionConfig.cat9, //
        questionConfig.diff3, //
        ["模糊的视野:白内障:1,2,3:", "眼白呈粉红色或红色:结膜炎:0,2,3:", "剧烈的眼痛:青光眼:0,1,3:", "深度知觉和周边视力差:弱视:0,1,2:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat10, //
        questionConfig.diff3, //
        ["乳房或腋下出现新肿块:乳腺癌:1,2,3:", "尿液中有血:前列腺癌:2,3,4:", "排便习惯的改变:大肠癌:1,3,4:", "2 或 3 周后不会消失的咳嗽:肺癌:1,2,4:", "颜色、大小或出血的痣:皮肤癌:0,1,3:"]);
    addQuestions(
        result, //
        language, //
        questionConfig.cat11, //
        questionConfig.diff3, //
        ["皮肤、指甲和嘴唇呈蓝色:低氧血症:1,2,3:", "手、脸和脚抽搐:低钙血症:0,2,4:", "更频繁的排尿和口渴:高钙血症:0,1:", "骨骼变弱:低磷血症:0,4:", "肌肉痉挛或痉挛:高磷血症:0,1:"]);
  }




}
